const data = [{
			"label": "北京市",
			"position": [
				"116.405285",
				"39.904989"
			],
			"value": "110000",
			"children": [{
				"label": "北京城区",
				"position": [
					"116.405285",
					"39.904989"
				],
				"value": "110100",
				"children": [{
						"label": "东城区",
						"position": [
							"116.418757",
							"39.917544"
						],
						"value": "110101"
					},
					{
						"label": "西城区",
						"position": [
							"116.366794",
							"39.915309"
						],
						"value": "110102"
					},
					{
						"label": "朝阳区",
						"position": [
							"116.486409",
							"39.921489"
						],
						"value": "110105"
					},
					{
						"label": "丰台区",
						"position": [
							"116.286968",
							"39.863642"
						],
						"value": "110106"
					},
					{
						"label": "石景山区",
						"position": [
							"116.195445",
							"39.914601"
						],
						"value": "110107"
					},
					{
						"label": "海淀区",
						"position": [
							"116.310316",
							"39.956074"
						],
						"value": "110108"
					},
					{
						"label": "门头沟区",
						"position": [
							"116.105381",
							"39.937183"
						],
						"value": "110109"
					},
					{
						"label": "房山区",
						"position": [
							"116.139157",
							"39.735535"
						],
						"value": "110111"
					},
					{
						"label": "通州区",
						"position": [
							"116.658603",
							"39.902486"
						],
						"value": "110112"
					},
					{
						"label": "顺义区",
						"position": [
							"116.653525",
							"40.128936"
						],
						"value": "110113"
					},
					{
						"label": "昌平区",
						"position": [
							"116.235906",
							"40.218085"
						],
						"value": "110114"
					},
					{
						"label": "大兴区",
						"position": [
							"116.338033",
							"39.728908"
						],
						"value": "110115"
					},
					{
						"label": "怀柔区",
						"position": [
							"116.637122",
							"40.324272"
						],
						"value": "110116"
					},
					{
						"label": "平谷区",
						"position": [
							"117.112335",
							"40.144783"
						],
						"value": "110117"
					},
					{
						"label": "密云区",
						"position": [
							"116.843352",
							"40.377362"
						],
						"value": "110118"
					},
					{
						"label": "延庆区",
						"position": [
							"115.985006",
							"40.465325"
						],
						"value": "110119"
					}
				]
			}]
		},
		{
			"label": "天津市",
			"position": [
				"117.190182",
				"39.125596"
			],
			"value": "120000",
			"children": [{
				"label": "天津城区",
				"position": [
					"117.190182",
					"39.125596"
				],
				"value": "120100",
				"children": [{
						"label": "和平区",
						"position": [
							"117.195907",
							"39.118327"
						],
						"value": "120101"
					},
					{
						"label": "河东区",
						"position": [
							"117.226568",
							"39.122125"
						],
						"value": "120102"
					},
					{
						"label": "河西区",
						"position": [
							"117.217536",
							"39.101897"
						],
						"value": "120103"
					},
					{
						"label": "南开区",
						"position": [
							"117.164143",
							"39.120474"
						],
						"value": "120104"
					},
					{
						"label": "河北区",
						"position": [
							"117.201569",
							"39.156632"
						],
						"value": "120105"
					},
					{
						"label": "红桥区",
						"position": [
							"117.163301",
							"39.175066"
						],
						"value": "120106"
					},
					{
						"label": "东丽区",
						"position": [
							"117.313967",
							"39.087764"
						],
						"value": "120110"
					},
					{
						"label": "西青区",
						"position": [
							"117.012247",
							"39.139446"
						],
						"value": "120111"
					},
					{
						"label": "津南区",
						"position": [
							"117.382549",
							"38.989577"
						],
						"value": "120112"
					},
					{
						"label": "北辰区",
						"position": [
							"117.13482",
							"39.225555"
						],
						"value": "120113"
					},
					{
						"label": "武清区",
						"position": [
							"117.057959",
							"39.376925"
						],
						"value": "120114"
					},
					{
						"label": "宝坻区",
						"position": [
							"117.308094",
							"39.716965"
						],
						"value": "120115"
					},
					{
						"label": "滨海新区",
						"position": [
							"117.654173",
							"39.032846"
						],
						"value": "120116"
					},
					{
						"label": "宁河区",
						"position": [
							"117.82828",
							"39.328886"
						],
						"value": "120117"
					},
					{
						"label": "静海区",
						"position": [
							"116.925304",
							"38.935671"
						],
						"value": "120118"
					},
					{
						"label": "蓟州区",
						"position": [
							"117.407449",
							"40.045342"
						],
						"value": "120119"
					}
				]
			}]
		},
		{
			"label": "河北省",
			"position": [
				"114.502461",
				"38.045474"
			],
			"value": "130000",
			"children": [{
					"label": "石家庄市",
					"position": [
						"114.502461",
						"38.045474"
					],
					"value": "130100",
					"children": [{
							"label": "长安区",
							"position": [
								"114.548151",
								"38.047501"
							],
							"value": "130102"
						},
						{
							"label": "桥西区",
							"position": [
								"114.462931",
								"38.028383"
							],
							"value": "130104"
						},
						{
							"label": "新华区",
							"position": [
								"114.465974",
								"38.067142"
							],
							"value": "130105"
						},
						{
							"label": "井陉矿区",
							"position": [
								"114.058178",
								"38.069748"
							],
							"value": "130107"
						},
						{
							"label": "裕华区",
							"position": [
								"114.533257",
								"38.027696"
							],
							"value": "130108"
						},
						{
							"label": "藁城区",
							"position": [
								"114.849647",
								"38.033767"
							],
							"value": "130109"
						},
						{
							"label": "鹿泉区",
							"position": [
								"114.321023",
								"38.093994"
							],
							"value": "130110"
						},
						{
							"label": "栾城区",
							"position": [
								"114.654281",
								"37.886911"
							],
							"value": "130111"
						},
						{
							"label": "井陉县",
							"position": [
								"114.144488",
								"38.033614"
							],
							"value": "130121"
						},
						{
							"label": "正定县",
							"position": [
								"114.569887",
								"38.147835"
							],
							"value": "130123"
						},
						{
							"label": "行唐县",
							"position": [
								"114.552734",
								"38.437422"
							],
							"value": "130125"
						},
						{
							"label": "灵寿县",
							"position": [
								"114.37946",
								"38.306546"
							],
							"value": "130126"
						},
						{
							"label": "高邑县",
							"position": [
								"114.610699",
								"37.605714"
							],
							"value": "130127"
						},
						{
							"label": "深泽县",
							"position": [
								"115.200207",
								"38.18454"
							],
							"value": "130128"
						},
						{
							"label": "赞皇县",
							"position": [
								"114.387756",
								"37.660199"
							],
							"value": "130129"
						},
						{
							"label": "无极县",
							"position": [
								"114.977845",
								"38.176376"
							],
							"value": "130130"
						},
						{
							"label": "平山县",
							"position": [
								"114.184144",
								"38.259311"
							],
							"value": "130131"
						},
						{
							"label": "元氏县",
							"position": [
								"114.52618",
								"37.762514"
							],
							"value": "130132"
						},
						{
							"label": "赵县",
							"position": [
								"114.775362",
								"37.754341"
							],
							"value": "130133"
						},
						{
							"label": "辛集市",
							"position": [
								"115.217451",
								"37.92904"
							],
							"value": "130181"
						},
						{
							"label": "晋州市",
							"position": [
								"115.044886",
								"38.027478"
							],
							"value": "130183"
						},
						{
							"label": "新乐市",
							"position": [
								"114.68578",
								"38.344768"
							],
							"value": "130184"
						}
					]
				},
				{
					"label": "唐山市",
					"position": [
						"118.175393",
						"39.635113"
					],
					"value": "130200",
					"children": [{
							"label": "路南区",
							"position": [
								"118.210821",
								"39.615162"
							],
							"value": "130202"
						},
						{
							"label": "路北区",
							"position": [
								"118.174736",
								"39.628538"
							],
							"value": "130203"
						},
						{
							"label": "古冶区",
							"position": [
								"118.45429",
								"39.715736"
							],
							"value": "130204"
						},
						{
							"label": "开平区",
							"position": [
								"118.264425",
								"39.676171"
							],
							"value": "130205"
						},
						{
							"label": "丰南区",
							"position": [
								"118.110793",
								"39.56303"
							],
							"value": "130207"
						},
						{
							"label": "丰润区",
							"position": [
								"118.155779",
								"39.831363"
							],
							"value": "130208"
						},
						{
							"label": "曹妃甸区",
							"position": [
								"118.446585",
								"39.278277"
							],
							"value": "130209"
						},
						{
							"label": "滦南县",
							"position": [
								"118.681552",
								"39.506201"
							],
							"value": "130224"
						},
						{
							"label": "乐亭县",
							"position": [
								"118.905341",
								"39.42813"
							],
							"value": "130225"
						},
						{
							"label": "迁西县",
							"position": [
								"118.305139",
								"40.146238"
							],
							"value": "130227"
						},
						{
							"label": "玉田县",
							"position": [
								"117.753665",
								"39.887323"
							],
							"value": "130229"
						},
						{
							"label": "遵化市",
							"position": [
								"117.965875",
								"40.188616"
							],
							"value": "130281"
						},
						{
							"label": "迁安市",
							"position": [
								"118.701933",
								"40.012108"
							],
							"value": "130283"
						},
						{
							"label": "滦州市",
							"position": [
								"118.699546",
								"39.74485"
							],
							"value": "130284"
						}
					]
				},
				{
					"label": "秦皇岛市",
					"position": [
						"119.586579",
						"39.942531"
					],
					"value": "130300",
					"children": [{
							"label": "海港区",
							"position": [
								"119.596224",
								"39.943458"
							],
							"value": "130302"
						},
						{
							"label": "山海关区",
							"position": [
								"119.753591",
								"39.998023"
							],
							"value": "130303"
						},
						{
							"label": "北戴河区",
							"position": [
								"119.486286",
								"39.825121"
							],
							"value": "130304"
						},
						{
							"label": "抚宁区",
							"position": [
								"119.240651",
								"39.887053"
							],
							"value": "130306"
						},
						{
							"label": "青龙满族自治县",
							"position": [
								"118.954555",
								"40.406023"
							],
							"value": "130321"
						},
						{
							"label": "昌黎县",
							"position": [
								"119.164541",
								"39.709729"
							],
							"value": "130322"
						},
						{
							"label": "卢龙县",
							"position": [
								"118.881809",
								"39.891639"
							],
							"value": "130324"
						}
					]
				},
				{
					"label": "邯郸市",
					"position": [
						"114.490686",
						"36.612273"
					],
					"value": "130400",
					"children": [{
							"label": "邯山区",
							"position": [
								"114.484989",
								"36.603196"
							],
							"value": "130402"
						},
						{
							"label": "丛台区",
							"position": [
								"114.494703",
								"36.611082"
							],
							"value": "130403"
						},
						{
							"label": "复兴区",
							"position": [
								"114.458242",
								"36.615484"
							],
							"value": "130404"
						},
						{
							"label": "峰峰矿区",
							"position": [
								"114.209936",
								"36.420487"
							],
							"value": "130406"
						},
						{
							"label": "肥乡区",
							"position": [
								"114.805154",
								"36.555778"
							],
							"value": "130407"
						},
						{
							"label": "永年区",
							"position": [
								"114.496162",
								"36.776413"
							],
							"value": "130408"
						},
						{
							"label": "临漳县",
							"position": [
								"114.610703",
								"36.337604"
							],
							"value": "130423"
						},
						{
							"label": "成安县",
							"position": [
								"114.680356",
								"36.443832"
							],
							"value": "130424"
						},
						{
							"label": "大名县",
							"position": [
								"115.152586",
								"36.283316"
							],
							"value": "130425"
						},
						{
							"label": "涉县",
							"position": [
								"113.673297",
								"36.563143"
							],
							"value": "130426"
						},
						{
							"label": "磁县",
							"position": [
								"114.38208",
								"36.367673"
							],
							"value": "130427"
						},
						{
							"label": "邱县",
							"position": [
								"115.168584",
								"36.81325"
							],
							"value": "130430"
						},
						{
							"label": "鸡泽县",
							"position": [
								"114.878517",
								"36.914908"
							],
							"value": "130431"
						},
						{
							"label": "广平县",
							"position": [
								"114.950859",
								"36.483603"
							],
							"value": "130432"
						},
						{
							"label": "馆陶县",
							"position": [
								"115.289057",
								"36.539461"
							],
							"value": "130433"
						},
						{
							"label": "魏县",
							"position": [
								"114.93411",
								"36.354248"
							],
							"value": "130434"
						},
						{
							"label": "曲周县",
							"position": [
								"114.957588",
								"36.773398"
							],
							"value": "130435"
						},
						{
							"label": "武安市",
							"position": [
								"114.194581",
								"36.696115"
							],
							"value": "130481"
						}
					]
				},
				{
					"label": "邢台市",
					"position": [
						"114.508851",
						"37.0682"
					],
					"value": "130500",
					"children": [{
							"label": "襄都区",
							"position": [
								"114.507131",
								"37.064125"
							],
							"value": "130502"
						},
						{
							"label": "信都区",
							"position": [
								"114.473687",
								"37.068009"
							],
							"value": "130503"
						},
						{
							"label": "任泽区",
							"position": [
								"114.684469",
								"37.129952"
							],
							"value": "130505"
						},
						{
							"label": "南和区",
							"position": [
								"114.691377",
								"37.003812"
							],
							"value": "130506"
						},
						{
							"label": "临城县",
							"position": [
								"114.506873",
								"37.444009"
							],
							"value": "130522"
						},
						{
							"label": "内丘县",
							"position": [
								"114.511523",
								"37.287663"
							],
							"value": "130523"
						},
						{
							"label": "柏乡县",
							"position": [
								"114.693382",
								"37.483596"
							],
							"value": "130524"
						},
						{
							"label": "隆尧县",
							"position": [
								"114.776348",
								"37.350925"
							],
							"value": "130525"
						},
						{
							"label": "宁晋县",
							"position": [
								"114.921027",
								"37.618956"
							],
							"value": "130528"
						},
						{
							"label": "巨鹿县",
							"position": [
								"115.038782",
								"37.21768"
							],
							"value": "130529"
						},
						{
							"label": "新河县",
							"position": [
								"115.247537",
								"37.526216"
							],
							"value": "130530"
						},
						{
							"label": "广宗县",
							"position": [
								"115.142797",
								"37.075548"
							],
							"value": "130531"
						},
						{
							"label": "平乡县",
							"position": [
								"115.029218",
								"37.069404"
							],
							"value": "130532"
						},
						{
							"label": "威县",
							"position": [
								"115.272749",
								"36.983272"
							],
							"value": "130533"
						},
						{
							"label": "清河县",
							"position": [
								"115.668999",
								"37.059991"
							],
							"value": "130534"
						},
						{
							"label": "临西县",
							"position": [
								"115.498684",
								"36.8642"
							],
							"value": "130535"
						},
						{
							"label": "南宫市",
							"position": [
								"115.398102",
								"37.359668"
							],
							"value": "130581"
						},
						{
							"label": "沙河市",
							"position": [
								"114.504902",
								"36.861903"
							],
							"value": "130582"
						}
					]
				},
				{
					"label": "保定市",
					"position": [
						"115.482331",
						"38.867657"
					],
					"value": "130600",
					"children": [{
							"label": "竞秀区",
							"position": [
								"115.470659",
								"38.88662"
							],
							"value": "130602"
						},
						{
							"label": "莲池区",
							"position": [
								"115.500934",
								"38.865005"
							],
							"value": "130606"
						},
						{
							"label": "满城区",
							"position": [
								"115.32442",
								"38.95138"
							],
							"value": "130607"
						},
						{
							"label": "清苑区",
							"position": [
								"115.492221",
								"38.771012"
							],
							"value": "130608"
						},
						{
							"label": "徐水区",
							"position": [
								"115.64941",
								"39.020395"
							],
							"value": "130609"
						},
						{
							"label": "涞水县",
							"position": [
								"115.711985",
								"39.393148"
							],
							"value": "130623"
						},
						{
							"label": "阜平县",
							"position": [
								"114.198801",
								"38.847276"
							],
							"value": "130624"
						},
						{
							"label": "定兴县",
							"position": [
								"115.796895",
								"39.266195"
							],
							"value": "130626"
						},
						{
							"label": "唐县",
							"position": [
								"114.981241",
								"38.748542"
							],
							"value": "130627"
						},
						{
							"label": "高阳县",
							"position": [
								"115.778878",
								"38.690092"
							],
							"value": "130628"
						},
						{
							"label": "容城县",
							"position": [
								"115.866247",
								"39.05282"
							],
							"value": "130629"
						},
						{
							"label": "涞源县",
							"position": [
								"114.692567",
								"39.35755"
							],
							"value": "130630"
						},
						{
							"label": "望都县",
							"position": [
								"115.154009",
								"38.707448"
							],
							"value": "130631"
						},
						{
							"label": "安新县",
							"position": [
								"115.931979",
								"38.929912"
							],
							"value": "130632"
						},
						{
							"label": "易县",
							"position": [
								"115.501146",
								"39.35297"
							],
							"value": "130633"
						},
						{
							"label": "曲阳县",
							"position": [
								"114.704055",
								"38.619992"
							],
							"value": "130634"
						},
						{
							"label": "蠡县",
							"position": [
								"115.583631",
								"38.496429"
							],
							"value": "130635"
						},
						{
							"label": "顺平县",
							"position": [
								"115.132749",
								"38.845127"
							],
							"value": "130636"
						},
						{
							"label": "博野县",
							"position": [
								"115.461798",
								"38.458271"
							],
							"value": "130637"
						},
						{
							"label": "雄县",
							"position": [
								"116.107474",
								"38.990819"
							],
							"value": "130638"
						},
						{
							"label": "涿州市",
							"position": [
								"115.973409",
								"39.485765"
							],
							"value": "130681"
						},
						{
							"label": "定州市",
							"position": [
								"114.991389",
								"38.517602"
							],
							"value": "130682"
						},
						{
							"label": "安国市",
							"position": [
								"115.33141",
								"38.421367"
							],
							"value": "130683"
						},
						{
							"label": "高碑店市",
							"position": [
								"115.882704",
								"39.327689"
							],
							"value": "130684"
						}
					]
				},
				{
					"label": "张家口市",
					"position": [
						"114.884091",
						"40.811901"
					],
					"value": "130700",
					"children": [{
							"label": "桥东区",
							"position": [
								"114.885658",
								"40.813875"
							],
							"value": "130702"
						},
						{
							"label": "桥西区",
							"position": [
								"114.882127",
								"40.824385"
							],
							"value": "130703"
						},
						{
							"label": "宣化区",
							"position": [
								"115.0632",
								"40.609368"
							],
							"value": "130705"
						},
						{
							"label": "下花园区",
							"position": [
								"115.281002",
								"40.488645"
							],
							"value": "130706"
						},
						{
							"label": "万全区",
							"position": [
								"114.736131",
								"40.765136"
							],
							"value": "130708"
						},
						{
							"label": "崇礼区",
							"position": [
								"115.281652",
								"40.971302"
							],
							"value": "130709"
						},
						{
							"label": "张北县",
							"position": [
								"114.715951",
								"41.151713"
							],
							"value": "130722"
						},
						{
							"label": "康保县",
							"position": [
								"114.615809",
								"41.850046"
							],
							"value": "130723"
						},
						{
							"label": "沽源县",
							"position": [
								"115.684836",
								"41.667419"
							],
							"value": "130724"
						},
						{
							"label": "尚义县",
							"position": [
								"113.977713",
								"41.080091"
							],
							"value": "130725"
						},
						{
							"label": "蔚县",
							"position": [
								"114.582695",
								"39.837181"
							],
							"value": "130726"
						},
						{
							"label": "阳原县",
							"position": [
								"114.167343",
								"40.113419"
							],
							"value": "130727"
						},
						{
							"label": "怀安县",
							"position": [
								"114.422364",
								"40.671274"
							],
							"value": "130728"
						},
						{
							"label": "怀来县",
							"position": [
								"115.520846",
								"40.405405"
							],
							"value": "130730"
						},
						{
							"label": "涿鹿县",
							"position": [
								"115.219246",
								"40.378701"
							],
							"value": "130731"
						},
						{
							"label": "赤城县",
							"position": [
								"115.832708",
								"40.912081"
							],
							"value": "130732"
						}
					]
				},
				{
					"label": "承德市",
					"position": [
						"117.939152",
						"40.976204"
					],
					"value": "130800",
					"children": [{
							"label": "双桥区",
							"position": [
								"117.939152",
								"40.976204"
							],
							"value": "130802"
						},
						{
							"label": "双滦区",
							"position": [
								"117.797485",
								"40.959756"
							],
							"value": "130803"
						},
						{
							"label": "鹰手营子矿区",
							"position": [
								"117.661154",
								"40.546956"
							],
							"value": "130804"
						},
						{
							"label": "承德县",
							"position": [
								"118.172496",
								"40.768637"
							],
							"value": "130821"
						},
						{
							"label": "兴隆县",
							"position": [
								"117.507098",
								"40.418525"
							],
							"value": "130822"
						},
						{
							"label": "滦平县",
							"position": [
								"117.337124",
								"40.936644"
							],
							"value": "130824"
						},
						{
							"label": "隆化县",
							"position": [
								"117.736343",
								"41.316667"
							],
							"value": "130825"
						},
						{
							"label": "丰宁满族自治县",
							"position": [
								"116.65121",
								"41.209903"
							],
							"value": "130826"
						},
						{
							"label": "宽城满族自治县",
							"position": [
								"118.488642",
								"40.607981"
							],
							"value": "130827"
						},
						{
							"label": "围场满族蒙古族自治县",
							"position": [
								"117.764086",
								"41.949404"
							],
							"value": "130828"
						},
						{
							"label": "平泉市",
							"position": [
								"118.690238",
								"41.00561"
							],
							"value": "130881"
						}
					]
				},
				{
					"label": "沧州市",
					"position": [
						"116.857461",
						"38.310582"
					],
					"value": "130900",
					"children": [{
							"label": "新华区",
							"position": [
								"116.873049",
								"38.308273"
							],
							"value": "130902"
						},
						{
							"label": "运河区",
							"position": [
								"116.840063",
								"38.307405"
							],
							"value": "130903"
						},
						{
							"label": "沧县",
							"position": [
								"117.007478",
								"38.219856"
							],
							"value": "130921"
						},
						{
							"label": "青县",
							"position": [
								"116.838384",
								"38.569646"
							],
							"value": "130922"
						},
						{
							"label": "东光县",
							"position": [
								"116.542062",
								"37.88655"
							],
							"value": "130923"
						},
						{
							"label": "海兴县",
							"position": [
								"117.496606",
								"38.141582"
							],
							"value": "130924"
						},
						{
							"label": "盐山县",
							"position": [
								"117.229814",
								"38.056141"
							],
							"value": "130925"
						},
						{
							"label": "肃宁县",
							"position": [
								"115.835856",
								"38.427102"
							],
							"value": "130926"
						},
						{
							"label": "南皮县",
							"position": [
								"116.709171",
								"38.042439"
							],
							"value": "130927"
						},
						{
							"label": "吴桥县",
							"position": [
								"116.391512",
								"37.628182"
							],
							"value": "130928"
						},
						{
							"label": "献县",
							"position": [
								"116.123844",
								"38.189661"
							],
							"value": "130929"
						},
						{
							"label": "孟村回族自治县",
							"position": [
								"117.105104",
								"38.057953"
							],
							"value": "130930"
						},
						{
							"label": "泊头市",
							"position": [
								"116.570163",
								"38.073479"
							],
							"value": "130981"
						},
						{
							"label": "任丘市",
							"position": [
								"116.106764",
								"38.706513"
							],
							"value": "130982"
						},
						{
							"label": "黄骅市",
							"position": [
								"117.343803",
								"38.369238"
							],
							"value": "130983"
						},
						{
							"label": "河间市",
							"position": [
								"116.089452",
								"38.44149"
							],
							"value": "130984"
						}
					]
				},
				{
					"label": "廊坊市",
					"position": [
						"116.704441",
						"39.523927"
					],
					"value": "131000",
					"children": [{
							"label": "安次区",
							"position": [
								"116.694544",
								"39.502569"
							],
							"value": "131002"
						},
						{
							"label": "广阳区",
							"position": [
								"116.713708",
								"39.521931"
							],
							"value": "131003"
						},
						{
							"label": "固安县",
							"position": [
								"116.299894",
								"39.436468"
							],
							"value": "131022"
						},
						{
							"label": "永清县",
							"position": [
								"116.498089",
								"39.319717"
							],
							"value": "131023"
						},
						{
							"label": "香河县",
							"position": [
								"117.007161",
								"39.757212"
							],
							"value": "131024"
						},
						{
							"label": "大城县",
							"position": [
								"116.640735",
								"38.699215"
							],
							"value": "131025"
						},
						{
							"label": "文安县",
							"position": [
								"116.460107",
								"38.866801"
							],
							"value": "131026"
						},
						{
							"label": "大厂回族自治县",
							"position": [
								"116.986501",
								"39.889266"
							],
							"value": "131028"
						},
						{
							"label": "霸州市",
							"position": [
								"116.392021",
								"39.117331"
							],
							"value": "131081"
						},
						{
							"label": "三河市",
							"position": [
								"117.077018",
								"39.982778"
							],
							"value": "131082"
						}
					]
				},
				{
					"label": "衡水市",
					"position": [
						"115.665993",
						"37.735097"
					],
					"value": "131100",
					"children": [{
							"label": "桃城区",
							"position": [
								"115.694945",
								"37.732237"
							],
							"value": "131102"
						},
						{
							"label": "冀州区",
							"position": [
								"115.579173",
								"37.542788"
							],
							"value": "131103"
						},
						{
							"label": "枣强县",
							"position": [
								"115.726499",
								"37.511512"
							],
							"value": "131121"
						},
						{
							"label": "武邑县",
							"position": [
								"115.892415",
								"37.803774"
							],
							"value": "131122"
						},
						{
							"label": "武强县",
							"position": [
								"115.970236",
								"38.03698"
							],
							"value": "131123"
						},
						{
							"label": "饶阳县",
							"position": [
								"115.726577",
								"38.232671"
							],
							"value": "131124"
						},
						{
							"label": "安平县",
							"position": [
								"115.519627",
								"38.233511"
							],
							"value": "131125"
						},
						{
							"label": "故城县",
							"position": [
								"115.966747",
								"37.350981"
							],
							"value": "131126"
						},
						{
							"label": "景县",
							"position": [
								"116.258446",
								"37.686622"
							],
							"value": "131127"
						},
						{
							"label": "阜城县",
							"position": [
								"116.164727",
								"37.869945"
							],
							"value": "131128"
						},
						{
							"label": "深州市",
							"position": [
								"115.554596",
								"38.00347"
							],
							"value": "131182"
						}
					]
				}
			]
		},
		{
			"label": "山西省",
			"position": [
				"112.549248",
				"37.857014"
			],
			"value": "140000",
			"children": [{
					"label": "太原市",
					"position": [
						"112.549248",
						"37.857014"
					],
					"value": "140100",
					"children": [{
							"label": "小店区",
							"position": [
								"112.564273",
								"37.817974"
							],
							"value": "140105"
						},
						{
							"label": "迎泽区",
							"position": [
								"112.558851",
								"37.855804"
							],
							"value": "140106"
						},
						{
							"label": "杏花岭区",
							"position": [
								"112.560743",
								"37.879291"
							],
							"value": "140107"
						},
						{
							"label": "尖草坪区",
							"position": [
								"112.487122",
								"37.939893"
							],
							"value": "140108"
						},
						{
							"label": "万柏林区",
							"position": [
								"112.522258",
								"37.862653"
							],
							"value": "140109"
						},
						{
							"label": "晋源区",
							"position": [
								"112.477849",
								"37.715619"
							],
							"value": "140110"
						},
						{
							"label": "清徐县",
							"position": [
								"112.357961",
								"37.60729"
							],
							"value": "140121"
						},
						{
							"label": "阳曲县",
							"position": [
								"112.673818",
								"38.058797"
							],
							"value": "140122"
						},
						{
							"label": "娄烦县",
							"position": [
								"111.793798",
								"38.066035"
							],
							"value": "140123"
						},
						{
							"label": "古交市",
							"position": [
								"112.174353",
								"37.908534"
							],
							"value": "140181"
						}
					]
				},
				{
					"label": "大同市",
					"position": [
						"113.295259",
						"40.09031"
					],
					"value": "140200",
					"children": [{
							"label": "新荣区",
							"position": [
								"113.141044",
								"40.258269"
							],
							"value": "140212"
						},
						{
							"label": "平城区",
							"position": [
								"113.298027",
								"40.075667"
							],
							"value": "140213"
						},
						{
							"label": "云冈区",
							"position": [
								"113.149693",
								"40.005405"
							],
							"value": "140214"
						},
						{
							"label": "云州区",
							"position": [
								"113.61244",
								"40.040295"
							],
							"value": "140215"
						},
						{
							"label": "阳高县",
							"position": [
								"113.749871",
								"40.364927"
							],
							"value": "140221"
						},
						{
							"label": "天镇县",
							"position": [
								"114.09112",
								"40.421336"
							],
							"value": "140222"
						},
						{
							"label": "广灵县",
							"position": [
								"114.279252",
								"39.763051"
							],
							"value": "140223"
						},
						{
							"label": "灵丘县",
							"position": [
								"114.23576",
								"39.438867"
							],
							"value": "140224"
						},
						{
							"label": "浑源县",
							"position": [
								"113.698091",
								"39.699099"
							],
							"value": "140225"
						},
						{
							"label": "左云县",
							"position": [
								"112.70641",
								"40.012873"
							],
							"value": "140226"
						}
					]
				},
				{
					"label": "阳泉市",
					"position": [
						"113.583285",
						"37.861188"
					],
					"value": "140300",
					"children": [{
							"label": "城区",
							"position": [
								"113.586513",
								"37.860938"
							],
							"value": "140302"
						},
						{
							"label": "矿区",
							"position": [
								"113.559066",
								"37.870085"
							],
							"value": "140303"
						},
						{
							"label": "郊区",
							"position": [
								"113.58664",
								"37.94096"
							],
							"value": "140311"
						},
						{
							"label": "平定县",
							"position": [
								"113.631049",
								"37.800289"
							],
							"value": "140321"
						},
						{
							"label": "盂县",
							"position": [
								"113.41223",
								"38.086131"
							],
							"value": "140322"
						}
					]
				},
				{
					"label": "长治市",
					"position": [
						"113.113556",
						"36.191112"
					],
					"value": "140400",
					"children": [{
							"label": "潞州区",
							"position": [
								"113.114107",
								"36.187895"
							],
							"value": "140403"
						},
						{
							"label": "上党区",
							"position": [
								"113.056679",
								"36.052438"
							],
							"value": "140404"
						},
						{
							"label": "屯留区",
							"position": [
								"112.892741",
								"36.314072"
							],
							"value": "140405"
						},
						{
							"label": "潞城区",
							"position": [
								"113.223245",
								"36.332232"
							],
							"value": "140406"
						},
						{
							"label": "襄垣县",
							"position": [
								"113.050094",
								"36.532854"
							],
							"value": "140423"
						},
						{
							"label": "平顺县",
							"position": [
								"113.438791",
								"36.200202"
							],
							"value": "140425"
						},
						{
							"label": "黎城县",
							"position": [
								"113.387366",
								"36.502971"
							],
							"value": "140426"
						},
						{
							"label": "壶关县",
							"position": [
								"113.206138",
								"36.110938"
							],
							"value": "140427"
						},
						{
							"label": "长子县",
							"position": [
								"112.884656",
								"36.119484"
							],
							"value": "140428"
						},
						{
							"label": "武乡县",
							"position": [
								"112.8653",
								"36.834315"
							],
							"value": "140429"
						},
						{
							"label": "沁县",
							"position": [
								"112.70138",
								"36.757123"
							],
							"value": "140430"
						},
						{
							"label": "沁源县",
							"position": [
								"112.340878",
								"36.500777"
							],
							"value": "140431"
						}
					]
				},
				{
					"label": "晋城市",
					"position": [
						"112.851274",
						"35.497553"
					],
					"value": "140500",
					"children": [{
							"label": "城区",
							"position": [
								"112.853106",
								"35.496641"
							],
							"value": "140502"
						},
						{
							"label": "沁水县",
							"position": [
								"112.187213",
								"35.689472"
							],
							"value": "140521"
						},
						{
							"label": "阳城县",
							"position": [
								"112.422014",
								"35.482177"
							],
							"value": "140522"
						},
						{
							"label": "陵川县",
							"position": [
								"113.278877",
								"35.775614"
							],
							"value": "140524"
						},
						{
							"label": "泽州县",
							"position": [
								"112.899137",
								"35.617221"
							],
							"value": "140525"
						},
						{
							"label": "高平市",
							"position": [
								"112.930691",
								"35.791355"
							],
							"value": "140581"
						}
					]
				},
				{
					"label": "朔州市",
					"position": [
						"112.433387",
						"39.331261"
					],
					"value": "140600",
					"children": [{
							"label": "朔城区",
							"position": [
								"112.428676",
								"39.324525"
							],
							"value": "140602"
						},
						{
							"label": "平鲁区",
							"position": [
								"112.295227",
								"39.515603"
							],
							"value": "140603"
						},
						{
							"label": "山阴县",
							"position": [
								"112.816396",
								"39.52677"
							],
							"value": "140621"
						},
						{
							"label": "应县",
							"position": [
								"113.187505",
								"39.559187"
							],
							"value": "140622"
						},
						{
							"label": "右玉县",
							"position": [
								"112.465588",
								"39.988812"
							],
							"value": "140623"
						},
						{
							"label": "怀仁市",
							"position": [
								"113.100511",
								"39.820789"
							],
							"value": "140681"
						}
					]
				},
				{
					"label": "晋中市",
					"position": [
						"112.736465",
						"37.696495"
					],
					"value": "140700",
					"children": [{
							"label": "榆次区",
							"position": [
								"112.740056",
								"37.6976"
							],
							"value": "140702"
						},
						{
							"label": "太谷区",
							"position": [
								"112.554103",
								"37.424595"
							],
							"value": "140703"
						},
						{
							"label": "榆社县",
							"position": [
								"112.973521",
								"37.069019"
							],
							"value": "140721"
						},
						{
							"label": "左权县",
							"position": [
								"113.377834",
								"37.079672"
							],
							"value": "140722"
						},
						{
							"label": "和顺县",
							"position": [
								"113.572919",
								"37.327027"
							],
							"value": "140723"
						},
						{
							"label": "昔阳县",
							"position": [
								"113.706166",
								"37.60437"
							],
							"value": "140724"
						},
						{
							"label": "寿阳县",
							"position": [
								"113.177708",
								"37.891136"
							],
							"value": "140725"
						},
						{
							"label": "祁县",
							"position": [
								"112.330532",
								"37.358739"
							],
							"value": "140727"
						},
						{
							"label": "平遥县",
							"position": [
								"112.174059",
								"37.195474"
							],
							"value": "140728"
						},
						{
							"label": "灵石县",
							"position": [
								"111.772759",
								"36.847469"
							],
							"value": "140729"
						},
						{
							"label": "介休市",
							"position": [
								"111.913857",
								"37.027616"
							],
							"value": "140781"
						}
					]
				},
				{
					"label": "运城市",
					"position": [
						"111.003957",
						"35.022778"
					],
					"value": "140800",
					"children": [{
							"label": "盐湖区",
							"position": [
								"111.000627",
								"35.025643"
							],
							"value": "140802"
						},
						{
							"label": "临猗县",
							"position": [
								"110.77493",
								"35.141883"
							],
							"value": "140821"
						},
						{
							"label": "万荣县",
							"position": [
								"110.843561",
								"35.417042"
							],
							"value": "140822"
						},
						{
							"label": "闻喜县",
							"position": [
								"111.220306",
								"35.353839"
							],
							"value": "140823"
						},
						{
							"label": "稷山县",
							"position": [
								"110.978996",
								"35.600412"
							],
							"value": "140824"
						},
						{
							"label": "新绛县",
							"position": [
								"111.225205",
								"35.613697"
							],
							"value": "140825"
						},
						{
							"label": "绛县",
							"position": [
								"111.576182",
								"35.49045"
							],
							"value": "140826"
						},
						{
							"label": "垣曲县",
							"position": [
								"111.67099",
								"35.298293"
							],
							"value": "140827"
						},
						{
							"label": "夏县",
							"position": [
								"111.223174",
								"35.140441"
							],
							"value": "140828"
						},
						{
							"label": "平陆县",
							"position": [
								"111.212377",
								"34.837256"
							],
							"value": "140829"
						},
						{
							"label": "芮城县",
							"position": [
								"110.69114",
								"34.694769"
							],
							"value": "140830"
						},
						{
							"label": "永济市",
							"position": [
								"110.447984",
								"34.865125"
							],
							"value": "140881"
						},
						{
							"label": "河津市",
							"position": [
								"110.710268",
								"35.59715"
							],
							"value": "140882"
						}
					]
				},
				{
					"label": "忻州市",
					"position": [
						"112.733538",
						"38.41769"
					],
					"value": "140900",
					"children": [{
							"label": "忻府区",
							"position": [
								"112.734112",
								"38.417743"
							],
							"value": "140902"
						},
						{
							"label": "定襄县",
							"position": [
								"112.963231",
								"38.484948"
							],
							"value": "140921"
						},
						{
							"label": "五台县",
							"position": [
								"113.259012",
								"38.725711"
							],
							"value": "140922"
						},
						{
							"label": "代县",
							"position": [
								"112.962519",
								"39.065138"
							],
							"value": "140923"
						},
						{
							"label": "繁峙县",
							"position": [
								"113.267707",
								"39.188104"
							],
							"value": "140924"
						},
						{
							"label": "宁武县",
							"position": [
								"112.307936",
								"39.001718"
							],
							"value": "140925"
						},
						{
							"label": "静乐县",
							"position": [
								"111.940231",
								"38.355947"
							],
							"value": "140926"
						},
						{
							"label": "神池县",
							"position": [
								"112.200438",
								"39.088467"
							],
							"value": "140927"
						},
						{
							"label": "五寨县",
							"position": [
								"111.841015",
								"38.912761"
							],
							"value": "140928"
						},
						{
							"label": "岢岚县",
							"position": [
								"111.56981",
								"38.705625"
							],
							"value": "140929"
						},
						{
							"label": "河曲县",
							"position": [
								"111.146609",
								"39.381895"
							],
							"value": "140930"
						},
						{
							"label": "保德县",
							"position": [
								"111.085688",
								"39.022576"
							],
							"value": "140931"
						},
						{
							"label": "偏关县",
							"position": [
								"111.500477",
								"39.442153"
							],
							"value": "140932"
						},
						{
							"label": "原平市",
							"position": [
								"112.713132",
								"38.729186"
							],
							"value": "140981"
						}
					]
				},
				{
					"label": "临汾市",
					"position": [
						"111.517973",
						"36.08415"
					],
					"value": "141000",
					"children": [{
							"label": "尧都区",
							"position": [
								"111.522945",
								"36.080366"
							],
							"value": "141002"
						},
						{
							"label": "曲沃县",
							"position": [
								"111.475529",
								"35.641387"
							],
							"value": "141021"
						},
						{
							"label": "翼城县",
							"position": [
								"111.713508",
								"35.738621"
							],
							"value": "141022"
						},
						{
							"label": "襄汾县",
							"position": [
								"111.442932",
								"35.876139"
							],
							"value": "141023"
						},
						{
							"label": "洪洞县",
							"position": [
								"111.673692",
								"36.255742"
							],
							"value": "141024"
						},
						{
							"label": "古县",
							"position": [
								"111.920207",
								"36.26855"
							],
							"value": "141025"
						},
						{
							"label": "安泽县",
							"position": [
								"112.251372",
								"36.146032"
							],
							"value": "141026"
						},
						{
							"label": "浮山县",
							"position": [
								"111.850039",
								"35.971359"
							],
							"value": "141027"
						},
						{
							"label": "吉县",
							"position": [
								"110.682853",
								"36.099355"
							],
							"value": "141028"
						},
						{
							"label": "乡宁县",
							"position": [
								"110.857365",
								"35.975402"
							],
							"value": "141029"
						},
						{
							"label": "大宁县",
							"position": [
								"110.751283",
								"36.46383"
							],
							"value": "141030"
						},
						{
							"label": "隰县",
							"position": [
								"110.935809",
								"36.692675"
							],
							"value": "141031"
						},
						{
							"label": "永和县",
							"position": [
								"110.631276",
								"36.760614"
							],
							"value": "141032"
						},
						{
							"label": "蒲县",
							"position": [
								"111.09733",
								"36.411682"
							],
							"value": "141033"
						},
						{
							"label": "汾西县",
							"position": [
								"111.563021",
								"36.653368"
							],
							"value": "141034"
						},
						{
							"label": "侯马市",
							"position": [
								"111.371272",
								"35.620302"
							],
							"value": "141081"
						},
						{
							"label": "霍州市",
							"position": [
								"111.723103",
								"36.57202"
							],
							"value": "141082"
						}
					]
				},
				{
					"label": "吕梁市",
					"position": [
						"111.134335",
						"37.524366"
					],
					"value": "141100",
					"children": [{
							"label": "离石区",
							"position": [
								"111.134462",
								"37.524037"
							],
							"value": "141102"
						},
						{
							"label": "文水县",
							"position": [
								"112.032595",
								"37.436314"
							],
							"value": "141121"
						},
						{
							"label": "交城县",
							"position": [
								"112.159154",
								"37.555155"
							],
							"value": "141122"
						},
						{
							"label": "兴县",
							"position": [
								"111.124816",
								"38.464136"
							],
							"value": "141123"
						},
						{
							"label": "临县",
							"position": [
								"110.995963",
								"37.960806"
							],
							"value": "141124"
						},
						{
							"label": "柳林县",
							"position": [
								"110.89613",
								"37.431664"
							],
							"value": "141125"
						},
						{
							"label": "石楼县",
							"position": [
								"110.837119",
								"36.999426"
							],
							"value": "141126"
						},
						{
							"label": "岚县",
							"position": [
								"111.671555",
								"38.278654"
							],
							"value": "141127"
						},
						{
							"label": "方山县",
							"position": [
								"111.238885",
								"37.892632"
							],
							"value": "141128"
						},
						{
							"label": "中阳县",
							"position": [
								"111.193319",
								"37.342054"
							],
							"value": "141129"
						},
						{
							"label": "交口县",
							"position": [
								"111.183188",
								"36.983068"
							],
							"value": "141130"
						},
						{
							"label": "孝义市",
							"position": [
								"111.781568",
								"37.144474"
							],
							"value": "141181"
						},
						{
							"label": "汾阳市",
							"position": [
								"111.785273",
								"37.267742"
							],
							"value": "141182"
						}
					]
				}
			]
		},
		{
			"label": "内蒙古自治区",
			"position": [
				"111.670801",
				"40.818311"
			],
			"value": "150000",
			"children": [{
					"label": "呼和浩特市",
					"position": [
						"111.670801",
						"40.818311"
					],
					"value": "150100",
					"children": [{
							"label": "新城区",
							"position": [
								"111.685964",
								"40.826225"
							],
							"value": "150102"
						},
						{
							"label": "回民区",
							"position": [
								"111.662162",
								"40.815149"
							],
							"value": "150103"
						},
						{
							"label": "玉泉区",
							"position": [
								"111.66543",
								"40.799421"
							],
							"value": "150104"
						},
						{
							"label": "赛罕区",
							"position": [
								"111.698463",
								"40.807834"
							],
							"value": "150105"
						},
						{
							"label": "土默特左旗",
							"position": [
								"111.133615",
								"40.720416"
							],
							"value": "150121"
						},
						{
							"label": "托克托县",
							"position": [
								"111.197317",
								"40.276729"
							],
							"value": "150122"
						},
						{
							"label": "和林格尔县",
							"position": [
								"111.824143",
								"40.380288"
							],
							"value": "150123"
						},
						{
							"label": "清水河县",
							"position": [
								"111.67222",
								"39.912479"
							],
							"value": "150124"
						},
						{
							"label": "武川县",
							"position": [
								"111.456563",
								"41.094483"
							],
							"value": "150125"
						}
					]
				},
				{
					"label": "包头市",
					"position": [
						"109.840405",
						"40.658168"
					],
					"value": "150200",
					"children": [{
							"label": "东河区",
							"position": [
								"110.026895",
								"40.587056"
							],
							"value": "150202"
						},
						{
							"label": "昆都仑区",
							"position": [
								"109.822932",
								"40.661345"
							],
							"value": "150203"
						},
						{
							"label": "青山区",
							"position": [
								"109.880049",
								"40.668558"
							],
							"value": "150204"
						},
						{
							"label": "石拐区",
							"position": [
								"110.272565",
								"40.672094"
							],
							"value": "150205"
						},
						{
							"label": "白云鄂博矿区",
							"position": [
								"109.97016",
								"41.769246"
							],
							"value": "150206"
						},
						{
							"label": "九原区",
							"position": [
								"109.968122",
								"40.600581"
							],
							"value": "150207"
						},
						{
							"label": "土默特右旗",
							"position": [
								"110.526766",
								"40.566434"
							],
							"value": "150221"
						},
						{
							"label": "固阳县",
							"position": [
								"110.063421",
								"41.030004"
							],
							"value": "150222"
						},
						{
							"label": "达尔罕茂明安联合旗",
							"position": [
								"110.438452",
								"41.702836"
							],
							"value": "150223"
						}
					]
				},
				{
					"label": "乌海市",
					"position": [
						"106.825563",
						"39.673734"
					],
					"value": "150300",
					"children": [{
							"label": "海勃湾区",
							"position": [
								"106.817762",
								"39.673527"
							],
							"value": "150302"
						},
						{
							"label": "海南区",
							"position": [
								"106.884789",
								"39.44153"
							],
							"value": "150303"
						},
						{
							"label": "乌达区",
							"position": [
								"106.722711",
								"39.502288"
							],
							"value": "150304"
						}
					]
				},
				{
					"label": "赤峰市",
					"position": [
						"118.956806",
						"42.275317"
					],
					"value": "150400",
					"children": [{
							"label": "红山区",
							"position": [
								"118.961087",
								"42.269732"
							],
							"value": "150402"
						},
						{
							"label": "元宝山区",
							"position": [
								"119.289877",
								"42.041168"
							],
							"value": "150403"
						},
						{
							"label": "松山区",
							"position": [
								"118.938958",
								"42.281046"
							],
							"value": "150404"
						},
						{
							"label": "阿鲁科尔沁旗",
							"position": [
								"120.094969",
								"43.87877"
							],
							"value": "150421"
						},
						{
							"label": "巴林左旗",
							"position": [
								"119.391737",
								"43.980715"
							],
							"value": "150422"
						},
						{
							"label": "巴林右旗",
							"position": [
								"118.678347",
								"43.528963"
							],
							"value": "150423"
						},
						{
							"label": "林西县",
							"position": [
								"118.05775",
								"43.605326"
							],
							"value": "150424"
						},
						{
							"label": "克什克腾旗",
							"position": [
								"117.542465",
								"43.256233"
							],
							"value": "150425"
						},
						{
							"label": "翁牛特旗",
							"position": [
								"119.022619",
								"42.937128"
							],
							"value": "150426"
						},
						{
							"label": "喀喇沁旗",
							"position": [
								"118.708572",
								"41.92778"
							],
							"value": "150428"
						},
						{
							"label": "宁城县",
							"position": [
								"119.339242",
								"41.598692"
							],
							"value": "150429"
						},
						{
							"label": "敖汉旗",
							"position": [
								"119.906486",
								"42.287012"
							],
							"value": "150430"
						}
					]
				},
				{
					"label": "通辽市",
					"position": [
						"122.263119",
						"43.617429"
					],
					"value": "150500",
					"children": [{
							"label": "科尔沁区",
							"position": [
								"122.264042",
								"43.617422"
							],
							"value": "150502"
						},
						{
							"label": "科尔沁左翼中旗",
							"position": [
								"123.313873",
								"44.127166"
							],
							"value": "150521"
						},
						{
							"label": "科尔沁左翼后旗",
							"position": [
								"122.355155",
								"42.954564"
							],
							"value": "150522"
						},
						{
							"label": "开鲁县",
							"position": [
								"121.308797",
								"43.602432"
							],
							"value": "150523"
						},
						{
							"label": "库伦旗",
							"position": [
								"121.774886",
								"42.734692"
							],
							"value": "150524"
						},
						{
							"label": "奈曼旗",
							"position": [
								"120.662543",
								"42.84685"
							],
							"value": "150525"
						},
						{
							"label": "扎鲁特旗",
							"position": [
								"120.905275",
								"44.555294"
							],
							"value": "150526"
						},
						{
							"label": "霍林郭勒市",
							"position": [
								"119.657862",
								"45.532361"
							],
							"value": "150581"
						}
					]
				},
				{
					"label": "鄂尔多斯市",
					"position": [
						"109.99029",
						"39.817179"
					],
					"value": "150600",
					"children": [{
							"label": "东胜区",
							"position": [
								"109.98945",
								"39.81788"
							],
							"value": "150602"
						},
						{
							"label": "康巴什区",
							"position": [
								"109.790076",
								"39.607472"
							],
							"value": "150603"
						},
						{
							"label": "达拉特旗",
							"position": [
								"110.040281",
								"40.404076"
							],
							"value": "150621"
						},
						{
							"label": "准格尔旗",
							"position": [
								"111.238332",
								"39.865221"
							],
							"value": "150622"
						},
						{
							"label": "鄂托克前旗",
							"position": [
								"107.48172",
								"38.183257"
							],
							"value": "150623"
						},
						{
							"label": "鄂托克旗",
							"position": [
								"107.982604",
								"39.095752"
							],
							"value": "150624"
						},
						{
							"label": "杭锦旗",
							"position": [
								"108.736324",
								"39.831789"
							],
							"value": "150625"
						},
						{
							"label": "乌审旗",
							"position": [
								"108.842454",
								"38.596611"
							],
							"value": "150626"
						},
						{
							"label": "伊金霍洛旗",
							"position": [
								"109.787402",
								"39.604312"
							],
							"value": "150627"
						}
					]
				},
				{
					"label": "呼伦贝尔市",
					"position": [
						"119.758168",
						"49.215333"
					],
					"value": "150700",
					"children": [{
							"label": "海拉尔区",
							"position": [
								"119.764923",
								"49.213889"
							],
							"value": "150702"
						},
						{
							"label": "扎赉诺尔区",
							"position": [
								"117.716373",
								"49.456567"
							],
							"value": "150703"
						},
						{
							"label": "阿荣旗",
							"position": [
								"123.464615",
								"48.130503"
							],
							"value": "150721"
						},
						{
							"label": "莫力达瓦达斡尔族自治旗",
							"position": [
								"124.507401",
								"48.478385"
							],
							"value": "150722"
						},
						{
							"label": "鄂伦春自治旗",
							"position": [
								"123.725684",
								"50.590177"
							],
							"value": "150723"
						},
						{
							"label": "鄂温克族自治旗",
							"position": [
								"119.754041",
								"49.143293"
							],
							"value": "150724"
						},
						{
							"label": "陈巴尔虎旗",
							"position": [
								"119.437609",
								"49.328422"
							],
							"value": "150725"
						},
						{
							"label": "新巴尔虎左旗",
							"position": [
								"118.267454",
								"48.216571"
							],
							"value": "150726"
						},
						{
							"label": "新巴尔虎右旗",
							"position": [
								"116.825991",
								"48.669134"
							],
							"value": "150727"
						},
						{
							"label": "满洲里市",
							"position": [
								"117.455561",
								"49.590788"
							],
							"value": "150781"
						},
						{
							"label": "牙克石市",
							"position": [
								"120.729005",
								"49.287024"
							],
							"value": "150782"
						},
						{
							"label": "扎兰屯市",
							"position": [
								"122.744401",
								"48.007412"
							],
							"value": "150783"
						},
						{
							"label": "额尔古纳市",
							"position": [
								"120.178636",
								"50.2439"
							],
							"value": "150784"
						},
						{
							"label": "根河市",
							"position": [
								"121.532724",
								"50.780454"
							],
							"value": "150785"
						}
					]
				},
				{
					"label": "巴彦淖尔市",
					"position": [
						"107.416959",
						"40.757402"
					],
					"value": "150800",
					"children": [{
							"label": "临河区",
							"position": [
								"107.417018",
								"40.757092"
							],
							"value": "150802"
						},
						{
							"label": "五原县",
							"position": [
								"108.270658",
								"41.097639"
							],
							"value": "150821"
						},
						{
							"label": "磴口县",
							"position": [
								"107.006056",
								"40.330479"
							],
							"value": "150822"
						},
						{
							"label": "乌拉特前旗",
							"position": [
								"108.656816",
								"40.725209"
							],
							"value": "150823"
						},
						{
							"label": "乌拉特中旗",
							"position": [
								"108.515255",
								"41.57254"
							],
							"value": "150824"
						},
						{
							"label": "乌拉特后旗",
							"position": [
								"107.074941",
								"41.084307"
							],
							"value": "150825"
						},
						{
							"label": "杭锦后旗",
							"position": [
								"107.147682",
								"40.888797"
							],
							"value": "150826"
						}
					]
				},
				{
					"label": "乌兰察布市",
					"position": [
						"113.114543",
						"41.034126"
					],
					"value": "150900",
					"children": [{
							"label": "集宁区",
							"position": [
								"113.116453",
								"41.034134"
							],
							"value": "150902"
						},
						{
							"label": "卓资县",
							"position": [
								"112.577702",
								"40.89576"
							],
							"value": "150921"
						},
						{
							"label": "化德县",
							"position": [
								"114.01008",
								"41.899335"
							],
							"value": "150922"
						},
						{
							"label": "商都县",
							"position": [
								"113.560643",
								"41.560163"
							],
							"value": "150923"
						},
						{
							"label": "兴和县",
							"position": [
								"113.834009",
								"40.872437"
							],
							"value": "150924"
						},
						{
							"label": "凉城县",
							"position": [
								"112.500911",
								"40.531627"
							],
							"value": "150925"
						},
						{
							"label": "察哈尔右翼前旗",
							"position": [
								"113.211958",
								"40.786859"
							],
							"value": "150926"
						},
						{
							"label": "察哈尔右翼中旗",
							"position": [
								"112.633563",
								"41.274212"
							],
							"value": "150927"
						},
						{
							"label": "察哈尔右翼后旗",
							"position": [
								"113.1906",
								"41.447213"
							],
							"value": "150928"
						},
						{
							"label": "四子王旗",
							"position": [
								"111.70123",
								"41.528114"
							],
							"value": "150929"
						},
						{
							"label": "丰镇市",
							"position": [
								"113.163462",
								"40.437534"
							],
							"value": "150981"
						}
					]
				},
				{
					"label": "兴安盟",
					"position": [
						"122.070317",
						"46.076268"
					],
					"value": "152200",
					"children": [{
							"label": "乌兰浩特市",
							"position": [
								"122.068975",
								"46.077238"
							],
							"value": "152201"
						},
						{
							"label": "阿尔山市",
							"position": [
								"119.943656",
								"47.177"
							],
							"value": "152202"
						},
						{
							"label": "科尔沁右翼前旗",
							"position": [
								"121.957544",
								"46.076497"
							],
							"value": "152221"
						},
						{
							"label": "科尔沁右翼中旗",
							"position": [
								"121.472818",
								"45.059645"
							],
							"value": "152222"
						},
						{
							"label": "扎赉特旗",
							"position": [
								"122.909332",
								"46.725136"
							],
							"value": "152223"
						},
						{
							"label": "突泉县",
							"position": [
								"121.564856",
								"45.380986"
							],
							"value": "152224"
						}
					]
				},
				{
					"label": "锡林郭勒盟",
					"position": [
						"116.090996",
						"43.944018"
					],
					"value": "152500",
					"children": [{
							"label": "二连浩特市",
							"position": [
								"111.97981",
								"43.652895"
							],
							"value": "152501"
						},
						{
							"label": "锡林浩特市",
							"position": [
								"116.091903",
								"43.944301"
							],
							"value": "152502"
						},
						{
							"label": "阿巴嘎旗",
							"position": [
								"114.970618",
								"44.022728"
							],
							"value": "152522"
						},
						{
							"label": "苏尼特左旗",
							"position": [
								"113.653412",
								"43.854108"
							],
							"value": "152523"
						},
						{
							"label": "苏尼特右旗",
							"position": [
								"112.65539",
								"42.746662"
							],
							"value": "152524"
						},
						{
							"label": "东乌珠穆沁旗",
							"position": [
								"116.980022",
								"45.510307"
							],
							"value": "152525"
						},
						{
							"label": "西乌珠穆沁旗",
							"position": [
								"117.615249",
								"44.586147"
							],
							"value": "152526"
						},
						{
							"label": "太仆寺旗",
							"position": [
								"115.28728",
								"41.895199"
							],
							"value": "152527"
						},
						{
							"label": "镶黄旗",
							"position": [
								"113.843869",
								"42.239229"
							],
							"value": "152528"
						},
						{
							"label": "正镶白旗",
							"position": [
								"115.031423",
								"42.286807"
							],
							"value": "152529"
						},
						{
							"label": "正蓝旗",
							"position": [
								"116.003311",
								"42.245895"
							],
							"value": "152530"
						},
						{
							"label": "多伦县",
							"position": [
								"116.477288",
								"42.197962"
							],
							"value": "152531"
						}
					]
				},
				{
					"label": "阿拉善盟",
					"position": [
						"105.706422",
						"38.844814"
					],
					"value": "152900",
					"children": [{
							"label": "阿拉善左旗",
							"position": [
								"105.70192",
								"38.847241"
							],
							"value": "152921"
						},
						{
							"label": "阿拉善右旗",
							"position": [
								"101.671984",
								"39.21159"
							],
							"value": "152922"
						},
						{
							"label": "额济纳旗",
							"position": [
								"101.06944",
								"41.958813"
							],
							"value": "152923"
						}
					]
				}
			]
		},
		{
			"label": "辽宁省",
			"position": [
				"123.429096",
				"41.796767"
			],
			"value": "210000",
			"children": [{
					"label": "沈阳市",
					"position": [
						"123.429096",
						"41.796767"
					],
					"value": "210100",
					"children": [{
							"label": "和平区",
							"position": [
								"123.406664",
								"41.788074"
							],
							"value": "210102"
						},
						{
							"label": "沈河区",
							"position": [
								"123.445696",
								"41.795591"
							],
							"value": "210103"
						},
						{
							"label": "大东区",
							"position": [
								"123.469956",
								"41.808503"
							],
							"value": "210104"
						},
						{
							"label": "皇姑区",
							"position": [
								"123.405677",
								"41.822336"
							],
							"value": "210105"
						},
						{
							"label": "铁西区",
							"position": [
								"123.350664",
								"41.787808"
							],
							"value": "210106"
						},
						{
							"label": "苏家屯区",
							"position": [
								"123.341604",
								"41.665904"
							],
							"value": "210111"
						},
						{
							"label": "浑南区",
							"position": [
								"123.458981",
								"41.741946"
							],
							"value": "210112"
						},
						{
							"label": "沈北新区",
							"position": [
								"123.521471",
								"42.052312"
							],
							"value": "210113"
						},
						{
							"label": "于洪区",
							"position": [
								"123.310829",
								"41.795833"
							],
							"value": "210114"
						},
						{
							"label": "辽中区",
							"position": [
								"122.731269",
								"41.512725"
							],
							"value": "210115"
						},
						{
							"label": "康平县",
							"position": [
								"123.352703",
								"42.741533"
							],
							"value": "210123"
						},
						{
							"label": "法库县",
							"position": [
								"123.416722",
								"42.507045"
							],
							"value": "210124"
						},
						{
							"label": "新民市",
							"position": [
								"122.828868",
								"41.996508"
							],
							"value": "210181"
						}
					]
				},
				{
					"label": "大连市",
					"position": [
						"121.618622",
						"38.91459"
					],
					"value": "210200",
					"children": [{
							"label": "中山区",
							"position": [
								"121.64376",
								"38.921553"
							],
							"value": "210202"
						},
						{
							"label": "西岗区",
							"position": [
								"121.616112",
								"38.914266"
							],
							"value": "210203"
						},
						{
							"label": "沙河口区",
							"position": [
								"121.593702",
								"38.912859"
							],
							"value": "210204"
						},
						{
							"label": "甘井子区",
							"position": [
								"121.582614",
								"38.975148"
							],
							"value": "210211"
						},
						{
							"label": "旅顺口区",
							"position": [
								"121.26713",
								"38.812043"
							],
							"value": "210212"
						},
						{
							"label": "金州区",
							"position": [
								"121.789413",
								"39.052745"
							],
							"value": "210213"
						},
						{
							"label": "普兰店区",
							"position": [
								"121.9705",
								"39.401555"
							],
							"value": "210214"
						},
						{
							"label": "长海县",
							"position": [
								"122.587824",
								"39.272399"
							],
							"value": "210224"
						},
						{
							"label": "瓦房店市",
							"position": [
								"122.002656",
								"39.63065"
							],
							"value": "210281"
						},
						{
							"label": "庄河市",
							"position": [
								"122.970612",
								"39.69829"
							],
							"value": "210283"
						}
					]
				},
				{
					"label": "鞍山市",
					"position": [
						"122.995632",
						"41.110626"
					],
					"value": "210300",
					"children": [{
							"label": "铁东区",
							"position": [
								"122.994475",
								"41.110344"
							],
							"value": "210302"
						},
						{
							"label": "铁西区",
							"position": [
								"122.971834",
								"41.11069"
							],
							"value": "210303"
						},
						{
							"label": "立山区",
							"position": [
								"123.024806",
								"41.150622"
							],
							"value": "210304"
						},
						{
							"label": "千山区",
							"position": [
								"122.949298",
								"41.068909"
							],
							"value": "210311"
						},
						{
							"label": "台安县",
							"position": [
								"122.429736",
								"41.38686"
							],
							"value": "210321"
						},
						{
							"label": "岫岩满族自治县",
							"position": [
								"123.28833",
								"40.281509"
							],
							"value": "210323"
						},
						{
							"label": "海城市",
							"position": [
								"122.752199",
								"40.852533"
							],
							"value": "210381"
						}
					]
				},
				{
					"label": "抚顺市",
					"position": [
						"123.921109",
						"41.875956"
					],
					"value": "210400",
					"children": [{
							"label": "新抚区",
							"position": [
								"123.902858",
								"41.86082"
							],
							"value": "210402"
						},
						{
							"label": "东洲区",
							"position": [
								"124.047219",
								"41.866829"
							],
							"value": "210403"
						},
						{
							"label": "望花区",
							"position": [
								"123.801509",
								"41.851803"
							],
							"value": "210404"
						},
						{
							"label": "顺城区",
							"position": [
								"123.917165",
								"41.881132"
							],
							"value": "210411"
						},
						{
							"label": "抚顺县",
							"position": [
								"124.097979",
								"41.922644"
							],
							"value": "210421"
						},
						{
							"label": "新宾满族自治县",
							"position": [
								"125.037547",
								"41.732456"
							],
							"value": "210422"
						},
						{
							"label": "清原满族自治县",
							"position": [
								"124.927192",
								"42.10135"
							],
							"value": "210423"
						}
					]
				},
				{
					"label": "本溪市",
					"position": [
						"123.770519",
						"41.297909"
					],
					"value": "210500",
					"children": [{
							"label": "平山区",
							"position": [
								"123.761231",
								"41.291581"
							],
							"value": "210502"
						},
						{
							"label": "溪湖区",
							"position": [
								"123.765226",
								"41.330056"
							],
							"value": "210503"
						},
						{
							"label": "明山区",
							"position": [
								"123.763288",
								"41.302429"
							],
							"value": "210504"
						},
						{
							"label": "南芬区",
							"position": [
								"123.748381",
								"41.104093"
							],
							"value": "210505"
						},
						{
							"label": "本溪满族自治县",
							"position": [
								"124.126156",
								"41.300344"
							],
							"value": "210521"
						},
						{
							"label": "桓仁满族自治县",
							"position": [
								"125.359195",
								"41.268997"
							],
							"value": "210522"
						}
					]
				},
				{
					"label": "丹东市",
					"position": [
						"124.383044",
						"40.124296"
					],
					"value": "210600",
					"children": [{
							"label": "元宝区",
							"position": [
								"124.397814",
								"40.136483"
							],
							"value": "210602"
						},
						{
							"label": "振兴区",
							"position": [
								"124.361153",
								"40.102801"
							],
							"value": "210603"
						},
						{
							"label": "振安区",
							"position": [
								"124.427709",
								"40.158557"
							],
							"value": "210604"
						},
						{
							"label": "宽甸满族自治县",
							"position": [
								"124.784867",
								"40.730412"
							],
							"value": "210624"
						},
						{
							"label": "东港市",
							"position": [
								"124.149437",
								"39.883467"
							],
							"value": "210681"
						},
						{
							"label": "凤城市",
							"position": [
								"124.071067",
								"40.457567"
							],
							"value": "210682"
						}
					]
				},
				{
					"label": "锦州市",
					"position": [
						"121.135742",
						"41.119269"
					],
					"value": "210700",
					"children": [{
							"label": "古塔区",
							"position": [
								"121.130085",
								"41.115719"
							],
							"value": "210702"
						},
						{
							"label": "凌河区",
							"position": [
								"121.151304",
								"41.114662"
							],
							"value": "210703"
						},
						{
							"label": "太和区",
							"position": [
								"121.107297",
								"41.105378"
							],
							"value": "210711"
						},
						{
							"label": "黑山县",
							"position": [
								"122.117915",
								"41.691804"
							],
							"value": "210726"
						},
						{
							"label": "义县",
							"position": [
								"121.242831",
								"41.537224"
							],
							"value": "210727"
						},
						{
							"label": "凌海市",
							"position": [
								"121.364236",
								"41.171738"
							],
							"value": "210781"
						},
						{
							"label": "北镇市",
							"position": [
								"121.795962",
								"41.598764"
							],
							"value": "210782"
						}
					]
				},
				{
					"label": "营口市",
					"position": [
						"122.235151",
						"40.667432"
					],
					"value": "210800",
					"children": [{
							"label": "站前区",
							"position": [
								"122.253235",
								"40.669949"
							],
							"value": "210802"
						},
						{
							"label": "西市区",
							"position": [
								"122.210067",
								"40.663086"
							],
							"value": "210803"
						},
						{
							"label": "鲅鱼圈区",
							"position": [
								"122.127242",
								"40.263646"
							],
							"value": "210804"
						},
						{
							"label": "老边区",
							"position": [
								"122.382584",
								"40.682723"
							],
							"value": "210811"
						},
						{
							"label": "盖州市",
							"position": [
								"122.355534",
								"40.405234"
							],
							"value": "210881"
						},
						{
							"label": "大石桥市",
							"position": [
								"122.505894",
								"40.633973"
							],
							"value": "210882"
						}
					]
				},
				{
					"label": "阜新市",
					"position": [
						"121.648962",
						"42.011796"
					],
					"value": "210900",
					"children": [{
							"label": "海州区",
							"position": [
								"121.657639",
								"42.011162"
							],
							"value": "210902"
						},
						{
							"label": "新邱区",
							"position": [
								"121.790541",
								"42.086603"
							],
							"value": "210903"
						},
						{
							"label": "太平区",
							"position": [
								"121.677575",
								"42.011145"
							],
							"value": "210904"
						},
						{
							"label": "清河门区",
							"position": [
								"121.42018",
								"41.780477"
							],
							"value": "210905"
						},
						{
							"label": "细河区",
							"position": [
								"121.654791",
								"42.019218"
							],
							"value": "210911"
						},
						{
							"label": "阜新蒙古族自治县",
							"position": [
								"121.743125",
								"42.058607"
							],
							"value": "210921"
						},
						{
							"label": "彰武县",
							"position": [
								"122.537444",
								"42.384823"
							],
							"value": "210922"
						}
					]
				},
				{
					"label": "辽阳市",
					"position": [
						"123.18152",
						"41.269402"
					],
					"value": "211000",
					"children": [{
							"label": "白塔区",
							"position": [
								"123.172611",
								"41.26745"
							],
							"value": "211002"
						},
						{
							"label": "文圣区",
							"position": [
								"123.188227",
								"41.266765"
							],
							"value": "211003"
						},
						{
							"label": "宏伟区",
							"position": [
								"123.200461",
								"41.205747"
							],
							"value": "211004"
						},
						{
							"label": "弓长岭区",
							"position": [
								"123.431633",
								"41.157831"
							],
							"value": "211005"
						},
						{
							"label": "太子河区",
							"position": [
								"123.185336",
								"41.251682"
							],
							"value": "211011"
						},
						{
							"label": "辽阳县",
							"position": [
								"123.079674",
								"41.216479"
							],
							"value": "211021"
						},
						{
							"label": "灯塔市",
							"position": [
								"123.325864",
								"41.427836"
							],
							"value": "211081"
						}
					]
				},
				{
					"label": "盘锦市",
					"position": [
						"122.06957",
						"41.124484"
					],
					"value": "211100",
					"children": [{
							"label": "双台子区",
							"position": [
								"122.055733",
								"41.190365"
							],
							"value": "211102"
						},
						{
							"label": "兴隆台区",
							"position": [
								"122.071624",
								"41.122423"
							],
							"value": "211103"
						},
						{
							"label": "大洼区",
							"position": [
								"122.071708",
								"40.994428"
							],
							"value": "211104"
						},
						{
							"label": "盘山县",
							"position": [
								"121.98528",
								"41.240701"
							],
							"value": "211122"
						}
					]
				},
				{
					"label": "铁岭市",
					"position": [
						"123.844279",
						"42.290585"
					],
					"value": "211200",
					"children": [{
							"label": "银州区",
							"position": [
								"123.844877",
								"42.292278"
							],
							"value": "211202"
						},
						{
							"label": "清河区",
							"position": [
								"124.14896",
								"42.542978"
							],
							"value": "211204"
						},
						{
							"label": "铁岭县",
							"position": [
								"123.725669",
								"42.223316"
							],
							"value": "211221"
						},
						{
							"label": "西丰县",
							"position": [
								"124.72332",
								"42.738091"
							],
							"value": "211223"
						},
						{
							"label": "昌图县",
							"position": [
								"124.11017",
								"42.784441"
							],
							"value": "211224"
						},
						{
							"label": "调兵山市",
							"position": [
								"123.545366",
								"42.450734"
							],
							"value": "211281"
						},
						{
							"label": "开原市",
							"position": [
								"124.045551",
								"42.542141"
							],
							"value": "211282"
						}
					]
				},
				{
					"label": "朝阳市",
					"position": [
						"120.451176",
						"41.576758"
					],
					"value": "211300",
					"children": [{
							"label": "双塔区",
							"position": [
								"120.44877",
								"41.579389"
							],
							"value": "211302"
						},
						{
							"label": "龙城区",
							"position": [
								"120.413376",
								"41.576749"
							],
							"value": "211303"
						},
						{
							"label": "朝阳县",
							"position": [
								"120.404217",
								"41.526342"
							],
							"value": "211321"
						},
						{
							"label": "建平县",
							"position": [
								"119.642363",
								"41.402576"
							],
							"value": "211322"
						},
						{
							"label": "喀喇沁左翼蒙古族自治县",
							"position": [
								"119.744883",
								"41.125428"
							],
							"value": "211324"
						},
						{
							"label": "北票市",
							"position": [
								"120.766951",
								"41.803286"
							],
							"value": "211381"
						},
						{
							"label": "凌源市",
							"position": [
								"119.404789",
								"41.243086"
							],
							"value": "211382"
						}
					]
				},
				{
					"label": "葫芦岛市",
					"position": [
						"120.856394",
						"40.755572"
					],
					"value": "211400",
					"children": [{
							"label": "连山区",
							"position": [
								"120.85937",
								"40.755143"
							],
							"value": "211402"
						},
						{
							"label": "龙港区",
							"position": [
								"120.838569",
								"40.709991"
							],
							"value": "211403"
						},
						{
							"label": "南票区",
							"position": [
								"120.752314",
								"41.098813"
							],
							"value": "211404"
						},
						{
							"label": "绥中县",
							"position": [
								"120.342112",
								"40.328407"
							],
							"value": "211421"
						},
						{
							"label": "建昌县",
							"position": [
								"119.807776",
								"40.812871"
							],
							"value": "211422"
						},
						{
							"label": "兴城市",
							"position": [
								"120.729365",
								"40.619413"
							],
							"value": "211481"
						}
					]
				}
			]
		},
		{
			"label": "吉林省",
			"position": [
				"125.3245",
				"43.886841"
			],
			"value": "220000",
			"children": [{
					"label": "长春市",
					"position": [
						"125.3245",
						"43.886841"
					],
					"value": "220100",
					"children": [{
							"label": "南关区",
							"position": [
								"125.337237",
								"43.890235"
							],
							"value": "220102"
						},
						{
							"label": "宽城区",
							"position": [
								"125.342828",
								"43.903823"
							],
							"value": "220103"
						},
						{
							"label": "朝阳区",
							"position": [
								"125.318042",
								"43.86491"
							],
							"value": "220104"
						},
						{
							"label": "二道区",
							"position": [
								"125.384727",
								"43.870824"
							],
							"value": "220105"
						},
						{
							"label": "绿园区",
							"position": [
								"125.272467",
								"43.892177"
							],
							"value": "220106"
						},
						{
							"label": "双阳区",
							"position": [
								"125.659018",
								"43.525168"
							],
							"value": "220112"
						},
						{
							"label": "九台区",
							"position": [
								"125.844682",
								"44.157155"
							],
							"value": "220113"
						},
						{
							"label": "农安县",
							"position": [
								"125.175287",
								"44.431258"
							],
							"value": "220122"
						},
						{
							"label": "榆树市",
							"position": [
								"126.550107",
								"44.827642"
							],
							"value": "220182"
						},
						{
							"label": "德惠市",
							"position": [
								"125.703327",
								"44.533909"
							],
							"value": "220183"
						},
						{
							"label": "公主岭市",
							"position": [
								"124.817588",
								"43.509474"
							],
							"value": "220184"
						}
					]
				},
				{
					"label": "吉林市",
					"position": [
						"126.55302",
						"43.843577"
					],
					"value": "220200",
					"children": [{
							"label": "昌邑区",
							"position": [
								"126.570766",
								"43.851118"
							],
							"value": "220202"
						},
						{
							"label": "龙潭区",
							"position": [
								"126.561429",
								"43.909755"
							],
							"value": "220203"
						},
						{
							"label": "船营区",
							"position": [
								"126.55239",
								"43.843804"
							],
							"value": "220204"
						},
						{
							"label": "丰满区",
							"position": [
								"126.560759",
								"43.816594"
							],
							"value": "220211"
						},
						{
							"label": "永吉县",
							"position": [
								"126.501622",
								"43.667416"
							],
							"value": "220221"
						},
						{
							"label": "蛟河市",
							"position": [
								"127.342739",
								"43.720579"
							],
							"value": "220281"
						},
						{
							"label": "桦甸市",
							"position": [
								"126.745445",
								"42.972093"
							],
							"value": "220282"
						},
						{
							"label": "舒兰市",
							"position": [
								"126.947813",
								"44.410906"
							],
							"value": "220283"
						},
						{
							"label": "磐石市",
							"position": [
								"126.059929",
								"42.942476"
							],
							"value": "220284"
						}
					]
				},
				{
					"label": "四平市",
					"position": [
						"124.370785",
						"43.170344"
					],
					"value": "220300",
					"children": [{
							"label": "铁西区",
							"position": [
								"124.360894",
								"43.176263"
							],
							"value": "220302"
						},
						{
							"label": "铁东区",
							"position": [
								"124.388464",
								"43.16726"
							],
							"value": "220303"
						},
						{
							"label": "梨树县",
							"position": [
								"124.335802",
								"43.30831"
							],
							"value": "220322"
						},
						{
							"label": "伊通满族自治县",
							"position": [
								"125.303124",
								"43.345464"
							],
							"value": "220323"
						},
						{
							"label": "双辽市",
							"position": [
								"123.505283",
								"43.518275"
							],
							"value": "220382"
						}
					]
				},
				{
					"label": "辽源市",
					"position": [
						"125.145349",
						"42.902692"
					],
					"value": "220400",
					"children": [{
							"label": "龙山区",
							"position": [
								"125.145164",
								"42.902702"
							],
							"value": "220402"
						},
						{
							"label": "西安区",
							"position": [
								"125.151424",
								"42.920415"
							],
							"value": "220403"
						},
						{
							"label": "东丰县",
							"position": [
								"125.529623",
								"42.675228"
							],
							"value": "220421"
						},
						{
							"label": "东辽县",
							"position": [
								"124.991995",
								"42.927724"
							],
							"value": "220422"
						}
					]
				},
				{
					"label": "通化市",
					"position": [
						"125.936501",
						"41.721177"
					],
					"value": "220500",
					"children": [{
							"label": "东昌区",
							"position": [
								"125.936716",
								"41.721233"
							],
							"value": "220502"
						},
						{
							"label": "二道江区",
							"position": [
								"126.045987",
								"41.777564"
							],
							"value": "220503"
						},
						{
							"label": "通化县",
							"position": [
								"125.753121",
								"41.677918"
							],
							"value": "220521"
						},
						{
							"label": "辉南县",
							"position": [
								"126.042821",
								"42.683459"
							],
							"value": "220523"
						},
						{
							"label": "柳河县",
							"position": [
								"125.740536",
								"42.281484"
							],
							"value": "220524"
						},
						{
							"label": "梅河口市",
							"position": [
								"125.687336",
								"42.530002"
							],
							"value": "220581"
						},
						{
							"label": "集安市",
							"position": [
								"126.186204",
								"41.126276"
							],
							"value": "220582"
						}
					]
				},
				{
					"label": "白山市",
					"position": [
						"126.427839",
						"41.942505"
					],
					"value": "220600",
					"children": [{
							"label": "浑江区",
							"position": [
								"126.428035",
								"41.943065"
							],
							"value": "220602"
						},
						{
							"label": "江源区",
							"position": [
								"126.584229",
								"42.048109"
							],
							"value": "220605"
						},
						{
							"label": "抚松县",
							"position": [
								"127.273796",
								"42.332643"
							],
							"value": "220621"
						},
						{
							"label": "靖宇县",
							"position": [
								"126.808386",
								"42.389689"
							],
							"value": "220622"
						},
						{
							"label": "长白朝鲜族自治县",
							"position": [
								"128.203384",
								"41.419361"
							],
							"value": "220623"
						},
						{
							"label": "临江市",
							"position": [
								"126.919296",
								"41.810689"
							],
							"value": "220681"
						}
					]
				},
				{
					"label": "松原市",
					"position": [
						"124.823608",
						"45.118243"
					],
					"value": "220700",
					"children": [{
							"label": "宁江区",
							"position": [
								"124.827851",
								"45.176498"
							],
							"value": "220702"
						},
						{
							"label": "前郭尔罗斯蒙古族自治县",
							"position": [
								"124.826808",
								"45.116288"
							],
							"value": "220721"
						},
						{
							"label": "长岭县",
							"position": [
								"123.985184",
								"44.276579"
							],
							"value": "220722"
						},
						{
							"label": "乾安县",
							"position": [
								"124.024361",
								"45.006846"
							],
							"value": "220723"
						},
						{
							"label": "扶余市",
							"position": [
								"126.042758",
								"44.986199"
							],
							"value": "220781"
						}
					]
				},
				{
					"label": "白城市",
					"position": [
						"122.841114",
						"45.619026"
					],
					"value": "220800",
					"children": [{
							"label": "洮北区",
							"position": [
								"122.842499",
								"45.619253"
							],
							"value": "220802"
						},
						{
							"label": "镇赉县",
							"position": [
								"123.202246",
								"45.846089"
							],
							"value": "220821"
						},
						{
							"label": "通榆县",
							"position": [
								"123.088543",
								"44.80915"
							],
							"value": "220822"
						},
						{
							"label": "洮南市",
							"position": [
								"122.783779",
								"45.339113"
							],
							"value": "220881"
						},
						{
							"label": "大安市",
							"position": [
								"124.291512",
								"45.507648"
							],
							"value": "220882"
						}
					]
				},
				{
					"label": "延边朝鲜族自治州",
					"position": [
						"129.513228",
						"42.904823"
					],
					"value": "222400",
					"children": [{
							"label": "延吉市",
							"position": [
								"129.51579",
								"42.906964"
							],
							"value": "222401"
						},
						{
							"label": "图们市",
							"position": [
								"129.846701",
								"42.966621"
							],
							"value": "222402"
						},
						{
							"label": "敦化市",
							"position": [
								"128.22986",
								"43.366921"
							],
							"value": "222403"
						},
						{
							"label": "珲春市",
							"position": [
								"130.365787",
								"42.871057"
							],
							"value": "222404"
						},
						{
							"label": "龙井市",
							"position": [
								"129.425747",
								"42.771029"
							],
							"value": "222405"
						},
						{
							"label": "和龙市",
							"position": [
								"129.008748",
								"42.547004"
							],
							"value": "222406"
						},
						{
							"label": "汪清县",
							"position": [
								"129.766161",
								"43.315426"
							],
							"value": "222424"
						},
						{
							"label": "安图县",
							"position": [
								"128.901865",
								"43.110994"
							],
							"value": "222426"
						}
					]
				}
			]
		},
		{
			"label": "黑龙江省",
			"position": [
				"126.642464",
				"45.756967"
			],
			"value": "230000",
			"children": [{
					"label": "哈尔滨市",
					"position": [
						"126.642464",
						"45.756967"
					],
					"value": "230100",
					"children": [{
							"label": "道里区",
							"position": [
								"126.612532",
								"45.762035"
							],
							"value": "230102"
						},
						{
							"label": "南岗区",
							"position": [
								"126.652098",
								"45.755971"
							],
							"value": "230103"
						},
						{
							"label": "道外区",
							"position": [
								"126.648838",
								"45.78454"
							],
							"value": "230104"
						},
						{
							"label": "平房区",
							"position": [
								"126.629257",
								"45.605567"
							],
							"value": "230108"
						},
						{
							"label": "松北区",
							"position": [
								"126.563066",
								"45.814656"
							],
							"value": "230109"
						},
						{
							"label": "香坊区",
							"position": [
								"126.667049",
								"45.713067"
							],
							"value": "230110"
						},
						{
							"label": "呼兰区",
							"position": [
								"126.603302",
								"45.98423"
							],
							"value": "230111"
						},
						{
							"label": "阿城区",
							"position": [
								"126.972726",
								"45.538372"
							],
							"value": "230112"
						},
						{
							"label": "双城区",
							"position": [
								"126.308784",
								"45.377942"
							],
							"value": "230113"
						},
						{
							"label": "依兰县",
							"position": [
								"129.565594",
								"46.315105"
							],
							"value": "230123"
						},
						{
							"label": "方正县",
							"position": [
								"128.836131",
								"45.839536"
							],
							"value": "230124"
						},
						{
							"label": "宾县",
							"position": [
								"127.48594",
								"45.759369"
							],
							"value": "230125"
						},
						{
							"label": "巴彦县",
							"position": [
								"127.403602",
								"46.081889"
							],
							"value": "230126"
						},
						{
							"label": "木兰县",
							"position": [
								"128.042675",
								"45.949826"
							],
							"value": "230127"
						},
						{
							"label": "通河县",
							"position": [
								"128.747786",
								"45.977618"
							],
							"value": "230128"
						},
						{
							"label": "延寿县",
							"position": [
								"128.331886",
								"45.455648"
							],
							"value": "230129"
						},
						{
							"label": "尚志市",
							"position": [
								"127.968539",
								"45.214953"
							],
							"value": "230183"
						},
						{
							"label": "五常市",
							"position": [
								"127.15759",
								"44.919418"
							],
							"value": "230184"
						}
					]
				},
				{
					"label": "齐齐哈尔市",
					"position": [
						"123.95792",
						"47.342081"
					],
					"value": "230200",
					"children": [{
							"label": "龙沙区",
							"position": [
								"123.957338",
								"47.341736"
							],
							"value": "230202"
						},
						{
							"label": "建华区",
							"position": [
								"123.955888",
								"47.354494"
							],
							"value": "230203"
						},
						{
							"label": "铁锋区",
							"position": [
								"123.973555",
								"47.339499"
							],
							"value": "230204"
						},
						{
							"label": "昂昂溪区",
							"position": [
								"123.813181",
								"47.156867"
							],
							"value": "230205"
						},
						{
							"label": "富拉尔基区",
							"position": [
								"123.638873",
								"47.20697"
							],
							"value": "230206"
						},
						{
							"label": "碾子山区",
							"position": [
								"122.887972",
								"47.51401"
							],
							"value": "230207"
						},
						{
							"label": "梅里斯达斡尔族区",
							"position": [
								"123.754599",
								"47.311113"
							],
							"value": "230208"
						},
						{
							"label": "龙江县",
							"position": [
								"123.187225",
								"47.336388"
							],
							"value": "230221"
						},
						{
							"label": "依安县",
							"position": [
								"125.307561",
								"47.890098"
							],
							"value": "230223"
						},
						{
							"label": "泰来县",
							"position": [
								"123.41953",
								"46.39233"
							],
							"value": "230224"
						},
						{
							"label": "甘南县",
							"position": [
								"123.506034",
								"47.917838"
							],
							"value": "230225"
						},
						{
							"label": "富裕县",
							"position": [
								"124.469106",
								"47.797172"
							],
							"value": "230227"
						},
						{
							"label": "克山县",
							"position": [
								"125.874355",
								"48.034342"
							],
							"value": "230229"
						},
						{
							"label": "克东县",
							"position": [
								"126.249094",
								"48.03732"
							],
							"value": "230230"
						},
						{
							"label": "拜泉县",
							"position": [
								"126.091911",
								"47.607363"
							],
							"value": "230231"
						},
						{
							"label": "讷河市",
							"position": [
								"124.882172",
								"48.481133"
							],
							"value": "230281"
						}
					]
				},
				{
					"label": "鸡西市",
					"position": [
						"130.975966",
						"45.300046"
					],
					"value": "230300",
					"children": [{
							"label": "鸡冠区",
							"position": [
								"130.974374",
								"45.30034"
							],
							"value": "230302"
						},
						{
							"label": "恒山区",
							"position": [
								"130.910636",
								"45.213242"
							],
							"value": "230303"
						},
						{
							"label": "滴道区",
							"position": [
								"130.846823",
								"45.348812"
							],
							"value": "230304"
						},
						{
							"label": "梨树区",
							"position": [
								"130.697781",
								"45.092195"
							],
							"value": "230305"
						},
						{
							"label": "城子河区",
							"position": [
								"131.010501",
								"45.338248"
							],
							"value": "230306"
						},
						{
							"label": "麻山区",
							"position": [
								"130.481126",
								"45.209607"
							],
							"value": "230307"
						},
						{
							"label": "鸡东县",
							"position": [
								"131.148907",
								"45.250892"
							],
							"value": "230321"
						},
						{
							"label": "虎林市",
							"position": [
								"132.973881",
								"45.767985"
							],
							"value": "230381"
						},
						{
							"label": "密山市",
							"position": [
								"131.874137",
								"45.54725"
							],
							"value": "230382"
						}
					]
				},
				{
					"label": "鹤岗市",
					"position": [
						"130.277487",
						"47.332085"
					],
					"value": "230400",
					"children": [{
							"label": "向阳区",
							"position": [
								"130.292478",
								"47.345372"
							],
							"value": "230402"
						},
						{
							"label": "工农区",
							"position": [
								"130.276652",
								"47.331678"
							],
							"value": "230403"
						},
						{
							"label": "南山区",
							"position": [
								"130.275533",
								"47.31324"
							],
							"value": "230404"
						},
						{
							"label": "兴安区",
							"position": [
								"130.236169",
								"47.252911"
							],
							"value": "230405"
						},
						{
							"label": "东山区",
							"position": [
								"130.31714",
								"47.337385"
							],
							"value": "230406"
						},
						{
							"label": "兴山区",
							"position": [
								"130.30534",
								"47.35997"
							],
							"value": "230407"
						},
						{
							"label": "萝北县",
							"position": [
								"130.829087",
								"47.577577"
							],
							"value": "230421"
						},
						{
							"label": "绥滨县",
							"position": [
								"131.860526",
								"47.289892"
							],
							"value": "230422"
						}
					]
				},
				{
					"label": "双鸭山市",
					"position": [
						"131.157304",
						"46.643442"
					],
					"value": "230500",
					"children": [{
							"label": "尖山区",
							"position": [
								"131.15896",
								"46.642961"
							],
							"value": "230502"
						},
						{
							"label": "岭东区",
							"position": [
								"131.163675",
								"46.591076"
							],
							"value": "230503"
						},
						{
							"label": "四方台区",
							"position": [
								"131.333181",
								"46.594347"
							],
							"value": "230505"
						},
						{
							"label": "宝山区",
							"position": [
								"131.404294",
								"46.573366"
							],
							"value": "230506"
						},
						{
							"label": "集贤县",
							"position": [
								"131.13933",
								"46.72898"
							],
							"value": "230521"
						},
						{
							"label": "友谊县",
							"position": [
								"131.810622",
								"46.775159"
							],
							"value": "230522"
						},
						{
							"label": "宝清县",
							"position": [
								"132.206415",
								"46.328781"
							],
							"value": "230523"
						},
						{
							"label": "饶河县",
							"position": [
								"134.021162",
								"46.801288"
							],
							"value": "230524"
						}
					]
				},
				{
					"label": "大庆市",
					"position": [
						"125.11272",
						"46.590734"
					],
					"value": "230600",
					"children": [{
							"label": "萨尔图区",
							"position": [
								"125.114643",
								"46.596356"
							],
							"value": "230602"
						},
						{
							"label": "龙凤区",
							"position": [
								"125.145794",
								"46.573948"
							],
							"value": "230603"
						},
						{
							"label": "让胡路区",
							"position": [
								"124.868341",
								"46.653254"
							],
							"value": "230604"
						},
						{
							"label": "红岗区",
							"position": [
								"124.889528",
								"46.403049"
							],
							"value": "230605"
						},
						{
							"label": "大同区",
							"position": [
								"124.818509",
								"46.034304"
							],
							"value": "230606"
						},
						{
							"label": "肇州县",
							"position": [
								"125.273254",
								"45.708685"
							],
							"value": "230621"
						},
						{
							"label": "肇源县",
							"position": [
								"125.081974",
								"45.518832"
							],
							"value": "230622"
						},
						{
							"label": "林甸县",
							"position": [
								"124.877742",
								"47.186411"
							],
							"value": "230623"
						},
						{
							"label": "杜尔伯特蒙古族自治县",
							"position": [
								"124.446259",
								"46.865973"
							],
							"value": "230624"
						}
					]
				},
				{
					"label": "伊春市",
					"position": [
						"128.899396",
						"47.724775"
					],
					"value": "230700",
					"children": [{
							"label": "伊美区",
							"position": [
								"128.907303",
								"47.728171"
							],
							"value": "230717"
						},
						{
							"label": "乌翠区",
							"position": [
								"128.669859",
								"47.726728"
							],
							"value": "230718"
						},
						{
							"label": "友好区",
							"position": [
								"128.84075",
								"47.853778"
							],
							"value": "230719"
						},
						{
							"label": "嘉荫县",
							"position": [
								"130.397684",
								"48.891378"
							],
							"value": "230722"
						},
						{
							"label": "汤旺县",
							"position": [
								"129.571108",
								"48.454651"
							],
							"value": "230723"
						},
						{
							"label": "丰林县",
							"position": [
								"129.5336",
								"48.290455"
							],
							"value": "230724"
						},
						{
							"label": "大箐山县",
							"position": [
								"129.020793",
								"47.028397"
							],
							"value": "230725"
						},
						{
							"label": "南岔县",
							"position": [
								"129.28246",
								"47.137314"
							],
							"value": "230726"
						},
						{
							"label": "金林区",
							"position": [
								"129.429117",
								"47.413074"
							],
							"value": "230751"
						},
						{
							"label": "铁力市",
							"position": [
								"128.030561",
								"46.985772"
							],
							"value": "230781"
						}
					]
				},
				{
					"label": "佳木斯市",
					"position": [
						"130.361634",
						"46.809606"
					],
					"value": "230800",
					"children": [{
							"label": "向阳区",
							"position": [
								"130.361786",
								"46.809645"
							],
							"value": "230803"
						},
						{
							"label": "前进区",
							"position": [
								"130.377684",
								"46.812345"
							],
							"value": "230804"
						},
						{
							"label": "东风区",
							"position": [
								"130.403297",
								"46.822476"
							],
							"value": "230805"
						},
						{
							"label": "郊区",
							"position": [
								"130.351588",
								"46.80712"
							],
							"value": "230811"
						},
						{
							"label": "桦南县",
							"position": [
								"130.570112",
								"46.240118"
							],
							"value": "230822"
						},
						{
							"label": "桦川县",
							"position": [
								"130.723713",
								"47.023039"
							],
							"value": "230826"
						},
						{
							"label": "汤原县",
							"position": [
								"129.904463",
								"46.730048"
							],
							"value": "230828"
						},
						{
							"label": "同江市",
							"position": [
								"132.510119",
								"47.651131"
							],
							"value": "230881"
						},
						{
							"label": "富锦市",
							"position": [
								"132.037951",
								"47.250747"
							],
							"value": "230882"
						},
						{
							"label": "抚远市",
							"position": [
								"134.294501",
								"48.364707"
							],
							"value": "230883"
						}
					]
				},
				{
					"label": "七台河市",
					"position": [
						"131.015584",
						"45.771266"
					],
					"value": "230900",
					"children": [{
							"label": "新兴区",
							"position": [
								"130.889482",
								"45.794258"
							],
							"value": "230902"
						},
						{
							"label": "桃山区",
							"position": [
								"131.015848",
								"45.771217"
							],
							"value": "230903"
						},
						{
							"label": "茄子河区",
							"position": [
								"131.071561",
								"45.776587"
							],
							"value": "230904"
						},
						{
							"label": "勃利县",
							"position": [
								"130.575025",
								"45.751573"
							],
							"value": "230921"
						}
					]
				},
				{
					"label": "牡丹江市",
					"position": [
						"129.618602",
						"44.582962"
					],
					"value": "231000",
					"children": [{
							"label": "东安区",
							"position": [
								"129.623292",
								"44.582399"
							],
							"value": "231002"
						},
						{
							"label": "阳明区",
							"position": [
								"129.634645",
								"44.596328"
							],
							"value": "231003"
						},
						{
							"label": "爱民区",
							"position": [
								"129.601232",
								"44.595443"
							],
							"value": "231004"
						},
						{
							"label": "西安区",
							"position": [
								"129.61311",
								"44.581032"
							],
							"value": "231005"
						},
						{
							"label": "林口县",
							"position": [
								"130.268402",
								"45.286645"
							],
							"value": "231025"
						},
						{
							"label": "绥芬河市",
							"position": [
								"131.164856",
								"44.396864"
							],
							"value": "231081"
						},
						{
							"label": "海林市",
							"position": [
								"129.387902",
								"44.574149"
							],
							"value": "231083"
						},
						{
							"label": "宁安市",
							"position": [
								"129.470019",
								"44.346836"
							],
							"value": "231084"
						},
						{
							"label": "穆棱市",
							"position": [
								"130.527085",
								"44.91967"
							],
							"value": "231085"
						},
						{
							"label": "东宁市",
							"position": [
								"131.125296",
								"44.063578"
							],
							"value": "231086"
						}
					]
				},
				{
					"label": "黑河市",
					"position": [
						"127.499023",
						"50.249585"
					],
					"value": "231100",
					"children": [{
							"label": "爱辉区",
							"position": [
								"127.497639",
								"50.249027"
							],
							"value": "231102"
						},
						{
							"label": "逊克县",
							"position": [
								"128.476152",
								"49.582974"
							],
							"value": "231123"
						},
						{
							"label": "孙吴县",
							"position": [
								"127.327315",
								"49.423941"
							],
							"value": "231124"
						},
						{
							"label": "北安市",
							"position": [
								"126.508737",
								"48.245437"
							],
							"value": "231181"
						},
						{
							"label": "五大连池市",
							"position": [
								"126.197694",
								"48.512688"
							],
							"value": "231182"
						},
						{
							"label": "嫩江市",
							"position": [
								"125.229904",
								"49.177461"
							],
							"value": "231183"
						}
					]
				},
				{
					"label": "绥化市",
					"position": [
						"126.99293",
						"46.637393"
					],
					"value": "231200",
					"children": [{
							"label": "北林区",
							"position": [
								"126.990665",
								"46.634912"
							],
							"value": "231202"
						},
						{
							"label": "望奎县",
							"position": [
								"126.484191",
								"46.83352"
							],
							"value": "231221"
						},
						{
							"label": "兰西县",
							"position": [
								"126.289315",
								"46.259037"
							],
							"value": "231222"
						},
						{
							"label": "青冈县",
							"position": [
								"126.112268",
								"46.686596"
							],
							"value": "231223"
						},
						{
							"label": "庆安县",
							"position": [
								"127.510024",
								"46.879203"
							],
							"value": "231224"
						},
						{
							"label": "明水县",
							"position": [
								"125.907544",
								"47.183527"
							],
							"value": "231225"
						},
						{
							"label": "绥棱县",
							"position": [
								"127.111121",
								"47.247195"
							],
							"value": "231226"
						},
						{
							"label": "安达市",
							"position": [
								"125.329926",
								"46.410614"
							],
							"value": "231281"
						},
						{
							"label": "肇东市",
							"position": [
								"125.991402",
								"46.069471"
							],
							"value": "231282"
						},
						{
							"label": "海伦市",
							"position": [
								"126.969383",
								"47.460428"
							],
							"value": "231283"
						}
					]
				},
				{
					"label": "大兴安岭地区",
					"position": [
						"124.711526",
						"52.335262"
					],
					"value": "232700",
					"children": [{
							"label": "漠河市",
							"position": [
								"122.536256",
								"52.972074"
							],
							"value": "232701"
						},
						{
							"label": "加格达奇区",
							"position": [
								"124.126716",
								"50.424654"
							],
							"value": "232718"
						},
						{
							"label": "呼玛县",
							"position": [
								"126.662105",
								"51.726998"
							],
							"value": "232721"
						},
						{
							"label": "塔河县",
							"position": [
								"124.710516",
								"52.335229"
							],
							"value": "232722"
						}
					]
				}
			]
		},
		{
			"label": "上海市",
			"position": [
				"121.472644",
				"31.231706"
			],
			"value": "310000",
			"children": [{
				"label": "上海城区",
				"position": [
					"121.472644",
					"31.231706"
				],
				"value": "310100",
				"children": [{
						"label": "黄浦区",
						"position": [
							"121.490317",
							"31.222771"
						],
						"value": "310101"
					},
					{
						"label": "徐汇区",
						"position": [
							"121.43752",
							"31.179973"
						],
						"value": "310104"
					},
					{
						"label": "长宁区",
						"position": [
							"121.4222",
							"31.218123"
						],
						"value": "310105"
					},
					{
						"label": "静安区",
						"position": [
							"121.448224",
							"31.229003"
						],
						"value": "310106"
					},
					{
						"label": "普陀区",
						"position": [
							"121.392499",
							"31.241701"
						],
						"value": "310107"
					},
					{
						"label": "虹口区",
						"position": [
							"121.491832",
							"31.26097"
						],
						"value": "310109"
					},
					{
						"label": "杨浦区",
						"position": [
							"121.522797",
							"31.270755"
						],
						"value": "310110"
					},
					{
						"label": "闵行区",
						"position": [
							"121.375972",
							"31.111658"
						],
						"value": "310112"
					},
					{
						"label": "宝山区",
						"position": [
							"121.489934",
							"31.398896"
						],
						"value": "310113"
					},
					{
						"label": "嘉定区",
						"position": [
							"121.250333",
							"31.383524"
						],
						"value": "310114"
					},
					{
						"label": "浦东新区",
						"position": [
							"121.567706",
							"31.245944"
						],
						"value": "310115"
					},
					{
						"label": "金山区",
						"position": [
							"121.330736",
							"30.724697"
						],
						"value": "310116"
					},
					{
						"label": "松江区",
						"position": [
							"121.223543",
							"31.03047"
						],
						"value": "310117"
					},
					{
						"label": "青浦区",
						"position": [
							"121.113021",
							"31.151209"
						],
						"value": "310118"
					},
					{
						"label": "奉贤区",
						"position": [
							"121.458472",
							"30.912345"
						],
						"value": "310120"
					},
					{
						"label": "崇明区",
						"position": [
							"121.397516",
							"31.626946"
						],
						"value": "310151"
					}
				]
			}]
		},
		{
			"label": "江苏省",
			"position": [
				"118.767413",
				"32.041544"
			],
			"value": "320000",
			"children": [{
					"label": "南京市",
					"position": [
						"118.767413",
						"32.041544"
					],
					"value": "320100",
					"children": [{
							"label": "玄武区",
							"position": [
								"118.792199",
								"32.050678"
							],
							"value": "320102"
						},
						{
							"label": "秦淮区",
							"position": [
								"118.786088",
								"32.033818"
							],
							"value": "320104"
						},
						{
							"label": "建邺区",
							"position": [
								"118.732688",
								"32.004538"
							],
							"value": "320105"
						},
						{
							"label": "鼓楼区",
							"position": [
								"118.769739",
								"32.066966"
							],
							"value": "320106"
						},
						{
							"label": "浦口区",
							"position": [
								"118.625307",
								"32.05839"
							],
							"value": "320111"
						},
						{
							"label": "栖霞区",
							"position": [
								"118.808702",
								"32.102147"
							],
							"value": "320113"
						},
						{
							"label": "雨花台区",
							"position": [
								"118.77207",
								"31.995946"
							],
							"value": "320114"
						},
						{
							"label": "江宁区",
							"position": [
								"118.850621",
								"31.953418"
							],
							"value": "320115"
						},
						{
							"label": "六合区",
							"position": [
								"118.85065",
								"32.340655"
							],
							"value": "320116"
						},
						{
							"label": "溧水区",
							"position": [
								"119.028732",
								"31.653061"
							],
							"value": "320117"
						},
						{
							"label": "高淳区",
							"position": [
								"118.87589",
								"31.327132"
							],
							"value": "320118"
						}
					]
				},
				{
					"label": "无锡市",
					"position": [
						"120.301663",
						"31.574729"
					],
					"value": "320200",
					"children": [{
							"label": "锡山区",
							"position": [
								"120.357298",
								"31.585559"
							],
							"value": "320205"
						},
						{
							"label": "惠山区",
							"position": [
								"120.303543",
								"31.681019"
							],
							"value": "320206"
						},
						{
							"label": "滨湖区",
							"position": [
								"120.266053",
								"31.550228"
							],
							"value": "320211"
						},
						{
							"label": "梁溪区",
							"position": [
								"120.296595",
								"31.575706"
							],
							"value": "320213"
						},
						{
							"label": "新吴区",
							"position": [
								"120.352782",
								"31.550966"
							],
							"value": "320214"
						},
						{
							"label": "江阴市",
							"position": [
								"120.275891",
								"31.910984"
							],
							"value": "320281"
						},
						{
							"label": "宜兴市",
							"position": [
								"119.820538",
								"31.364384"
							],
							"value": "320282"
						}
					]
				},
				{
					"label": "徐州市",
					"position": [
						"117.184811",
						"34.261792"
					],
					"value": "320300",
					"children": [{
							"label": "鼓楼区",
							"position": [
								"117.192941",
								"34.269397"
							],
							"value": "320302"
						},
						{
							"label": "云龙区",
							"position": [
								"117.194589",
								"34.254805"
							],
							"value": "320303"
						},
						{
							"label": "贾汪区",
							"position": [
								"117.450212",
								"34.441642"
							],
							"value": "320305"
						},
						{
							"label": "泉山区",
							"position": [
								"117.182225",
								"34.262249"
							],
							"value": "320311"
						},
						{
							"label": "铜山区",
							"position": [
								"117.183894",
								"34.19288"
							],
							"value": "320312"
						},
						{
							"label": "丰县",
							"position": [
								"116.592888",
								"34.696946"
							],
							"value": "320321"
						},
						{
							"label": "沛县",
							"position": [
								"116.937182",
								"34.729044"
							],
							"value": "320322"
						},
						{
							"label": "睢宁县",
							"position": [
								"117.95066",
								"33.899222"
							],
							"value": "320324"
						},
						{
							"label": "新沂市",
							"position": [
								"118.345828",
								"34.368779"
							],
							"value": "320381"
						},
						{
							"label": "邳州市",
							"position": [
								"117.963923",
								"34.314708"
							],
							"value": "320382"
						}
					]
				},
				{
					"label": "常州市",
					"position": [
						"119.946973",
						"31.772752"
					],
					"value": "320400",
					"children": [{
							"label": "天宁区",
							"position": [
								"119.963783",
								"31.779632"
							],
							"value": "320402"
						},
						{
							"label": "钟楼区",
							"position": [
								"119.948388",
								"31.78096"
							],
							"value": "320404"
						},
						{
							"label": "新北区",
							"position": [
								"119.974654",
								"31.824664"
							],
							"value": "320411"
						},
						{
							"label": "武进区",
							"position": [
								"119.958773",
								"31.718566"
							],
							"value": "320412"
						},
						{
							"label": "金坛区",
							"position": [
								"119.573395",
								"31.744399"
							],
							"value": "320413"
						},
						{
							"label": "溧阳市",
							"position": [
								"119.487816",
								"31.427081"
							],
							"value": "320481"
						}
					]
				},
				{
					"label": "苏州市",
					"position": [
						"120.619585",
						"31.299379"
					],
					"value": "320500",
					"children": [{
							"label": "虎丘区",
							"position": [
								"120.566833",
								"31.294845"
							],
							"value": "320505"
						},
						{
							"label": "吴中区",
							"position": [
								"120.624621",
								"31.270839"
							],
							"value": "320506"
						},
						{
							"label": "相城区",
							"position": [
								"120.618956",
								"31.396684"
							],
							"value": "320507"
						},
						{
							"label": "姑苏区",
							"position": [
								"120.622249",
								"31.311414"
							],
							"value": "320508"
						},
						{
							"label": "吴江区",
							"position": [
								"120.641601",
								"31.160404"
							],
							"value": "320509"
						},
						{
							"label": "苏州工业园区",
							"position": [
								"120.723343",
								"31.324036"
							],
							"value": "320571"
						},
						{
							"label": "常熟市",
							"position": [
								"120.74852",
								"31.658156"
							],
							"value": "320581"
						},
						{
							"label": "张家港市",
							"position": [
								"120.543441",
								"31.865553"
							],
							"value": "320582"
						},
						{
							"label": "昆山市",
							"position": [
								"120.958137",
								"31.381925"
							],
							"value": "320583"
						},
						{
							"label": "太仓市",
							"position": [
								"121.112275",
								"31.452568"
							],
							"value": "320585"
						}
					]
				},
				{
					"label": "南通市",
					"position": [
						"120.864608",
						"32.016212"
					],
					"value": "320600",
					"children": [{
							"label": "崇川区",
							"position": [
								"120.86635",
								"32.015278"
							],
							"value": "320602"
						},
						{
							"label": "通州区",
							"position": [
								"121.073171",
								"32.084287"
							],
							"value": "320612"
						},
						{
							"label": "如东县",
							"position": [
								"121.186088",
								"32.311832"
							],
							"value": "320623"
						},
						{
							"label": "启东市",
							"position": [
								"121.659724",
								"31.810158"
							],
							"value": "320681"
						},
						{
							"label": "如皋市",
							"position": [
								"120.566324",
								"32.391591"
							],
							"value": "320682"
						},
						{
							"label": "海门区",
							"position": [
								"121.176609",
								"31.893528"
							],
							"value": "320684"
						},
						{
							"label": "海安市",
							"position": [
								"120.465995",
								"32.540288"
							],
							"value": "320685"
						}
					]
				},
				{
					"label": "连云港市",
					"position": [
						"119.178821",
						"34.600018"
					],
					"value": "320700",
					"children": [{
							"label": "连云区",
							"position": [
								"119.366487",
								"34.739529"
							],
							"value": "320703"
						},
						{
							"label": "海州区",
							"position": [
								"119.179793",
								"34.601584"
							],
							"value": "320706"
						},
						{
							"label": "赣榆区",
							"position": [
								"119.128774",
								"34.839154"
							],
							"value": "320707"
						},
						{
							"label": "东海县",
							"position": [
								"118.766489",
								"34.522859"
							],
							"value": "320722"
						},
						{
							"label": "灌云县",
							"position": [
								"119.255741",
								"34.298436"
							],
							"value": "320723"
						},
						{
							"label": "灌南县",
							"position": [
								"119.352331",
								"34.092553"
							],
							"value": "320724"
						}
					]
				},
				{
					"label": "淮安市",
					"position": [
						"119.021265",
						"33.597506"
					],
					"value": "320800",
					"children": [{
							"label": "淮安区",
							"position": [
								"119.14634",
								"33.507499"
							],
							"value": "320803"
						},
						{
							"label": "淮阴区",
							"position": [
								"119.020817",
								"33.622452"
							],
							"value": "320804"
						},
						{
							"label": "清江浦区",
							"position": [
								"119.019454",
								"33.603234"
							],
							"value": "320812"
						},
						{
							"label": "洪泽区",
							"position": [
								"118.867875",
								"33.294975"
							],
							"value": "320813"
						},
						{
							"label": "涟水县",
							"position": [
								"119.266078",
								"33.771308"
							],
							"value": "320826"
						},
						{
							"label": "盱眙县",
							"position": [
								"118.493823",
								"33.00439"
							],
							"value": "320830"
						},
						{
							"label": "金湖县",
							"position": [
								"119.016936",
								"33.018162"
							],
							"value": "320831"
						}
					]
				},
				{
					"label": "盐城市",
					"position": [
						"120.139998",
						"33.377631"
					],
					"value": "320900",
					"children": [{
							"label": "亭湖区",
							"position": [
								"120.136078",
								"33.383912"
							],
							"value": "320902"
						},
						{
							"label": "盐都区",
							"position": [
								"120.139753",
								"33.341288"
							],
							"value": "320903"
						},
						{
							"label": "大丰区",
							"position": [
								"120.470324",
								"33.199531"
							],
							"value": "320904"
						},
						{
							"label": "响水县",
							"position": [
								"119.579573",
								"34.19996"
							],
							"value": "320921"
						},
						{
							"label": "滨海县",
							"position": [
								"119.828434",
								"33.989888"
							],
							"value": "320922"
						},
						{
							"label": "阜宁县",
							"position": [
								"119.805338",
								"33.78573"
							],
							"value": "320923"
						},
						{
							"label": "射阳县",
							"position": [
								"120.257444",
								"33.773779"
							],
							"value": "320924"
						},
						{
							"label": "建湖县",
							"position": [
								"119.793105",
								"33.472621"
							],
							"value": "320925"
						},
						{
							"label": "东台市",
							"position": [
								"120.314101",
								"32.853174"
							],
							"value": "320981"
						}
					]
				},
				{
					"label": "扬州市",
					"position": [
						"119.421003",
						"32.393159"
					],
					"value": "321000",
					"children": [{
							"label": "广陵区",
							"position": [
								"119.442267",
								"32.392154"
							],
							"value": "321002"
						},
						{
							"label": "邗江区",
							"position": [
								"119.397777",
								"32.377899"
							],
							"value": "321003"
						},
						{
							"label": "江都区",
							"position": [
								"119.567481",
								"32.426564"
							],
							"value": "321012"
						},
						{
							"label": "宝应县",
							"position": [
								"119.321284",
								"33.23694"
							],
							"value": "321023"
						},
						{
							"label": "仪征市",
							"position": [
								"119.182443",
								"32.271965"
							],
							"value": "321081"
						},
						{
							"label": "高邮市",
							"position": [
								"119.443842",
								"32.785164"
							],
							"value": "321084"
						}
					]
				},
				{
					"label": "镇江市",
					"position": [
						"119.452753",
						"32.204402"
					],
					"value": "321100",
					"children": [{
							"label": "京口区",
							"position": [
								"119.454571",
								"32.206191"
							],
							"value": "321102"
						},
						{
							"label": "润州区",
							"position": [
								"119.414877",
								"32.213501"
							],
							"value": "321111"
						},
						{
							"label": "丹徒区",
							"position": [
								"119.433883",
								"32.128972"
							],
							"value": "321112"
						},
						{
							"label": "丹阳市",
							"position": [
								"119.581911",
								"31.991459"
							],
							"value": "321181"
						},
						{
							"label": "扬中市",
							"position": [
								"119.828054",
								"32.237266"
							],
							"value": "321182"
						},
						{
							"label": "句容市",
							"position": [
								"119.167135",
								"31.947355"
							],
							"value": "321183"
						}
					]
				},
				{
					"label": "泰州市",
					"position": [
						"119.915176",
						"32.484882"
					],
					"value": "321200",
					"children": [{
							"label": "海陵区",
							"position": [
								"119.920187",
								"32.488406"
							],
							"value": "321202"
						},
						{
							"label": "高港区",
							"position": [
								"119.88166",
								"32.315701"
							],
							"value": "321203"
						},
						{
							"label": "姜堰区",
							"position": [
								"120.148208",
								"32.508483"
							],
							"value": "321204"
						},
						{
							"label": "兴化市",
							"position": [
								"119.840162",
								"32.938065"
							],
							"value": "321281"
						},
						{
							"label": "靖江市",
							"position": [
								"120.26825",
								"32.018168"
							],
							"value": "321282"
						},
						{
							"label": "泰兴市",
							"position": [
								"120.020228",
								"32.168784"
							],
							"value": "321283"
						}
					]
				},
				{
					"label": "宿迁市",
					"position": [
						"118.275162",
						"33.963008"
					],
					"value": "321300",
					"children": [{
							"label": "宿城区",
							"position": [
								"118.278984",
								"33.937726"
							],
							"value": "321302"
						},
						{
							"label": "宿豫区",
							"position": [
								"118.330012",
								"33.941071"
							],
							"value": "321311"
						},
						{
							"label": "沭阳县",
							"position": [
								"118.775889",
								"34.129097"
							],
							"value": "321322"
						},
						{
							"label": "泗阳县",
							"position": [
								"118.681284",
								"33.711433"
							],
							"value": "321323"
						},
						{
							"label": "泗洪县",
							"position": [
								"118.211824",
								"33.456538"
							],
							"value": "321324"
						}
					]
				}
			]
		},
		{
			"label": "浙江省",
			"position": [
				"120.153576",
				"30.287459"
			],
			"value": "330000",
			"children": [{
					"label": "杭州市",
					"position": [
						"120.153576",
						"30.287459"
					],
					"value": "330100",
					"children": [{
							"label": "上城区",
							"position": [
								"120.171465",
								"30.250236"
							],
							"value": "330102"
						},
						{
							"label": "下城区",
							"position": [
								"120.172763",
								"30.276271"
							],
							"value": "330103"
						},
						{
							"label": "江干区",
							"position": [
								"120.202633",
								"30.266603"
							],
							"value": "330104"
						},
						{
							"label": "拱墅区",
							"position": [
								"120.150053",
								"30.314697"
							],
							"value": "330105"
						},
						{
							"label": "西湖区",
							"position": [
								"120.147376",
								"30.272934"
							],
							"value": "330106"
						},
						{
							"label": "滨江区",
							"position": [
								"120.21062",
								"30.206615"
							],
							"value": "330108"
						},
						{
							"label": "萧山区",
							"position": [
								"120.27069",
								"30.162932"
							],
							"value": "330109"
						},
						{
							"label": "余杭区",
							"position": [
								"120.301737",
								"30.421187"
							],
							"value": "330110"
						},
						{
							"label": "富阳区",
							"position": [
								"119.949869",
								"30.049871"
							],
							"value": "330111"
						},
						{
							"label": "临安区",
							"position": [
								"119.715101",
								"30.231153"
							],
							"value": "330112"
						},
						{
							"label": "桐庐县",
							"position": [
								"119.685045",
								"29.797437"
							],
							"value": "330122"
						},
						{
							"label": "淳安县",
							"position": [
								"119.044276",
								"29.604177"
							],
							"value": "330127"
						},
						{
							"label": "建德市",
							"position": [
								"119.279089",
								"29.472284"
							],
							"value": "330182"
						}
					]
				},
				{
					"label": "宁波市",
					"position": [
						"121.549792",
						"29.868388"
					],
					"value": "330200",
					"children": [{
							"label": "海曙区",
							"position": [
								"121.539698",
								"29.874452"
							],
							"value": "330203"
						},
						{
							"label": "江北区",
							"position": [
								"121.559282",
								"29.888361"
							],
							"value": "330205"
						},
						{
							"label": "北仑区",
							"position": [
								"121.831303",
								"29.90944"
							],
							"value": "330206"
						},
						{
							"label": "镇海区",
							"position": [
								"121.713162",
								"29.952107"
							],
							"value": "330211"
						},
						{
							"label": "鄞州区",
							"position": [
								"121.558436",
								"29.831662"
							],
							"value": "330212"
						},
						{
							"label": "奉化区",
							"position": [
								"121.41089",
								"29.662348"
							],
							"value": "330213"
						},
						{
							"label": "象山县",
							"position": [
								"121.877091",
								"29.470206"
							],
							"value": "330225"
						},
						{
							"label": "宁海县",
							"position": [
								"121.432606",
								"29.299836"
							],
							"value": "330226"
						},
						{
							"label": "余姚市",
							"position": [
								"121.156294",
								"30.045404"
							],
							"value": "330281"
						},
						{
							"label": "慈溪市",
							"position": [
								"121.248052",
								"30.177142"
							],
							"value": "330282"
						}
					]
				},
				{
					"label": "温州市",
					"position": [
						"120.672111",
						"28.000575"
					],
					"value": "330300",
					"children": [{
							"label": "鹿城区",
							"position": [
								"120.674231",
								"28.003352"
							],
							"value": "330302"
						},
						{
							"label": "龙湾区",
							"position": [
								"120.763469",
								"27.970254"
							],
							"value": "330303"
						},
						{
							"label": "瓯海区",
							"position": [
								"120.637145",
								"28.006444"
							],
							"value": "330304"
						},
						{
							"label": "洞头区",
							"position": [
								"121.156181",
								"27.836057"
							],
							"value": "330305"
						},
						{
							"label": "永嘉县",
							"position": [
								"120.690968",
								"28.153886"
							],
							"value": "330324"
						},
						{
							"label": "平阳县",
							"position": [
								"120.564387",
								"27.6693"
							],
							"value": "330326"
						},
						{
							"label": "苍南县",
							"position": [
								"120.406256",
								"27.507743"
							],
							"value": "330327"
						},
						{
							"label": "文成县",
							"position": [
								"120.09245",
								"27.789133"
							],
							"value": "330328"
						},
						{
							"label": "泰顺县",
							"position": [
								"119.71624",
								"27.557309"
							],
							"value": "330329"
						},
						{
							"label": "瑞安市",
							"position": [
								"120.646171",
								"27.779321"
							],
							"value": "330381"
						},
						{
							"label": "乐清市",
							"position": [
								"120.967147",
								"28.116083"
							],
							"value": "330382"
						},
						{
							"label": "龙港市",
							"position": [
								"120.553039",
								"27.578156"
							],
							"value": "330383"
						}
					]
				},
				{
					"label": "嘉兴市",
					"position": [
						"120.750865",
						"30.762653"
					],
					"value": "330400",
					"children": [{
							"label": "南湖区",
							"position": [
								"120.749953",
								"30.764652"
							],
							"value": "330402"
						},
						{
							"label": "秀洲区",
							"position": [
								"120.720431",
								"30.763323"
							],
							"value": "330411"
						},
						{
							"label": "嘉善县",
							"position": [
								"120.921871",
								"30.841352"
							],
							"value": "330421"
						},
						{
							"label": "海盐县",
							"position": [
								"120.942017",
								"30.522223"
							],
							"value": "330424"
						},
						{
							"label": "海宁市",
							"position": [
								"120.688821",
								"30.525544"
							],
							"value": "330481"
						},
						{
							"label": "平湖市",
							"position": [
								"121.014666",
								"30.698921"
							],
							"value": "330482"
						},
						{
							"label": "桐乡市",
							"position": [
								"120.551085",
								"30.629065"
							],
							"value": "330483"
						}
					]
				},
				{
					"label": "湖州市",
					"position": [
						"120.102398",
						"30.867198"
					],
					"value": "330500",
					"children": [{
							"label": "吴兴区",
							"position": [
								"120.101416",
								"30.867252"
							],
							"value": "330502"
						},
						{
							"label": "南浔区",
							"position": [
								"120.417195",
								"30.872742"
							],
							"value": "330503"
						},
						{
							"label": "德清县",
							"position": [
								"119.967662",
								"30.534927"
							],
							"value": "330521"
						},
						{
							"label": "长兴县",
							"position": [
								"119.910122",
								"31.00475"
							],
							"value": "330522"
						},
						{
							"label": "安吉县",
							"position": [
								"119.687891",
								"30.631974"
							],
							"value": "330523"
						}
					]
				},
				{
					"label": "绍兴市",
					"position": [
						"120.582112",
						"29.997117"
					],
					"value": "330600",
					"children": [{
							"label": "越城区",
							"position": [
								"120.585315",
								"29.996993"
							],
							"value": "330602"
						},
						{
							"label": "柯桥区",
							"position": [
								"120.476075",
								"30.078038"
							],
							"value": "330603"
						},
						{
							"label": "上虞区",
							"position": [
								"120.874185",
								"30.016769"
							],
							"value": "330604"
						},
						{
							"label": "新昌县",
							"position": [
								"120.905665",
								"29.501205"
							],
							"value": "330624"
						},
						{
							"label": "诸暨市",
							"position": [
								"120.244326",
								"29.713662"
							],
							"value": "330681"
						},
						{
							"label": "嵊州市",
							"position": [
								"120.82888",
								"29.586606"
							],
							"value": "330683"
						}
					]
				},
				{
					"label": "金华市",
					"position": [
						"119.649506",
						"29.089524"
					],
					"value": "330700",
					"children": [{
							"label": "婺城区",
							"position": [
								"119.652579",
								"29.082607"
							],
							"value": "330702"
						},
						{
							"label": "金东区",
							"position": [
								"119.681264",
								"29.095835"
							],
							"value": "330703"
						},
						{
							"label": "武义县",
							"position": [
								"119.819159",
								"28.896563"
							],
							"value": "330723"
						},
						{
							"label": "浦江县",
							"position": [
								"119.893363",
								"29.451254"
							],
							"value": "330726"
						},
						{
							"label": "磐安县",
							"position": [
								"120.44513",
								"29.052627"
							],
							"value": "330727"
						},
						{
							"label": "兰溪市",
							"position": [
								"119.460521",
								"29.210065"
							],
							"value": "330781"
						},
						{
							"label": "义乌市",
							"position": [
								"120.074911",
								"29.306863"
							],
							"value": "330782"
						},
						{
							"label": "东阳市",
							"position": [
								"120.23334",
								"29.262546"
							],
							"value": "330783"
						},
						{
							"label": "永康市",
							"position": [
								"120.036328",
								"28.895293"
							],
							"value": "330784"
						}
					]
				},
				{
					"label": "衢州市",
					"position": [
						"118.87263",
						"28.941708"
					],
					"value": "330800",
					"children": [{
							"label": "柯城区",
							"position": [
								"118.873041",
								"28.944539"
							],
							"value": "330802"
						},
						{
							"label": "衢江区",
							"position": [
								"118.957683",
								"28.973195"
							],
							"value": "330803"
						},
						{
							"label": "常山县",
							"position": [
								"118.521654",
								"28.900039"
							],
							"value": "330822"
						},
						{
							"label": "开化县",
							"position": [
								"118.414435",
								"29.136503"
							],
							"value": "330824"
						},
						{
							"label": "龙游县",
							"position": [
								"119.172525",
								"29.031364"
							],
							"value": "330825"
						},
						{
							"label": "江山市",
							"position": [
								"118.627879",
								"28.734674"
							],
							"value": "330881"
						}
					]
				},
				{
					"label": "舟山市",
					"position": [
						"122.106863",
						"30.016028"
					],
					"value": "330900",
					"children": [{
							"label": "定海区",
							"position": [
								"122.108496",
								"30.016423"
							],
							"value": "330902"
						},
						{
							"label": "普陀区",
							"position": [
								"122.301953",
								"29.945614"
							],
							"value": "330903"
						},
						{
							"label": "岱山县",
							"position": [
								"122.201132",
								"30.242865"
							],
							"value": "330921"
						},
						{
							"label": "嵊泗县",
							"position": [
								"122.457809",
								"30.727166"
							],
							"value": "330922"
						}
					]
				},
				{
					"label": "台州市",
					"position": [
						"121.428599",
						"28.661378"
					],
					"value": "331000",
					"children": [{
							"label": "椒江区",
							"position": [
								"121.431049",
								"28.67615"
							],
							"value": "331002"
						},
						{
							"label": "黄岩区",
							"position": [
								"121.262138",
								"28.64488"
							],
							"value": "331003"
						},
						{
							"label": "路桥区",
							"position": [
								"121.37292",
								"28.581799"
							],
							"value": "331004"
						},
						{
							"label": "三门县",
							"position": [
								"121.376429",
								"29.118955"
							],
							"value": "331022"
						},
						{
							"label": "天台县",
							"position": [
								"121.031227",
								"29.141126"
							],
							"value": "331023"
						},
						{
							"label": "仙居县",
							"position": [
								"120.735074",
								"28.849213"
							],
							"value": "331024"
						},
						{
							"label": "温岭市",
							"position": [
								"121.373611",
								"28.368781"
							],
							"value": "331081"
						},
						{
							"label": "临海市",
							"position": [
								"121.131229",
								"28.845441"
							],
							"value": "331082"
						},
						{
							"label": "玉环市",
							"position": [
								"121.232337",
								"28.12842"
							],
							"value": "331083"
						}
					]
				},
				{
					"label": "丽水市",
					"position": [
						"119.921786",
						"28.451993"
					],
					"value": "331100",
					"children": [{
							"label": "莲都区",
							"position": [
								"119.922293",
								"28.451103"
							],
							"value": "331102"
						},
						{
							"label": "青田县",
							"position": [
								"120.291939",
								"28.135247"
							],
							"value": "331121"
						},
						{
							"label": "缙云县",
							"position": [
								"120.078965",
								"28.654208"
							],
							"value": "331122"
						},
						{
							"label": "遂昌县",
							"position": [
								"119.27589",
								"28.5924"
							],
							"value": "331123"
						},
						{
							"label": "松阳县",
							"position": [
								"119.485292",
								"28.449937"
							],
							"value": "331124"
						},
						{
							"label": "云和县",
							"position": [
								"119.569458",
								"28.111077"
							],
							"value": "331125"
						},
						{
							"label": "庆元县",
							"position": [
								"119.067233",
								"27.618231"
							],
							"value": "331126"
						},
						{
							"label": "景宁畲族自治县",
							"position": [
								"119.634669",
								"27.977247"
							],
							"value": "331127"
						},
						{
							"label": "龙泉市",
							"position": [
								"119.132319",
								"28.069177"
							],
							"value": "331181"
						}
					]
				}
			]
		},
		{
			"label": "安徽省",
			"position": [
				"117.283042",
				"31.86119"
			],
			"value": "340000",
			"children": [{
					"label": "合肥市",
					"position": [
						"117.283042",
						"31.86119"
					],
					"value": "340100",
					"children": [{
							"label": "瑶海区",
							"position": [
								"117.315358",
								"31.86961"
							],
							"value": "340102"
						},
						{
							"label": "庐阳区",
							"position": [
								"117.283776",
								"31.869011"
							],
							"value": "340103"
						},
						{
							"label": "蜀山区",
							"position": [
								"117.262072",
								"31.855868"
							],
							"value": "340104"
						},
						{
							"label": "包河区",
							"position": [
								"117.285751",
								"31.82956"
							],
							"value": "340111"
						},
						{
							"label": "长丰县",
							"position": [
								"117.164699",
								"32.478548"
							],
							"value": "340121"
						},
						{
							"label": "肥东县",
							"position": [
								"117.463222",
								"31.883992"
							],
							"value": "340122"
						},
						{
							"label": "肥西县",
							"position": [
								"117.166118",
								"31.719646"
							],
							"value": "340123"
						},
						{
							"label": "庐江县",
							"position": [
								"117.289844",
								"31.251488"
							],
							"value": "340124"
						},
						{
							"label": "巢湖市",
							"position": [
								"117.874155",
								"31.600518"
							],
							"value": "340181"
						}
					]
				},
				{
					"label": "芜湖市",
					"position": [
						"118.376451",
						"31.326319"
					],
					"value": "340200",
					"children": [{
							"label": "镜湖区",
							"position": [
								"118.376343",
								"31.32559"
							],
							"value": "340202"
						},
						{
							"label": "弋江区",
							"position": [
								"118.377476",
								"31.313394"
							],
							"value": "340203"
						},
						{
							"label": "鸠江区",
							"position": [
								"118.400174",
								"31.362716"
							],
							"value": "340207"
						},
						{
							"label": "湾沚区",
							"position": [
								"118.572301",
								"31.145262"
							],
							"value": "340221"
						},
						{
							"label": "繁昌区",
							"position": [
								"118.201349",
								"31.080896"
							],
							"value": "340222"
						},
						{
							"label": "南陵县",
							"position": [
								"118.337104",
								"30.919638"
							],
							"value": "340223"
						},
						{
							"label": "无为市",
							"position": [
								"117.911432",
								"31.303075"
							],
							"value": "340281"
						}
					]
				},
				{
					"label": "蚌埠市",
					"position": [
						"117.363228",
						"32.939667"
					],
					"value": "340300",
					"children": [{
							"label": "龙子湖区",
							"position": [
								"117.382312",
								"32.950452"
							],
							"value": "340302"
						},
						{
							"label": "蚌山区",
							"position": [
								"117.355789",
								"32.938066"
							],
							"value": "340303"
						},
						{
							"label": "禹会区",
							"position": [
								"117.35259",
								"32.931933"
							],
							"value": "340304"
						},
						{
							"label": "淮上区",
							"position": [
								"117.34709",
								"32.963147"
							],
							"value": "340311"
						},
						{
							"label": "怀远县",
							"position": [
								"117.200171",
								"32.956934"
							],
							"value": "340321"
						},
						{
							"label": "五河县",
							"position": [
								"117.888809",
								"33.146202"
							],
							"value": "340322"
						},
						{
							"label": "固镇县",
							"position": [
								"117.315962",
								"33.318679"
							],
							"value": "340323"
						}
					]
				},
				{
					"label": "淮南市",
					"position": [
						"117.018329",
						"32.647574"
					],
					"value": "340400",
					"children": [{
							"label": "大通区",
							"position": [
								"117.052927",
								"32.632066"
							],
							"value": "340402"
						},
						{
							"label": "田家庵区",
							"position": [
								"117.018318",
								"32.644342"
							],
							"value": "340403"
						},
						{
							"label": "谢家集区",
							"position": [
								"116.865354",
								"32.598289"
							],
							"value": "340404"
						},
						{
							"label": "八公山区",
							"position": [
								"116.841111",
								"32.628229"
							],
							"value": "340405"
						},
						{
							"label": "潘集区",
							"position": [
								"116.816879",
								"32.782117"
							],
							"value": "340406"
						},
						{
							"label": "凤台县",
							"position": [
								"116.722769",
								"32.705382"
							],
							"value": "340421"
						},
						{
							"label": "寿县",
							"position": [
								"116.785349",
								"32.577304"
							],
							"value": "340422"
						}
					]
				},
				{
					"label": "马鞍山市",
					"position": [
						"118.507906",
						"31.689362"
					],
					"value": "340500",
					"children": [{
							"label": "花山区",
							"position": [
								"118.511308",
								"31.69902"
							],
							"value": "340503"
						},
						{
							"label": "雨山区",
							"position": [
								"118.493104",
								"31.685912"
							],
							"value": "340504"
						},
						{
							"label": "博望区",
							"position": [
								"118.843742",
								"31.562321"
							],
							"value": "340506"
						},
						{
							"label": "当涂县",
							"position": [
								"118.489873",
								"31.556167"
							],
							"value": "340521"
						},
						{
							"label": "含山县",
							"position": [
								"118.105545",
								"31.727758"
							],
							"value": "340522"
						},
						{
							"label": "和县",
							"position": [
								"118.362998",
								"31.716634"
							],
							"value": "340523"
						}
					]
				},
				{
					"label": "淮北市",
					"position": [
						"116.794664",
						"33.971707"
					],
					"value": "340600",
					"children": [{
							"label": "杜集区",
							"position": [
								"116.833925",
								"33.991218"
							],
							"value": "340602"
						},
						{
							"label": "相山区",
							"position": [
								"116.790775",
								"33.970916"
							],
							"value": "340603"
						},
						{
							"label": "烈山区",
							"position": [
								"116.809465",
								"33.889529"
							],
							"value": "340604"
						},
						{
							"label": "濉溪县",
							"position": [
								"116.767435",
								"33.916407"
							],
							"value": "340621"
						}
					]
				},
				{
					"label": "铜陵市",
					"position": [
						"117.816576",
						"30.929935"
					],
					"value": "340700",
					"children": [{
							"label": "铜官区",
							"position": [
								"117.816167",
								"30.927613"
							],
							"value": "340705"
						},
						{
							"label": "义安区",
							"position": [
								"117.792288",
								"30.952338"
							],
							"value": "340706"
						},
						{
							"label": "郊区",
							"position": [
								"117.80707",
								"30.908927"
							],
							"value": "340711"
						},
						{
							"label": "枞阳县",
							"position": [
								"117.222027",
								"30.700615"
							],
							"value": "340722"
						}
					]
				},
				{
					"label": "安庆市",
					"position": [
						"117.043551",
						"30.50883"
					],
					"value": "340800",
					"children": [{
							"label": "迎江区",
							"position": [
								"117.044965",
								"30.506375"
							],
							"value": "340802"
						},
						{
							"label": "大观区",
							"position": [
								"117.034512",
								"30.505632"
							],
							"value": "340803"
						},
						{
							"label": "宜秀区",
							"position": [
								"117.070003",
								"30.541323"
							],
							"value": "340811"
						},
						{
							"label": "怀宁县",
							"position": [
								"116.828664",
								"30.734994"
							],
							"value": "340822"
						},
						{
							"label": "太湖县",
							"position": [
								"116.305225",
								"30.451869"
							],
							"value": "340825"
						},
						{
							"label": "宿松县",
							"position": [
								"116.120204",
								"30.158327"
							],
							"value": "340826"
						},
						{
							"label": "望江县",
							"position": [
								"116.690927",
								"30.12491"
							],
							"value": "340827"
						},
						{
							"label": "岳西县",
							"position": [
								"116.360482",
								"30.848502"
							],
							"value": "340828"
						},
						{
							"label": "桐城市",
							"position": [
								"116.959656",
								"31.050576"
							],
							"value": "340881"
						},
						{
							"label": "潜山市",
							"position": [
								"116.573665",
								"30.638222"
							],
							"value": "340882"
						}
					]
				},
				{
					"label": "黄山市",
					"position": [
						"118.317325",
						"29.709239"
					],
					"value": "341000",
					"children": [{
							"label": "屯溪区",
							"position": [
								"118.317354",
								"29.709186"
							],
							"value": "341002"
						},
						{
							"label": "黄山区",
							"position": [
								"118.136639",
								"30.294517"
							],
							"value": "341003"
						},
						{
							"label": "徽州区",
							"position": [
								"118.339743",
								"29.825201"
							],
							"value": "341004"
						},
						{
							"label": "歙县",
							"position": [
								"118.428025",
								"29.867748"
							],
							"value": "341021"
						},
						{
							"label": "休宁县",
							"position": [
								"118.188531",
								"29.788878"
							],
							"value": "341022"
						},
						{
							"label": "黟县",
							"position": [
								"117.942911",
								"29.923812"
							],
							"value": "341023"
						},
						{
							"label": "祁门县",
							"position": [
								"117.717237",
								"29.853472"
							],
							"value": "341024"
						}
					]
				},
				{
					"label": "滁州市",
					"position": [
						"118.316264",
						"32.303627"
					],
					"value": "341100",
					"children": [{
							"label": "琅琊区",
							"position": [
								"118.316475",
								"32.303797"
							],
							"value": "341102"
						},
						{
							"label": "南谯区",
							"position": [
								"118.296955",
								"32.329841"
							],
							"value": "341103"
						},
						{
							"label": "来安县",
							"position": [
								"118.433293",
								"32.450231"
							],
							"value": "341122"
						},
						{
							"label": "全椒县",
							"position": [
								"118.268576",
								"32.09385"
							],
							"value": "341124"
						},
						{
							"label": "定远县",
							"position": [
								"117.683713",
								"32.527105"
							],
							"value": "341125"
						},
						{
							"label": "凤阳县",
							"position": [
								"117.562461",
								"32.867146"
							],
							"value": "341126"
						},
						{
							"label": "天长市",
							"position": [
								"119.011212",
								"32.6815"
							],
							"value": "341181"
						},
						{
							"label": "明光市",
							"position": [
								"117.998048",
								"32.781206"
							],
							"value": "341182"
						}
					]
				},
				{
					"label": "阜阳市",
					"position": [
						"115.819729",
						"32.896969"
					],
					"value": "341200",
					"children": [{
							"label": "颍州区",
							"position": [
								"115.813914",
								"32.891238"
							],
							"value": "341202"
						},
						{
							"label": "颍东区",
							"position": [
								"115.858747",
								"32.908861"
							],
							"value": "341203"
						},
						{
							"label": "颍泉区",
							"position": [
								"115.804525",
								"32.924797"
							],
							"value": "341204"
						},
						{
							"label": "临泉县",
							"position": [
								"115.261688",
								"33.062698"
							],
							"value": "341221"
						},
						{
							"label": "太和县",
							"position": [
								"115.627243",
								"33.16229"
							],
							"value": "341222"
						},
						{
							"label": "阜南县",
							"position": [
								"115.590534",
								"32.638102"
							],
							"value": "341225"
						},
						{
							"label": "颍上县",
							"position": [
								"116.259122",
								"32.637065"
							],
							"value": "341226"
						},
						{
							"label": "界首市",
							"position": [
								"115.362117",
								"33.26153"
							],
							"value": "341282"
						}
					]
				},
				{
					"label": "宿州市",
					"position": [
						"116.984084",
						"33.633891"
					],
					"value": "341300",
					"children": [{
							"label": "埇桥区",
							"position": [
								"116.983309",
								"33.633853"
							],
							"value": "341302"
						},
						{
							"label": "砀山县",
							"position": [
								"116.351113",
								"34.426247"
							],
							"value": "341321"
						},
						{
							"label": "萧县",
							"position": [
								"116.945399",
								"34.183266"
							],
							"value": "341322"
						},
						{
							"label": "灵璧县",
							"position": [
								"117.551493",
								"33.540629"
							],
							"value": "341323"
						},
						{
							"label": "泗县",
							"position": [
								"117.885443",
								"33.47758"
							],
							"value": "341324"
						}
					]
				},
				{
					"label": "六安市",
					"position": [
						"116.507676",
						"31.752889"
					],
					"value": "341500",
					"children": [{
							"label": "金安区",
							"position": [
								"116.503288",
								"31.754491"
							],
							"value": "341502"
						},
						{
							"label": "裕安区",
							"position": [
								"116.494543",
								"31.750692"
							],
							"value": "341503"
						},
						{
							"label": "叶集区",
							"position": [
								"115.913594",
								"31.84768"
							],
							"value": "341504"
						},
						{
							"label": "霍邱县",
							"position": [
								"116.278875",
								"32.341305"
							],
							"value": "341522"
						},
						{
							"label": "舒城县",
							"position": [
								"116.944088",
								"31.462848"
							],
							"value": "341523"
						},
						{
							"label": "金寨县",
							"position": [
								"115.878514",
								"31.681624"
							],
							"value": "341524"
						},
						{
							"label": "霍山县",
							"position": [
								"116.333078",
								"31.402456"
							],
							"value": "341525"
						}
					]
				},
				{
					"label": "亳州市",
					"position": [
						"115.782939",
						"33.869338"
					],
					"value": "341600",
					"children": [{
							"label": "谯城区",
							"position": [
								"115.781214",
								"33.869284"
							],
							"value": "341602"
						},
						{
							"label": "涡阳县",
							"position": [
								"116.211551",
								"33.502831"
							],
							"value": "341621"
						},
						{
							"label": "蒙城县",
							"position": [
								"116.560337",
								"33.260814"
							],
							"value": "341622"
						},
						{
							"label": "利辛县",
							"position": [
								"116.207782",
								"33.143503"
							],
							"value": "341623"
						}
					]
				},
				{
					"label": "池州市",
					"position": [
						"117.489157",
						"30.656037"
					],
					"value": "341700",
					"children": [{
							"label": "贵池区",
							"position": [
								"117.488342",
								"30.657378"
							],
							"value": "341702"
						},
						{
							"label": "东至县",
							"position": [
								"117.021476",
								"30.096568"
							],
							"value": "341721"
						},
						{
							"label": "石台县",
							"position": [
								"117.482907",
								"30.210324"
							],
							"value": "341722"
						},
						{
							"label": "青阳县",
							"position": [
								"117.857395",
								"30.63818"
							],
							"value": "341723"
						}
					]
				},
				{
					"label": "宣城市",
					"position": [
						"118.757995",
						"30.945667"
					],
					"value": "341800",
					"children": [{
							"label": "宣州区",
							"position": [
								"118.758412",
								"30.946003"
							],
							"value": "341802"
						},
						{
							"label": "郎溪县",
							"position": [
								"119.185024",
								"31.127834"
							],
							"value": "341821"
						},
						{
							"label": "泾县",
							"position": [
								"118.412397",
								"30.685975"
							],
							"value": "341823"
						},
						{
							"label": "绩溪县",
							"position": [
								"118.594705",
								"30.065267"
							],
							"value": "341824"
						},
						{
							"label": "旌德县",
							"position": [
								"118.543081",
								"30.288057"
							],
							"value": "341825"
						},
						{
							"label": "宁国市",
							"position": [
								"118.983407",
								"30.626529"
							],
							"value": "341881"
						},
						{
							"label": "广德市",
							"position": [
								"119.417521",
								"30.893116"
							],
							"value": "341882"
						}
					]
				}
			]
		},
		{
			"label": "福建省",
			"position": [
				"119.306239",
				"26.075302"
			],
			"value": "350000",
			"children": [{
					"label": "福州市",
					"position": [
						"119.306239",
						"26.075302"
					],
					"value": "350100",
					"children": [{
							"label": "鼓楼区",
							"position": [
								"119.29929",
								"26.082284"
							],
							"value": "350102"
						},
						{
							"label": "台江区",
							"position": [
								"119.310156",
								"26.058616"
							],
							"value": "350103"
						},
						{
							"label": "仓山区",
							"position": [
								"119.320988",
								"26.038912"
							],
							"value": "350104"
						},
						{
							"label": "马尾区",
							"position": [
								"119.458725",
								"25.991975"
							],
							"value": "350105"
						},
						{
							"label": "晋安区",
							"position": [
								"119.328597",
								"26.078837"
							],
							"value": "350111"
						},
						{
							"label": "长乐区",
							"position": [
								"119.510849",
								"25.960583"
							],
							"value": "350112"
						},
						{
							"label": "闽侯县",
							"position": [
								"119.145117",
								"26.148567"
							],
							"value": "350121"
						},
						{
							"label": "连江县",
							"position": [
								"119.538365",
								"26.202109"
							],
							"value": "350122"
						},
						{
							"label": "罗源县",
							"position": [
								"119.552645",
								"26.487234"
							],
							"value": "350123"
						},
						{
							"label": "闽清县",
							"position": [
								"118.868416",
								"26.223793"
							],
							"value": "350124"
						},
						{
							"label": "永泰县",
							"position": [
								"118.939089",
								"25.864825"
							],
							"value": "350125"
						},
						{
							"label": "平潭县",
							"position": [
								"119.791197",
								"25.503672"
							],
							"value": "350128"
						},
						{
							"label": "福清市",
							"position": [
								"119.376992",
								"25.720402"
							],
							"value": "350181"
						}
					]
				},
				{
					"label": "厦门市",
					"position": [
						"118.11022",
						"24.490474"
					],
					"value": "350200",
					"children": [{
							"label": "思明区",
							"position": [
								"118.087828",
								"24.462059"
							],
							"value": "350203"
						},
						{
							"label": "海沧区",
							"position": [
								"118.036364",
								"24.492512"
							],
							"value": "350205"
						},
						{
							"label": "湖里区",
							"position": [
								"118.10943",
								"24.512764"
							],
							"value": "350206"
						},
						{
							"label": "集美区",
							"position": [
								"118.100869",
								"24.572874"
							],
							"value": "350211"
						},
						{
							"label": "同安区",
							"position": [
								"118.150455",
								"24.729333"
							],
							"value": "350212"
						},
						{
							"label": "翔安区",
							"position": [
								"118.242811",
								"24.637479"
							],
							"value": "350213"
						}
					]
				},
				{
					"label": "莆田市",
					"position": [
						"119.007558",
						"25.431011"
					],
					"value": "350300",
					"children": [{
							"label": "城厢区",
							"position": [
								"119.001028",
								"25.433737"
							],
							"value": "350302"
						},
						{
							"label": "涵江区",
							"position": [
								"119.119102",
								"25.459273"
							],
							"value": "350303"
						},
						{
							"label": "荔城区",
							"position": [
								"119.020047",
								"25.430047"
							],
							"value": "350304"
						},
						{
							"label": "秀屿区",
							"position": [
								"119.092607",
								"25.316141"
							],
							"value": "350305"
						},
						{
							"label": "仙游县",
							"position": [
								"118.694331",
								"25.356529"
							],
							"value": "350322"
						}
					]
				},
				{
					"label": "三明市",
					"position": [
						"117.635001",
						"26.265444"
					],
					"value": "350400",
					"children": [{
							"label": "梅列区",
							"position": [
								"117.63687",
								"26.269208"
							],
							"value": "350402"
						},
						{
							"label": "三元区",
							"position": [
								"117.607418",
								"26.234191"
							],
							"value": "350403"
						},
						{
							"label": "明溪县",
							"position": [
								"117.201845",
								"26.357375"
							],
							"value": "350421"
						},
						{
							"label": "清流县",
							"position": [
								"116.815821",
								"26.17761"
							],
							"value": "350423"
						},
						{
							"label": "宁化县",
							"position": [
								"116.659725",
								"26.259932"
							],
							"value": "350424"
						},
						{
							"label": "大田县",
							"position": [
								"117.849355",
								"25.690803"
							],
							"value": "350425"
						},
						{
							"label": "尤溪县",
							"position": [
								"118.188577",
								"26.169261"
							],
							"value": "350426"
						},
						{
							"label": "沙县",
							"position": [
								"117.789095",
								"26.397361"
							],
							"value": "350427"
						},
						{
							"label": "将乐县",
							"position": [
								"117.473558",
								"26.728667"
							],
							"value": "350428"
						},
						{
							"label": "泰宁县",
							"position": [
								"117.177522",
								"26.897995"
							],
							"value": "350429"
						},
						{
							"label": "建宁县",
							"position": [
								"116.845832",
								"26.831398"
							],
							"value": "350430"
						},
						{
							"label": "永安市",
							"position": [
								"117.364447",
								"25.974075"
							],
							"value": "350481"
						}
					]
				},
				{
					"label": "泉州市",
					"position": [
						"118.589421",
						"24.908853"
					],
					"value": "350500",
					"children": [{
							"label": "鲤城区",
							"position": [
								"118.588929",
								"24.907645"
							],
							"value": "350502"
						},
						{
							"label": "丰泽区",
							"position": [
								"118.605147",
								"24.896041"
							],
							"value": "350503"
						},
						{
							"label": "洛江区",
							"position": [
								"118.670312",
								"24.941153"
							],
							"value": "350504"
						},
						{
							"label": "泉港区",
							"position": [
								"118.912285",
								"25.126859"
							],
							"value": "350505"
						},
						{
							"label": "惠安县",
							"position": [
								"118.798954",
								"25.028718"
							],
							"value": "350521"
						},
						{
							"label": "安溪县",
							"position": [
								"118.186014",
								"25.056824"
							],
							"value": "350524"
						},
						{
							"label": "永春县",
							"position": [
								"118.29503",
								"25.320721"
							],
							"value": "350525"
						},
						{
							"label": "德化县",
							"position": [
								"118.242986",
								"25.489004"
							],
							"value": "350526"
						},
						{
							"label": "金门县",
							"position": [
								"118.323221",
								"24.436417"
							],
							"value": "350527"
						},
						{
							"label": "石狮市",
							"position": [
								"118.628402",
								"24.731978"
							],
							"value": "350581"
						},
						{
							"label": "晋江市",
							"position": [
								"118.577338",
								"24.807322"
							],
							"value": "350582"
						},
						{
							"label": "南安市",
							"position": [
								"118.387031",
								"24.959494"
							],
							"value": "350583"
						}
					]
				},
				{
					"label": "漳州市",
					"position": [
						"117.661801",
						"24.510897"
					],
					"value": "350600",
					"children": [{
							"label": "芗城区",
							"position": [
								"117.656461",
								"24.509955"
							],
							"value": "350602"
						},
						{
							"label": "龙文区",
							"position": [
								"117.671387",
								"24.515656"
							],
							"value": "350603"
						},
						{
							"label": "云霄县",
							"position": [
								"117.340946",
								"23.950486"
							],
							"value": "350622"
						},
						{
							"label": "漳浦县",
							"position": [
								"117.614023",
								"24.117907"
							],
							"value": "350623"
						},
						{
							"label": "诏安县",
							"position": [
								"117.176083",
								"23.710834"
							],
							"value": "350624"
						},
						{
							"label": "长泰县",
							"position": [
								"117.755913",
								"24.621475"
							],
							"value": "350625"
						},
						{
							"label": "东山县",
							"position": [
								"117.427679",
								"23.702845"
							],
							"value": "350626"
						},
						{
							"label": "南靖县",
							"position": [
								"117.365462",
								"24.516425"
							],
							"value": "350627"
						},
						{
							"label": "平和县",
							"position": [
								"117.313549",
								"24.366158"
							],
							"value": "350628"
						},
						{
							"label": "华安县",
							"position": [
								"117.53631",
								"25.001416"
							],
							"value": "350629"
						},
						{
							"label": "龙海市",
							"position": [
								"117.817292",
								"24.445341"
							],
							"value": "350681"
						}
					]
				},
				{
					"label": "南平市",
					"position": [
						"118.178459",
						"26.635627"
					],
					"value": "350700",
					"children": [{
							"label": "延平区",
							"position": [
								"118.178918",
								"26.636079"
							],
							"value": "350702"
						},
						{
							"label": "建阳区",
							"position": [
								"118.12267",
								"27.332067"
							],
							"value": "350703"
						},
						{
							"label": "顺昌县",
							"position": [
								"117.80771",
								"26.792851"
							],
							"value": "350721"
						},
						{
							"label": "浦城县",
							"position": [
								"118.536822",
								"27.920412"
							],
							"value": "350722"
						},
						{
							"label": "光泽县",
							"position": [
								"117.337897",
								"27.542803"
							],
							"value": "350723"
						},
						{
							"label": "松溪县",
							"position": [
								"118.783491",
								"27.525785"
							],
							"value": "350724"
						},
						{
							"label": "政和县",
							"position": [
								"118.858661",
								"27.365398"
							],
							"value": "350725"
						},
						{
							"label": "邵武市",
							"position": [
								"117.491544",
								"27.337952"
							],
							"value": "350781"
						},
						{
							"label": "武夷山市",
							"position": [
								"118.032796",
								"27.751733"
							],
							"value": "350782"
						},
						{
							"label": "建瓯市",
							"position": [
								"118.321765",
								"27.03502"
							],
							"value": "350783"
						}
					]
				},
				{
					"label": "龙岩市",
					"position": [
						"117.02978",
						"25.091603"
					],
					"value": "350800",
					"children": [{
							"label": "新罗区",
							"position": [
								"117.030721",
								"25.0918"
							],
							"value": "350802"
						},
						{
							"label": "永定区",
							"position": [
								"116.732691",
								"24.720442"
							],
							"value": "350803"
						},
						{
							"label": "长汀县",
							"position": [
								"116.361007",
								"25.842278"
							],
							"value": "350821"
						},
						{
							"label": "上杭县",
							"position": [
								"116.424774",
								"25.050019"
							],
							"value": "350823"
						},
						{
							"label": "武平县",
							"position": [
								"116.100928",
								"25.08865"
							],
							"value": "350824"
						},
						{
							"label": "连城县",
							"position": [
								"116.756687",
								"25.708506"
							],
							"value": "350825"
						},
						{
							"label": "漳平市",
							"position": [
								"117.42073",
								"25.291597"
							],
							"value": "350881"
						}
					]
				},
				{
					"label": "宁德市",
					"position": [
						"119.527082",
						"26.65924"
					],
					"value": "350900",
					"children": [{
							"label": "蕉城区",
							"position": [
								"119.527225",
								"26.659253"
							],
							"value": "350902"
						},
						{
							"label": "霞浦县",
							"position": [
								"120.005214",
								"26.882068"
							],
							"value": "350921"
						},
						{
							"label": "古田县",
							"position": [
								"118.743156",
								"26.577491"
							],
							"value": "350922"
						},
						{
							"label": "屏南县",
							"position": [
								"118.987544",
								"26.910826"
							],
							"value": "350923"
						},
						{
							"label": "寿宁县",
							"position": [
								"119.506733",
								"27.457798"
							],
							"value": "350924"
						},
						{
							"label": "周宁县",
							"position": [
								"119.338239",
								"27.103106"
							],
							"value": "350925"
						},
						{
							"label": "柘荣县",
							"position": [
								"119.898226",
								"27.236163"
							],
							"value": "350926"
						},
						{
							"label": "福安市",
							"position": [
								"119.650798",
								"27.084246"
							],
							"value": "350981"
						},
						{
							"label": "福鼎市",
							"position": [
								"120.219761",
								"27.318884"
							],
							"value": "350982"
						}
					]
				}
			]
		},
		{
			"label": "江西省",
			"position": [
				"115.892151",
				"28.676493"
			],
			"value": "360000",
			"children": [{
					"label": "南昌市",
					"position": [
						"115.892151",
						"28.676493"
					],
					"value": "360100",
					"children": [{
							"label": "东湖区",
							"position": [
								"115.889675",
								"28.682988"
							],
							"value": "360102"
						},
						{
							"label": "西湖区",
							"position": [
								"115.91065",
								"28.662901"
							],
							"value": "360103"
						},
						{
							"label": "青云谱区",
							"position": [
								"115.907292",
								"28.635724"
							],
							"value": "360104"
						},
						{
							"label": "青山湖区",
							"position": [
								"115.949044",
								"28.689292"
							],
							"value": "360111"
						},
						{
							"label": "新建区",
							"position": [
								"115.820806",
								"28.690788"
							],
							"value": "360112"
						},
						{
							"label": "红谷滩区",
							"position": [
								"115.8580521",
								"28.69819928"
							],
							"value": "360113"
						},
						{
							"label": "南昌县",
							"position": [
								"115.942465",
								"28.543781"
							],
							"value": "360121"
						},
						{
							"label": "安义县",
							"position": [
								"115.553109",
								"28.841334"
							],
							"value": "360123"
						},
						{
							"label": "进贤县",
							"position": [
								"116.267671",
								"28.365681"
							],
							"value": "360124"
						}
					]
				},
				{
					"label": "景德镇市",
					"position": [
						"117.214664",
						"29.29256"
					],
					"value": "360200",
					"children": [{
							"label": "昌江区",
							"position": [
								"117.195023",
								"29.288465"
							],
							"value": "360202"
						},
						{
							"label": "珠山区",
							"position": [
								"117.214814",
								"29.292812"
							],
							"value": "360203"
						},
						{
							"label": "浮梁县",
							"position": [
								"117.217611",
								"29.352251"
							],
							"value": "360222"
						},
						{
							"label": "乐平市",
							"position": [
								"117.129376",
								"28.967361"
							],
							"value": "360281"
						}
					]
				},
				{
					"label": "萍乡市",
					"position": [
						"113.852186",
						"27.622946"
					],
					"value": "360300",
					"children": [{
							"label": "安源区",
							"position": [
								"113.855044",
								"27.625826"
							],
							"value": "360302"
						},
						{
							"label": "湘东区",
							"position": [
								"113.7456",
								"27.639319"
							],
							"value": "360313"
						},
						{
							"label": "莲花县",
							"position": [
								"113.955582",
								"27.127807"
							],
							"value": "360321"
						},
						{
							"label": "上栗县",
							"position": [
								"113.800525",
								"27.877041"
							],
							"value": "360322"
						},
						{
							"label": "芦溪县",
							"position": [
								"114.041206",
								"27.633633"
							],
							"value": "360323"
						}
					]
				},
				{
					"label": "九江市",
					"position": [
						"115.992811",
						"29.712034"
					],
					"value": "360400",
					"children": [{
							"label": "濂溪区",
							"position": [
								"115.99012",
								"29.676175"
							],
							"value": "360402"
						},
						{
							"label": "浔阳区",
							"position": [
								"115.995947",
								"29.72465"
							],
							"value": "360403"
						},
						{
							"label": "柴桑区",
							"position": [
								"115.892977",
								"29.610264"
							],
							"value": "360404"
						},
						{
							"label": "武宁县",
							"position": [
								"115.105646",
								"29.260182"
							],
							"value": "360423"
						},
						{
							"label": "修水县",
							"position": [
								"114.573428",
								"29.032729"
							],
							"value": "360424"
						},
						{
							"label": "永修县",
							"position": [
								"115.809055",
								"29.018212"
							],
							"value": "360425"
						},
						{
							"label": "德安县",
							"position": [
								"115.762611",
								"29.327474"
							],
							"value": "360426"
						},
						{
							"label": "都昌县",
							"position": [
								"116.205114",
								"29.275105"
							],
							"value": "360428"
						},
						{
							"label": "湖口县",
							"position": [
								"116.244313",
								"29.7263"
							],
							"value": "360429"
						},
						{
							"label": "彭泽县",
							"position": [
								"116.55584",
								"29.898865"
							],
							"value": "360430"
						},
						{
							"label": "瑞昌市",
							"position": [
								"115.669081",
								"29.676599"
							],
							"value": "360481"
						},
						{
							"label": "共青城市",
							"position": [
								"115.805712",
								"29.247884"
							],
							"value": "360482"
						},
						{
							"label": "庐山市",
							"position": [
								"116.043743",
								"29.456169"
							],
							"value": "360483"
						}
					]
				},
				{
					"label": "新余市",
					"position": [
						"114.930835",
						"27.810834"
					],
					"value": "360500",
					"children": [{
							"label": "渝水区",
							"position": [
								"114.923923",
								"27.819171"
							],
							"value": "360502"
						},
						{
							"label": "分宜县",
							"position": [
								"114.675262",
								"27.811301"
							],
							"value": "360521"
						}
					]
				},
				{
					"label": "鹰潭市",
					"position": [
						"117.033838",
						"28.238638"
					],
					"value": "360600",
					"children": [{
							"label": "月湖区",
							"position": [
								"117.034112",
								"28.239076"
							],
							"value": "360602"
						},
						{
							"label": "余江区",
							"position": [
								"116.822763",
								"28.206177"
							],
							"value": "360603"
						},
						{
							"label": "贵溪市",
							"position": [
								"117.212103",
								"28.283693"
							],
							"value": "360681"
						}
					]
				},
				{
					"label": "赣州市",
					"position": [
						"114.940278",
						"25.85097"
					],
					"value": "360700",
					"children": [{
							"label": "章贡区",
							"position": [
								"114.93872",
								"25.851367"
							],
							"value": "360702"
						},
						{
							"label": "南康区",
							"position": [
								"114.756933",
								"25.661721"
							],
							"value": "360703"
						},
						{
							"label": "赣县区",
							"position": [
								"115.018461",
								"25.865432"
							],
							"value": "360704"
						},
						{
							"label": "信丰县",
							"position": [
								"114.930893",
								"25.38023"
							],
							"value": "360722"
						},
						{
							"label": "大余县",
							"position": [
								"114.362243",
								"25.395937"
							],
							"value": "360723"
						},
						{
							"label": "上犹县",
							"position": [
								"114.540537",
								"25.794284"
							],
							"value": "360724"
						},
						{
							"label": "崇义县",
							"position": [
								"114.307348",
								"25.687911"
							],
							"value": "360725"
						},
						{
							"label": "安远县",
							"position": [
								"115.392328",
								"25.134591"
							],
							"value": "360726"
						},
						{
							"label": "定南县",
							"position": [
								"115.03267",
								"24.774277"
							],
							"value": "360728"
						},
						{
							"label": "全南县",
							"position": [
								"114.531589",
								"24.742651"
							],
							"value": "360729"
						},
						{
							"label": "宁都县",
							"position": [
								"116.018782",
								"26.472054"
							],
							"value": "360730"
						},
						{
							"label": "于都县",
							"position": [
								"115.411198",
								"25.955033"
							],
							"value": "360731"
						},
						{
							"label": "兴国县",
							"position": [
								"115.351896",
								"26.330489"
							],
							"value": "360732"
						},
						{
							"label": "会昌县",
							"position": [
								"115.791158",
								"25.599125"
							],
							"value": "360733"
						},
						{
							"label": "寻乌县",
							"position": [
								"115.651399",
								"24.954136"
							],
							"value": "360734"
						},
						{
							"label": "石城县",
							"position": [
								"116.342249",
								"26.326582"
							],
							"value": "360735"
						},
						{
							"label": "瑞金市",
							"position": [
								"116.034854",
								"25.875278"
							],
							"value": "360781"
						},
						{
							"label": "龙南市",
							"position": [
								"114.792657",
								"24.90476"
							],
							"value": "360783"
						}
					]
				},
				{
					"label": "吉安市",
					"position": [
						"114.986373",
						"27.111699"
					],
					"value": "360800",
					"children": [{
							"label": "吉州区",
							"position": [
								"114.987331",
								"27.112367"
							],
							"value": "360802"
						},
						{
							"label": "青原区",
							"position": [
								"115.016306",
								"27.105879"
							],
							"value": "360803"
						},
						{
							"label": "吉安县",
							"position": [
								"114.905117",
								"27.040042"
							],
							"value": "360821"
						},
						{
							"label": "吉水县",
							"position": [
								"115.134569",
								"27.213445"
							],
							"value": "360822"
						},
						{
							"label": "峡江县",
							"position": [
								"115.319331",
								"27.580862"
							],
							"value": "360823"
						},
						{
							"label": "新干县",
							"position": [
								"115.399294",
								"27.755758"
							],
							"value": "360824"
						},
						{
							"label": "永丰县",
							"position": [
								"115.435559",
								"27.321087"
							],
							"value": "360825"
						},
						{
							"label": "泰和县",
							"position": [
								"114.901393",
								"26.790164"
							],
							"value": "360826"
						},
						{
							"label": "遂川县",
							"position": [
								"114.51689",
								"26.323705"
							],
							"value": "360827"
						},
						{
							"label": "万安县",
							"position": [
								"114.784694",
								"26.462085"
							],
							"value": "360828"
						},
						{
							"label": "安福县",
							"position": [
								"114.61384",
								"27.382746"
							],
							"value": "360829"
						},
						{
							"label": "永新县",
							"position": [
								"114.242534",
								"26.944721"
							],
							"value": "360830"
						},
						{
							"label": "井冈山市",
							"position": [
								"114.284421",
								"26.745919"
							],
							"value": "360881"
						}
					]
				},
				{
					"label": "宜春市",
					"position": [
						"114.391136",
						"27.8043"
					],
					"value": "360900",
					"children": [{
							"label": "袁州区",
							"position": [
								"114.387379",
								"27.800117"
							],
							"value": "360902"
						},
						{
							"label": "奉新县",
							"position": [
								"115.389899",
								"28.700672"
							],
							"value": "360921"
						},
						{
							"label": "万载县",
							"position": [
								"114.449012",
								"28.104528"
							],
							"value": "360922"
						},
						{
							"label": "上高县",
							"position": [
								"114.932653",
								"28.234789"
							],
							"value": "360923"
						},
						{
							"label": "宜丰县",
							"position": [
								"114.787381",
								"28.388289"
							],
							"value": "360924"
						},
						{
							"label": "靖安县",
							"position": [
								"115.361744",
								"28.86054"
							],
							"value": "360925"
						},
						{
							"label": "铜鼓县",
							"position": [
								"114.37014",
								"28.520956"
							],
							"value": "360926"
						},
						{
							"label": "丰城市",
							"position": [
								"115.786005",
								"28.191584"
							],
							"value": "360981"
						},
						{
							"label": "樟树市",
							"position": [
								"115.543388",
								"28.055898"
							],
							"value": "360982"
						},
						{
							"label": "高安市",
							"position": [
								"115.381527",
								"28.420951"
							],
							"value": "360983"
						}
					]
				},
				{
					"label": "抚州市",
					"position": [
						"116.358351",
						"27.98385"
					],
					"value": "361000",
					"children": [{
							"label": "临川区",
							"position": [
								"116.361404",
								"27.981919"
							],
							"value": "361002"
						},
						{
							"label": "东乡区",
							"position": [
								"116.605341",
								"28.2325"
							],
							"value": "361003"
						},
						{
							"label": "南城县",
							"position": [
								"116.63945",
								"27.55531"
							],
							"value": "361021"
						},
						{
							"label": "黎川县",
							"position": [
								"116.91457",
								"27.292561"
							],
							"value": "361022"
						},
						{
							"label": "南丰县",
							"position": [
								"116.532994",
								"27.210132"
							],
							"value": "361023"
						},
						{
							"label": "崇仁县",
							"position": [
								"116.059109",
								"27.760907"
							],
							"value": "361024"
						},
						{
							"label": "乐安县",
							"position": [
								"115.838432",
								"27.420101"
							],
							"value": "361025"
						},
						{
							"label": "宜黄县",
							"position": [
								"116.223023",
								"27.546512"
							],
							"value": "361026"
						},
						{
							"label": "金溪县",
							"position": [
								"116.778751",
								"27.907387"
							],
							"value": "361027"
						},
						{
							"label": "资溪县",
							"position": [
								"117.066095",
								"27.70653"
							],
							"value": "361028"
						},
						{
							"label": "广昌县",
							"position": [
								"116.327291",
								"26.838426"
							],
							"value": "361030"
						}
					]
				},
				{
					"label": "上饶市",
					"position": [
						"117.971185",
						"28.44442"
					],
					"value": "361100",
					"children": [{
							"label": "信州区",
							"position": [
								"117.970522",
								"28.445378"
							],
							"value": "361102"
						},
						{
							"label": "广丰区",
							"position": [
								"118.189852",
								"28.440285"
							],
							"value": "361103"
						},
						{
							"label": "广信区",
							"position": [
								"117.90612",
								"28.453897"
							],
							"value": "361104"
						},
						{
							"label": "玉山县",
							"position": [
								"118.244408",
								"28.673479"
							],
							"value": "361123"
						},
						{
							"label": "铅山县",
							"position": [
								"117.711906",
								"28.310892"
							],
							"value": "361124"
						},
						{
							"label": "横峰县",
							"position": [
								"117.608247",
								"28.415103"
							],
							"value": "361125"
						},
						{
							"label": "弋阳县",
							"position": [
								"117.435002",
								"28.402391"
							],
							"value": "361126"
						},
						{
							"label": "余干县",
							"position": [
								"116.691072",
								"28.69173"
							],
							"value": "361127"
						},
						{
							"label": "鄱阳县",
							"position": [
								"116.673748",
								"28.993374"
							],
							"value": "361128"
						},
						{
							"label": "万年县",
							"position": [
								"117.07015",
								"28.692589"
							],
							"value": "361129"
						},
						{
							"label": "婺源县",
							"position": [
								"117.86219",
								"29.254015"
							],
							"value": "361130"
						},
						{
							"label": "德兴市",
							"position": [
								"117.578732",
								"28.945034"
							],
							"value": "361181"
						}
					]
				}
			]
		},
		{
			"label": "山东省",
			"position": [
				"117.000923",
				"36.675807"
			],
			"value": "370000",
			"children": [{
					"label": "济南市",
					"position": [
						"117.000923",
						"36.675807"
					],
					"value": "370100",
					"children": [{
							"label": "历下区",
							"position": [
								"117.03862",
								"36.664169"
							],
							"value": "370102"
						},
						{
							"label": "市中区",
							"position": [
								"116.99898",
								"36.657354"
							],
							"value": "370103"
						},
						{
							"label": "槐荫区",
							"position": [
								"116.947921",
								"36.668205"
							],
							"value": "370104"
						},
						{
							"label": "天桥区",
							"position": [
								"116.996086",
								"36.693374"
							],
							"value": "370105"
						},
						{
							"label": "历城区",
							"position": [
								"117.063744",
								"36.681744"
							],
							"value": "370112"
						},
						{
							"label": "长清区",
							"position": [
								"116.74588",
								"36.561049"
							],
							"value": "370113"
						},
						{
							"label": "章丘区",
							"position": [
								"117.54069",
								"36.71209"
							],
							"value": "370114"
						},
						{
							"label": "济阳区",
							"position": [
								"117.176035",
								"36.976771"
							],
							"value": "370115"
						},
						{
							"label": "莱芜区",
							"position": [
								"117.675808",
								"36.214395"
							],
							"value": "370116"
						},
						{
							"label": "钢城区",
							"position": [
								"117.82033",
								"36.058038"
							],
							"value": "370117"
						},
						{
							"label": "平阴县",
							"position": [
								"116.455054",
								"36.286923"
							],
							"value": "370124"
						},
						{
							"label": "商河县",
							"position": [
								"117.156369",
								"37.310544"
							],
							"value": "370126"
						}
					]
				},
				{
					"label": "青岛市",
					"position": [
						"120.355173",
						"36.082982"
					],
					"value": "370200",
					"children": [{
							"label": "市南区",
							"position": [
								"120.395966",
								"36.070892"
							],
							"value": "370202"
						},
						{
							"label": "市北区",
							"position": [
								"120.355026",
								"36.083819"
							],
							"value": "370203"
						},
						{
							"label": "黄岛区",
							"position": [
								"119.995518",
								"35.875138"
							],
							"value": "370211"
						},
						{
							"label": "崂山区",
							"position": [
								"120.467393",
								"36.102569"
							],
							"value": "370212"
						},
						{
							"label": "李沧区",
							"position": [
								"120.421236",
								"36.160023"
							],
							"value": "370213"
						},
						{
							"label": "城阳区",
							"position": [
								"120.389135",
								"36.306833"
							],
							"value": "370214"
						},
						{
							"label": "即墨区",
							"position": [
								"120.447352",
								"36.390847"
							],
							"value": "370215"
						},
						{
							"label": "胶州市",
							"position": [
								"120.006202",
								"36.285878"
							],
							"value": "370281"
						},
						{
							"label": "平度市",
							"position": [
								"119.959012",
								"36.788828"
							],
							"value": "370283"
						},
						{
							"label": "莱西市",
							"position": [
								"120.526226",
								"36.86509"
							],
							"value": "370285"
						}
					]
				},
				{
					"label": "淄博市",
					"position": [
						"118.047648",
						"36.814939"
					],
					"value": "370300",
					"children": [{
							"label": "淄川区",
							"position": [
								"117.967696",
								"36.647272"
							],
							"value": "370302"
						},
						{
							"label": "张店区",
							"position": [
								"118.053521",
								"36.807049"
							],
							"value": "370303"
						},
						{
							"label": "博山区",
							"position": [
								"117.85823",
								"36.497567"
							],
							"value": "370304"
						},
						{
							"label": "临淄区",
							"position": [
								"118.306018",
								"36.816657"
							],
							"value": "370305"
						},
						{
							"label": "周村区",
							"position": [
								"117.851036",
								"36.803699"
							],
							"value": "370306"
						},
						{
							"label": "桓台县",
							"position": [
								"118.101556",
								"36.959773"
							],
							"value": "370321"
						},
						{
							"label": "高青县",
							"position": [
								"117.829839",
								"37.169581"
							],
							"value": "370322"
						},
						{
							"label": "沂源县",
							"position": [
								"118.166161",
								"36.186282"
							],
							"value": "370323"
						}
					]
				},
				{
					"label": "枣庄市",
					"position": [
						"117.557964",
						"34.856424"
					],
					"value": "370400",
					"children": [{
							"label": "市中区",
							"position": [
								"117.557281",
								"34.856651"
							],
							"value": "370402"
						},
						{
							"label": "薛城区",
							"position": [
								"117.265293",
								"34.79789"
							],
							"value": "370403"
						},
						{
							"label": "峄城区",
							"position": [
								"117.586316",
								"34.767713"
							],
							"value": "370404"
						},
						{
							"label": "台儿庄区",
							"position": [
								"117.734747",
								"34.564815"
							],
							"value": "370405"
						},
						{
							"label": "山亭区",
							"position": [
								"117.458968",
								"35.096077"
							],
							"value": "370406"
						},
						{
							"label": "滕州市",
							"position": [
								"117.162098",
								"35.088498"
							],
							"value": "370481"
						}
					]
				},
				{
					"label": "东营市",
					"position": [
						"118.66471",
						"37.434564"
					],
					"value": "370500",
					"children": [{
							"label": "东营区",
							"position": [
								"118.507543",
								"37.461567"
							],
							"value": "370502"
						},
						{
							"label": "河口区",
							"position": [
								"118.529613",
								"37.886015"
							],
							"value": "370503"
						},
						{
							"label": "垦利区",
							"position": [
								"118.551314",
								"37.588679"
							],
							"value": "370505"
						},
						{
							"label": "利津县",
							"position": [
								"118.248854",
								"37.493365"
							],
							"value": "370522"
						},
						{
							"label": "广饶县",
							"position": [
								"118.407522",
								"37.05161"
							],
							"value": "370523"
						}
					]
				},
				{
					"label": "烟台市",
					"position": [
						"121.391382",
						"37.539297"
					],
					"value": "370600",
					"children": [{
							"label": "芝罘区",
							"position": [
								"121.385877",
								"37.540925"
							],
							"value": "370602"
						},
						{
							"label": "福山区",
							"position": [
								"121.264741",
								"37.496875"
							],
							"value": "370611"
						},
						{
							"label": "牟平区",
							"position": [
								"121.60151",
								"37.388356"
							],
							"value": "370612"
						},
						{
							"label": "莱山区",
							"position": [
								"121.448866",
								"37.473549"
							],
							"value": "370613"
						},
						{
							"label": "蓬莱区",
							"position": [
								"120.759074",
								"37.811045"
							],
							"value": "370614"
						},
						{
							"label": "龙口市",
							"position": [
								"120.528328",
								"37.648446"
							],
							"value": "370681"
						},
						{
							"label": "莱阳市",
							"position": [
								"120.711151",
								"36.977037"
							],
							"value": "370682"
						},
						{
							"label": "莱州市",
							"position": [
								"119.942135",
								"37.182725"
							],
							"value": "370683"
						},
						{
							"label": "招远市",
							"position": [
								"120.403142",
								"37.364919"
							],
							"value": "370685"
						},
						{
							"label": "栖霞市",
							"position": [
								"120.834097",
								"37.305854"
							],
							"value": "370686"
						},
						{
							"label": "海阳市",
							"position": [
								"121.168392",
								"36.780657"
							],
							"value": "370687"
						}
					]
				},
				{
					"label": "潍坊市",
					"position": [
						"119.107078",
						"36.70925"
					],
					"value": "370700",
					"children": [{
							"label": "潍城区",
							"position": [
								"119.103784",
								"36.710062"
							],
							"value": "370702"
						},
						{
							"label": "寒亭区",
							"position": [
								"119.207866",
								"36.772103"
							],
							"value": "370703"
						},
						{
							"label": "坊子区",
							"position": [
								"119.166326",
								"36.654616"
							],
							"value": "370704"
						},
						{
							"label": "奎文区",
							"position": [
								"119.137357",
								"36.709494"
							],
							"value": "370705"
						},
						{
							"label": "临朐县",
							"position": [
								"118.539876",
								"36.516371"
							],
							"value": "370724"
						},
						{
							"label": "昌乐县",
							"position": [
								"118.839995",
								"36.703253"
							],
							"value": "370725"
						},
						{
							"label": "青州市",
							"position": [
								"118.484693",
								"36.697855"
							],
							"value": "370781"
						},
						{
							"label": "诸城市",
							"position": [
								"119.403182",
								"35.997093"
							],
							"value": "370782"
						},
						{
							"label": "寿光市",
							"position": [
								"118.736451",
								"36.874411"
							],
							"value": "370783"
						},
						{
							"label": "安丘市",
							"position": [
								"119.206886",
								"36.427417"
							],
							"value": "370784"
						},
						{
							"label": "高密市",
							"position": [
								"119.757033",
								"36.37754"
							],
							"value": "370785"
						},
						{
							"label": "昌邑市",
							"position": [
								"119.394502",
								"36.854937"
							],
							"value": "370786"
						}
					]
				},
				{
					"label": "济宁市",
					"position": [
						"116.587245",
						"35.415393"
					],
					"value": "370800",
					"children": [{
							"label": "任城区",
							"position": [
								"116.595261",
								"35.414828"
							],
							"value": "370811"
						},
						{
							"label": "兖州区",
							"position": [
								"116.828996",
								"35.556445"
							],
							"value": "370812"
						},
						{
							"label": "微山县",
							"position": [
								"117.12861",
								"34.809525"
							],
							"value": "370826"
						},
						{
							"label": "鱼台县",
							"position": [
								"116.650023",
								"34.997706"
							],
							"value": "370827"
						},
						{
							"label": "金乡县",
							"position": [
								"116.310364",
								"35.06977"
							],
							"value": "370828"
						},
						{
							"label": "嘉祥县",
							"position": [
								"116.342885",
								"35.398098"
							],
							"value": "370829"
						},
						{
							"label": "汶上县",
							"position": [
								"116.487146",
								"35.721746"
							],
							"value": "370830"
						},
						{
							"label": "泗水县",
							"position": [
								"117.273605",
								"35.653216"
							],
							"value": "370831"
						},
						{
							"label": "梁山县",
							"position": [
								"116.08963",
								"35.801843"
							],
							"value": "370832"
						},
						{
							"label": "曲阜市",
							"position": [
								"116.991885",
								"35.592788"
							],
							"value": "370881"
						},
						{
							"label": "邹城市",
							"position": [
								"116.96673",
								"35.405259"
							],
							"value": "370883"
						}
					]
				},
				{
					"label": "泰安市",
					"position": [
						"117.129063",
						"36.194968"
					],
					"value": "370900",
					"children": [{
							"label": "泰山区",
							"position": [
								"117.129984",
								"36.189313"
							],
							"value": "370902"
						},
						{
							"label": "岱岳区",
							"position": [
								"117.04353",
								"36.1841"
							],
							"value": "370911"
						},
						{
							"label": "宁阳县",
							"position": [
								"116.799297",
								"35.76754"
							],
							"value": "370921"
						},
						{
							"label": "东平县",
							"position": [
								"116.461052",
								"35.930467"
							],
							"value": "370923"
						},
						{
							"label": "新泰市",
							"position": [
								"117.766092",
								"35.910387"
							],
							"value": "370982"
						},
						{
							"label": "肥城市",
							"position": [
								"116.763703",
								"36.1856"
							],
							"value": "370983"
						}
					]
				},
				{
					"label": "威海市",
					"position": [
						"122.116394",
						"37.509691"
					],
					"value": "371000",
					"children": [{
							"label": "环翠区",
							"position": [
								"122.116189",
								"37.510754"
							],
							"value": "371002"
						},
						{
							"label": "文登区",
							"position": [
								"122.057139",
								"37.196211"
							],
							"value": "371003"
						},
						{
							"label": "荣成市",
							"position": [
								"122.422896",
								"37.160134"
							],
							"value": "371082"
						},
						{
							"label": "乳山市",
							"position": [
								"121.536346",
								"36.919622"
							],
							"value": "371083"
						}
					]
				},
				{
					"label": "日照市",
					"position": [
						"119.461208",
						"35.428588"
					],
					"value": "371100",
					"children": [{
							"label": "东港区",
							"position": [
								"119.457703",
								"35.426152"
							],
							"value": "371102"
						},
						{
							"label": "岚山区",
							"position": [
								"119.315844",
								"35.119794"
							],
							"value": "371103"
						},
						{
							"label": "五莲县",
							"position": [
								"119.206745",
								"35.751936"
							],
							"value": "371121"
						},
						{
							"label": "莒县",
							"position": [
								"118.832859",
								"35.588115"
							],
							"value": "371122"
						}
					]
				},
				{
					"label": "临沂市",
					"position": [
						"118.326443",
						"35.065282"
					],
					"value": "371300",
					"children": [{
							"label": "兰山区",
							"position": [
								"118.327667",
								"35.061631"
							],
							"value": "371302"
						},
						{
							"label": "罗庄区",
							"position": [
								"118.284795",
								"34.997204"
							],
							"value": "371311"
						},
						{
							"label": "河东区",
							"position": [
								"118.398296",
								"35.085004"
							],
							"value": "371312"
						},
						{
							"label": "沂南县",
							"position": [
								"118.455395",
								"35.547002"
							],
							"value": "371321"
						},
						{
							"label": "郯城县",
							"position": [
								"118.342963",
								"34.614741"
							],
							"value": "371322"
						},
						{
							"label": "沂水县",
							"position": [
								"118.634543",
								"35.787029"
							],
							"value": "371323"
						},
						{
							"label": "兰陵县",
							"position": [
								"118.049968",
								"34.855573"
							],
							"value": "371324"
						},
						{
							"label": "费县",
							"position": [
								"117.968869",
								"35.269174"
							],
							"value": "371325"
						},
						{
							"label": "平邑县",
							"position": [
								"117.631884",
								"35.511519"
							],
							"value": "371326"
						},
						{
							"label": "莒南县",
							"position": [
								"118.838322",
								"35.175911"
							],
							"value": "371327"
						},
						{
							"label": "蒙阴县",
							"position": [
								"117.943271",
								"35.712435"
							],
							"value": "371328"
						},
						{
							"label": "临沭县",
							"position": [
								"118.648379",
								"34.917062"
							],
							"value": "371329"
						}
					]
				},
				{
					"label": "德州市",
					"position": [
						"116.307428",
						"37.453968"
					],
					"value": "371400",
					"children": [{
							"label": "德城区",
							"position": [
								"116.307076",
								"37.453923"
							],
							"value": "371402"
						},
						{
							"label": "陵城区",
							"position": [
								"116.574929",
								"37.332848"
							],
							"value": "371403"
						},
						{
							"label": "宁津县",
							"position": [
								"116.79372",
								"37.649619"
							],
							"value": "371422"
						},
						{
							"label": "庆云县",
							"position": [
								"117.390507",
								"37.777724"
							],
							"value": "371423"
						},
						{
							"label": "临邑县",
							"position": [
								"116.867028",
								"37.192044"
							],
							"value": "371424"
						},
						{
							"label": "齐河县",
							"position": [
								"116.758394",
								"36.795497"
							],
							"value": "371425"
						},
						{
							"label": "平原县",
							"position": [
								"116.433904",
								"37.164465"
							],
							"value": "371426"
						},
						{
							"label": "夏津县",
							"position": [
								"116.003816",
								"36.950501"
							],
							"value": "371427"
						},
						{
							"label": "武城县",
							"position": [
								"116.078627",
								"37.209527"
							],
							"value": "371428"
						},
						{
							"label": "乐陵市",
							"position": [
								"117.216657",
								"37.729115"
							],
							"value": "371481"
						},
						{
							"label": "禹城市",
							"position": [
								"116.642554",
								"36.934485"
							],
							"value": "371482"
						}
					]
				},
				{
					"label": "聊城市",
					"position": [
						"115.980367",
						"36.456013"
					],
					"value": "371500",
					"children": [{
							"label": "东昌府区",
							"position": [
								"115.980023",
								"36.45606"
							],
							"value": "371502"
						},
						{
							"label": "茌平区",
							"position": [
								"116.25335",
								"36.591934"
							],
							"value": "371503"
						},
						{
							"label": "阳谷县",
							"position": [
								"115.784287",
								"36.113708"
							],
							"value": "371521"
						},
						{
							"label": "莘县",
							"position": [
								"115.667291",
								"36.237597"
							],
							"value": "371522"
						},
						{
							"label": "东阿县",
							"position": [
								"116.248855",
								"36.336004"
							],
							"value": "371524"
						},
						{
							"label": "冠县",
							"position": [
								"115.444808",
								"36.483753"
							],
							"value": "371525"
						},
						{
							"label": "高唐县",
							"position": [
								"116.229662",
								"36.859755"
							],
							"value": "371526"
						},
						{
							"label": "临清市",
							"position": [
								"115.713462",
								"36.842598"
							],
							"value": "371581"
						}
					]
				},
				{
					"label": "滨州市",
					"position": [
						"118.016974",
						"37.383542"
					],
					"value": "371600",
					"children": [{
							"label": "滨城区",
							"position": [
								"118.020149",
								"37.384842"
							],
							"value": "371602"
						},
						{
							"label": "沾化区",
							"position": [
								"118.129902",
								"37.698456"
							],
							"value": "371603"
						},
						{
							"label": "惠民县",
							"position": [
								"117.508941",
								"37.483876"
							],
							"value": "371621"
						},
						{
							"label": "阳信县",
							"position": [
								"117.581326",
								"37.640492"
							],
							"value": "371622"
						},
						{
							"label": "无棣县",
							"position": [
								"117.616325",
								"37.740848"
							],
							"value": "371623"
						},
						{
							"label": "博兴县",
							"position": [
								"118.123096",
								"37.147002"
							],
							"value": "371625"
						},
						{
							"label": "邹平市",
							"position": [
								"117.736807",
								"36.87803"
							],
							"value": "371681"
						}
					]
				},
				{
					"label": "菏泽市",
					"position": [
						"115.469381",
						"35.246531"
					],
					"value": "371700",
					"children": [{
							"label": "牡丹区",
							"position": [
								"115.470946",
								"35.24311"
							],
							"value": "371702"
						},
						{
							"label": "定陶区",
							"position": [
								"115.569601",
								"35.072701"
							],
							"value": "371703"
						},
						{
							"label": "曹县",
							"position": [
								"115.549482",
								"34.823253"
							],
							"value": "371721"
						},
						{
							"label": "单县",
							"position": [
								"116.08262",
								"34.790851"
							],
							"value": "371722"
						},
						{
							"label": "成武县",
							"position": [
								"115.897349",
								"34.947366"
							],
							"value": "371723"
						},
						{
							"label": "巨野县",
							"position": [
								"116.089341",
								"35.390999"
							],
							"value": "371724"
						},
						{
							"label": "郓城县",
							"position": [
								"115.93885",
								"35.594773"
							],
							"value": "371725"
						},
						{
							"label": "鄄城县",
							"position": [
								"115.51434",
								"35.560257"
							],
							"value": "371726"
						},
						{
							"label": "东明县",
							"position": [
								"115.098412",
								"35.289637"
							],
							"value": "371728"
						}
					]
				}
			]
		},
		{
			"label": "河南省",
			"position": [
				"113.665412",
				"34.757975"
			],
			"value": "410000",
			"children": [{
					"label": "郑州市",
					"position": [
						"113.665412",
						"34.757975"
					],
					"value": "410100",
					"children": [{
							"label": "中原区",
							"position": [
								"113.611576",
								"34.748286"
							],
							"value": "410102"
						},
						{
							"label": "二七区",
							"position": [
								"113.645422",
								"34.730936"
							],
							"value": "410103"
						},
						{
							"label": "管城回族区",
							"position": [
								"113.685313",
								"34.746453"
							],
							"value": "410104"
						},
						{
							"label": "金水区",
							"position": [
								"113.686037",
								"34.775838"
							],
							"value": "410105"
						},
						{
							"label": "上街区",
							"position": [
								"113.298282",
								"34.808689"
							],
							"value": "410106"
						},
						{
							"label": "惠济区",
							"position": [
								"113.61836",
								"34.828591"
							],
							"value": "410108"
						},
						{
							"label": "中牟县",
							"position": [
								"114.022521",
								"34.721976"
							],
							"value": "410122"
						},
						{
							"label": "巩义市",
							"position": [
								"112.98283",
								"34.75218"
							],
							"value": "410181"
						},
						{
							"label": "荥阳市",
							"position": [
								"113.391523",
								"34.789077"
							],
							"value": "410182"
						},
						{
							"label": "新密市",
							"position": [
								"113.380616",
								"34.537846"
							],
							"value": "410183"
						},
						{
							"label": "新郑市",
							"position": [
								"113.73967",
								"34.394219"
							],
							"value": "410184"
						},
						{
							"label": "登封市",
							"position": [
								"113.037768",
								"34.459939"
							],
							"value": "410185"
						}
					]
				},
				{
					"label": "开封市",
					"position": [
						"114.341447",
						"34.797049"
					],
					"value": "410200",
					"children": [{
							"label": "龙亭区",
							"position": [
								"114.353348",
								"34.799833"
							],
							"value": "410202"
						},
						{
							"label": "顺河回族区",
							"position": [
								"114.364875",
								"34.800459"
							],
							"value": "410203"
						},
						{
							"label": "鼓楼区",
							"position": [
								"114.3485",
								"34.792383"
							],
							"value": "410204"
						},
						{
							"label": "禹王台区",
							"position": [
								"114.350246",
								"34.779727"
							],
							"value": "410205"
						},
						{
							"label": "祥符区",
							"position": [
								"114.437622",
								"34.756476"
							],
							"value": "410212"
						},
						{
							"label": "杞县",
							"position": [
								"114.770472",
								"34.554585"
							],
							"value": "410221"
						},
						{
							"label": "通许县",
							"position": [
								"114.467734",
								"34.477302"
							],
							"value": "410222"
						},
						{
							"label": "尉氏县",
							"position": [
								"114.193927",
								"34.412256"
							],
							"value": "410223"
						},
						{
							"label": "兰考县",
							"position": [
								"114.820572",
								"34.829899"
							],
							"value": "410225"
						}
					]
				},
				{
					"label": "洛阳市",
					"position": [
						"112.434468",
						"34.663041"
					],
					"value": "410300",
					"children": [{
							"label": "老城区",
							"position": [
								"112.477298",
								"34.682945"
							],
							"value": "410302"
						},
						{
							"label": "西工区",
							"position": [
								"112.443232",
								"34.667847"
							],
							"value": "410303"
						},
						{
							"label": "瀍河回族区",
							"position": [
								"112.491625",
								"34.684738"
							],
							"value": "410304"
						},
						{
							"label": "涧西区",
							"position": [
								"112.399243",
								"34.654251"
							],
							"value": "410305"
						},
						{
							"label": "吉利区",
							"position": [
								"112.584796",
								"34.899093"
							],
							"value": "410306"
						},
						{
							"label": "洛龙区",
							"position": [
								"112.456634",
								"34.618557"
							],
							"value": "410311"
						},
						{
							"label": "孟津县",
							"position": [
								"112.443892",
								"34.826485"
							],
							"value": "410322"
						},
						{
							"label": "新安县",
							"position": [
								"112.141403",
								"34.728679"
							],
							"value": "410323"
						},
						{
							"label": "栾川县",
							"position": [
								"111.618386",
								"33.783195"
							],
							"value": "410324"
						},
						{
							"label": "嵩县",
							"position": [
								"112.087765",
								"34.131563"
							],
							"value": "410325"
						},
						{
							"label": "汝阳县",
							"position": [
								"112.473789",
								"34.15323"
							],
							"value": "410326"
						},
						{
							"label": "宜阳县",
							"position": [
								"112.179989",
								"34.516478"
							],
							"value": "410327"
						},
						{
							"label": "洛宁县",
							"position": [
								"111.655399",
								"34.387179"
							],
							"value": "410328"
						},
						{
							"label": "伊川县",
							"position": [
								"112.429384",
								"34.423416"
							],
							"value": "410329"
						},
						{
							"label": "偃师市",
							"position": [
								"112.787739",
								"34.723042"
							],
							"value": "410381"
						}
					]
				},
				{
					"label": "平顶山市",
					"position": [
						"113.307718",
						"33.735241"
					],
					"value": "410400",
					"children": [{
							"label": "新华区",
							"position": [
								"113.299061",
								"33.737579"
							],
							"value": "410402"
						},
						{
							"label": "卫东区",
							"position": [
								"113.310327",
								"33.739285"
							],
							"value": "410403"
						},
						{
							"label": "石龙区",
							"position": [
								"112.889885",
								"33.901538"
							],
							"value": "410404"
						},
						{
							"label": "湛河区",
							"position": [
								"113.320873",
								"33.725681"
							],
							"value": "410411"
						},
						{
							"label": "宝丰县",
							"position": [
								"113.066812",
								"33.866359"
							],
							"value": "410421"
						},
						{
							"label": "叶县",
							"position": [
								"113.358298",
								"33.621252"
							],
							"value": "410422"
						},
						{
							"label": "鲁山县",
							"position": [
								"112.906703",
								"33.740325"
							],
							"value": "410423"
						},
						{
							"label": "郏县",
							"position": [
								"113.220451",
								"33.971993"
							],
							"value": "410425"
						},
						{
							"label": "舞钢市",
							"position": [
								"113.52625",
								"33.302082"
							],
							"value": "410481"
						},
						{
							"label": "汝州市",
							"position": [
								"112.845336",
								"34.167408"
							],
							"value": "410482"
						}
					]
				},
				{
					"label": "安阳市",
					"position": [
						"114.352482",
						"36.103442"
					],
					"value": "410500",
					"children": [{
							"label": "文峰区",
							"position": [
								"114.352562",
								"36.098101"
							],
							"value": "410502"
						},
						{
							"label": "北关区",
							"position": [
								"114.352646",
								"36.10978"
							],
							"value": "410503"
						},
						{
							"label": "殷都区",
							"position": [
								"114.300098",
								"36.108974"
							],
							"value": "410505"
						},
						{
							"label": "龙安区",
							"position": [
								"114.323522",
								"36.095568"
							],
							"value": "410506"
						},
						{
							"label": "安阳县",
							"position": [
								"114.130207",
								"36.130585"
							],
							"value": "410522"
						},
						{
							"label": "汤阴县",
							"position": [
								"114.362357",
								"35.922349"
							],
							"value": "410523"
						},
						{
							"label": "滑县",
							"position": [
								"114.524",
								"35.574628"
							],
							"value": "410526"
						},
						{
							"label": "内黄县",
							"position": [
								"114.904582",
								"35.953702"
							],
							"value": "410527"
						},
						{
							"label": "林州市",
							"position": [
								"113.823767",
								"36.063403"
							],
							"value": "410581"
						}
					]
				},
				{
					"label": "鹤壁市",
					"position": [
						"114.295444",
						"35.748236"
					],
					"value": "410600",
					"children": [{
							"label": "鹤山区",
							"position": [
								"114.166551",
								"35.936128"
							],
							"value": "410602"
						},
						{
							"label": "山城区",
							"position": [
								"114.184202",
								"35.896058"
							],
							"value": "410603"
						},
						{
							"label": "淇滨区",
							"position": [
								"114.293917",
								"35.748382"
							],
							"value": "410611"
						},
						{
							"label": "浚县",
							"position": [
								"114.550162",
								"35.671282"
							],
							"value": "410621"
						},
						{
							"label": "淇县",
							"position": [
								"114.200379",
								"35.609478"
							],
							"value": "410622"
						}
					]
				},
				{
					"label": "新乡市",
					"position": [
						"113.883991",
						"35.302616"
					],
					"value": "410700",
					"children": [{
							"label": "红旗区",
							"position": [
								"113.878158",
								"35.302684"
							],
							"value": "410702"
						},
						{
							"label": "卫滨区",
							"position": [
								"113.866065",
								"35.304905"
							],
							"value": "410703"
						},
						{
							"label": "凤泉区",
							"position": [
								"113.906712",
								"35.379855"
							],
							"value": "410704"
						},
						{
							"label": "牧野区",
							"position": [
								"113.89716",
								"35.312974"
							],
							"value": "410711"
						},
						{
							"label": "新乡县",
							"position": [
								"113.806186",
								"35.190021"
							],
							"value": "410721"
						},
						{
							"label": "获嘉县",
							"position": [
								"113.657249",
								"35.261685"
							],
							"value": "410724"
						},
						{
							"label": "原阳县",
							"position": [
								"113.965966",
								"35.054001"
							],
							"value": "410725"
						},
						{
							"label": "延津县",
							"position": [
								"114.200982",
								"35.149515"
							],
							"value": "410726"
						},
						{
							"label": "封丘县",
							"position": [
								"114.423405",
								"35.04057"
							],
							"value": "410727"
						},
						{
							"label": "卫辉市",
							"position": [
								"114.065855",
								"35.404295"
							],
							"value": "410781"
						},
						{
							"label": "辉县市",
							"position": [
								"113.802518",
								"35.461318"
							],
							"value": "410782"
						},
						{
							"label": "长垣市",
							"position": [
								"114.673807",
								"35.19615"
							],
							"value": "410783"
						}
					]
				},
				{
					"label": "焦作市",
					"position": [
						"113.238266",
						"35.23904"
					],
					"value": "410800",
					"children": [{
							"label": "解放区",
							"position": [
								"113.226126",
								"35.241353"
							],
							"value": "410802"
						},
						{
							"label": "中站区",
							"position": [
								"113.175485",
								"35.236145"
							],
							"value": "410803"
						},
						{
							"label": "马村区",
							"position": [
								"113.321703",
								"35.265453"
							],
							"value": "410804"
						},
						{
							"label": "山阳区",
							"position": [
								"113.26766",
								"35.21476"
							],
							"value": "410811"
						},
						{
							"label": "修武县",
							"position": [
								"113.447465",
								"35.229923"
							],
							"value": "410821"
						},
						{
							"label": "博爱县",
							"position": [
								"113.069313",
								"35.170351"
							],
							"value": "410822"
						},
						{
							"label": "武陟县",
							"position": [
								"113.408334",
								"35.09885"
							],
							"value": "410823"
						},
						{
							"label": "温县",
							"position": [
								"113.079118",
								"34.941233"
							],
							"value": "410825"
						},
						{
							"label": "沁阳市",
							"position": [
								"112.934538",
								"35.08901"
							],
							"value": "410882"
						},
						{
							"label": "孟州市",
							"position": [
								"112.78708",
								"34.90963"
							],
							"value": "410883"
						}
					]
				},
				{
					"label": "濮阳市",
					"position": [
						"115.041299",
						"35.768234"
					],
					"value": "410900",
					"children": [{
							"label": "华龙区",
							"position": [
								"115.03184",
								"35.760473"
							],
							"value": "410902"
						},
						{
							"label": "清丰县",
							"position": [
								"115.107287",
								"35.902413"
							],
							"value": "410922"
						},
						{
							"label": "南乐县",
							"position": [
								"115.204336",
								"36.075204"
							],
							"value": "410923"
						},
						{
							"label": "范县",
							"position": [
								"115.504212",
								"35.851977"
							],
							"value": "410926"
						},
						{
							"label": "台前县",
							"position": [
								"115.855681",
								"35.996474"
							],
							"value": "410927"
						},
						{
							"label": "濮阳县",
							"position": [
								"115.023844",
								"35.710349"
							],
							"value": "410928"
						}
					]
				},
				{
					"label": "许昌市",
					"position": [
						"113.826063",
						"34.022956"
					],
					"value": "411000",
					"children": [{
							"label": "魏都区",
							"position": [
								"113.828307",
								"34.02711"
							],
							"value": "411002"
						},
						{
							"label": "建安区",
							"position": [
								"113.842898",
								"34.005018"
							],
							"value": "411003"
						},
						{
							"label": "鄢陵县",
							"position": [
								"114.188507",
								"34.100502"
							],
							"value": "411024"
						},
						{
							"label": "襄城县",
							"position": [
								"113.493166",
								"33.855943"
							],
							"value": "411025"
						},
						{
							"label": "禹州市",
							"position": [
								"113.471316",
								"34.154403"
							],
							"value": "411081"
						},
						{
							"label": "长葛市",
							"position": [
								"113.768912",
								"34.219257"
							],
							"value": "411082"
						}
					]
				},
				{
					"label": "漯河市",
					"position": [
						"114.026405",
						"33.575855"
					],
					"value": "411100",
					"children": [{
							"label": "源汇区",
							"position": [
								"114.017948",
								"33.565441"
							],
							"value": "411102"
						},
						{
							"label": "郾城区",
							"position": [
								"114.016813",
								"33.588897"
							],
							"value": "411103"
						},
						{
							"label": "召陵区",
							"position": [
								"114.051686",
								"33.567555"
							],
							"value": "411104"
						},
						{
							"label": "舞阳县",
							"position": [
								"113.610565",
								"33.436278"
							],
							"value": "411121"
						},
						{
							"label": "临颍县",
							"position": [
								"113.938891",
								"33.80609"
							],
							"value": "411122"
						}
					]
				},
				{
					"label": "三门峡市",
					"position": [
						"111.194099",
						"34.777338"
					],
					"value": "411200",
					"children": [{
							"label": "湖滨区",
							"position": [
								"111.19487",
								"34.77812"
							],
							"value": "411202"
						},
						{
							"label": "陕州区",
							"position": [
								"111.103851",
								"34.720244"
							],
							"value": "411203"
						},
						{
							"label": "渑池县",
							"position": [
								"111.762992",
								"34.763487"
							],
							"value": "411221"
						},
						{
							"label": "卢氏县",
							"position": [
								"111.052649",
								"34.053995"
							],
							"value": "411224"
						},
						{
							"label": "义马市",
							"position": [
								"111.869417",
								"34.746868"
							],
							"value": "411281"
						},
						{
							"label": "灵宝市",
							"position": [
								"110.88577",
								"34.521264"
							],
							"value": "411282"
						}
					]
				},
				{
					"label": "南阳市",
					"position": [
						"112.540918",
						"32.999082"
					],
					"value": "411300",
					"children": [{
							"label": "宛城区",
							"position": [
								"112.544591",
								"32.994857"
							],
							"value": "411302"
						},
						{
							"label": "卧龙区",
							"position": [
								"112.528789",
								"32.989877"
							],
							"value": "411303"
						},
						{
							"label": "南召县",
							"position": [
								"112.435583",
								"33.488617"
							],
							"value": "411321"
						},
						{
							"label": "方城县",
							"position": [
								"113.010933",
								"33.255138"
							],
							"value": "411322"
						},
						{
							"label": "西峡县",
							"position": [
								"111.485772",
								"33.302981"
							],
							"value": "411323"
						},
						{
							"label": "镇平县",
							"position": [
								"112.232722",
								"33.036651"
							],
							"value": "411324"
						},
						{
							"label": "内乡县",
							"position": [
								"111.843801",
								"33.046358"
							],
							"value": "411325"
						},
						{
							"label": "淅川县",
							"position": [
								"111.489026",
								"33.136106"
							],
							"value": "411326"
						},
						{
							"label": "社旗县",
							"position": [
								"112.938279",
								"33.056126"
							],
							"value": "411327"
						},
						{
							"label": "唐河县",
							"position": [
								"112.838492",
								"32.687892"
							],
							"value": "411328"
						},
						{
							"label": "新野县",
							"position": [
								"112.365624",
								"32.524006"
							],
							"value": "411329"
						},
						{
							"label": "桐柏县",
							"position": [
								"113.406059",
								"32.367153"
							],
							"value": "411330"
						},
						{
							"label": "邓州市",
							"position": [
								"112.092716",
								"32.681642"
							],
							"value": "411381"
						}
					]
				},
				{
					"label": "商丘市",
					"position": [
						"115.650497",
						"34.437054"
					],
					"value": "411400",
					"children": [{
							"label": "梁园区",
							"position": [
								"115.65459",
								"34.436553"
							],
							"value": "411402"
						},
						{
							"label": "睢阳区",
							"position": [
								"115.653813",
								"34.390536"
							],
							"value": "411403"
						},
						{
							"label": "民权县",
							"position": [
								"115.148146",
								"34.648455"
							],
							"value": "411421"
						},
						{
							"label": "睢县",
							"position": [
								"115.070109",
								"34.428433"
							],
							"value": "411422"
						},
						{
							"label": "宁陵县",
							"position": [
								"115.320055",
								"34.449299"
							],
							"value": "411423"
						},
						{
							"label": "柘城县",
							"position": [
								"115.307433",
								"34.075277"
							],
							"value": "411424"
						},
						{
							"label": "虞城县",
							"position": [
								"115.863811",
								"34.399634"
							],
							"value": "411425"
						},
						{
							"label": "夏邑县",
							"position": [
								"116.13989",
								"34.240894"
							],
							"value": "411426"
						},
						{
							"label": "永城市",
							"position": [
								"116.449672",
								"33.931318"
							],
							"value": "411481"
						}
					]
				},
				{
					"label": "信阳市",
					"position": [
						"114.075031",
						"32.123274"
					],
					"value": "411500",
					"children": [{
							"label": "浉河区",
							"position": [
								"114.075031",
								"32.123274"
							],
							"value": "411502"
						},
						{
							"label": "平桥区",
							"position": [
								"114.126027",
								"32.098395"
							],
							"value": "411503"
						},
						{
							"label": "罗山县",
							"position": [
								"114.533414",
								"32.203206"
							],
							"value": "411521"
						},
						{
							"label": "光山县",
							"position": [
								"114.903577",
								"32.010398"
							],
							"value": "411522"
						},
						{
							"label": "新县",
							"position": [
								"114.87705",
								"31.63515"
							],
							"value": "411523"
						},
						{
							"label": "商城县",
							"position": [
								"115.406297",
								"31.799982"
							],
							"value": "411524"
						},
						{
							"label": "固始县",
							"position": [
								"115.667328",
								"32.183074"
							],
							"value": "411525"
						},
						{
							"label": "潢川县",
							"position": [
								"115.050123",
								"32.134024"
							],
							"value": "411526"
						},
						{
							"label": "淮滨县",
							"position": [
								"115.415451",
								"32.452639"
							],
							"value": "411527"
						},
						{
							"label": "息县",
							"position": [
								"114.740713",
								"32.344744"
							],
							"value": "411528"
						}
					]
				},
				{
					"label": "周口市",
					"position": [
						"114.649653",
						"33.620357"
					],
					"value": "411600",
					"children": [{
							"label": "川汇区",
							"position": [
								"114.652136",
								"33.614836"
							],
							"value": "411602"
						},
						{
							"label": "淮阳区",
							"position": [
								"114.870166",
								"33.732547"
							],
							"value": "411603"
						},
						{
							"label": "扶沟县",
							"position": [
								"114.392008",
								"34.054061"
							],
							"value": "411621"
						},
						{
							"label": "西华县",
							"position": [
								"114.530067",
								"33.784378"
							],
							"value": "411622"
						},
						{
							"label": "商水县",
							"position": [
								"114.60927",
								"33.543845"
							],
							"value": "411623"
						},
						{
							"label": "沈丘县",
							"position": [
								"115.078375",
								"33.395514"
							],
							"value": "411624"
						},
						{
							"label": "郸城县",
							"position": [
								"115.189",
								"33.643852"
							],
							"value": "411625"
						},
						{
							"label": "太康县",
							"position": [
								"114.853834",
								"34.065312"
							],
							"value": "411627"
						},
						{
							"label": "鹿邑县",
							"position": [
								"115.486386",
								"33.861067"
							],
							"value": "411628"
						},
						{
							"label": "项城市",
							"position": [
								"114.899521",
								"33.443085"
							],
							"value": "411681"
						}
					]
				},
				{
					"label": "驻马店市",
					"position": [
						"114.024736",
						"32.980169"
					],
					"value": "411700",
					"children": [{
							"label": "驿城区",
							"position": [
								"114.029149",
								"32.977559"
							],
							"value": "411702"
						},
						{
							"label": "西平县",
							"position": [
								"114.026864",
								"33.382315"
							],
							"value": "411721"
						},
						{
							"label": "上蔡县",
							"position": [
								"114.266892",
								"33.264719"
							],
							"value": "411722"
						},
						{
							"label": "平舆县",
							"position": [
								"114.637105",
								"32.955626"
							],
							"value": "411723"
						},
						{
							"label": "正阳县",
							"position": [
								"114.38948",
								"32.601826"
							],
							"value": "411724"
						},
						{
							"label": "确山县",
							"position": [
								"114.026679",
								"32.801538"
							],
							"value": "411725"
						},
						{
							"label": "泌阳县",
							"position": [
								"113.32605",
								"32.725129"
							],
							"value": "411726"
						},
						{
							"label": "汝南县",
							"position": [
								"114.359495",
								"33.004535"
							],
							"value": "411727"
						},
						{
							"label": "遂平县",
							"position": [
								"114.00371",
								"33.14698"
							],
							"value": "411728"
						},
						{
							"label": "新蔡县",
							"position": [
								"114.975246",
								"32.749948"
							],
							"value": "411729"
						}
					]
				},
				{
					"label": "济源市",
					"position": [
						"112.590047",
						"35.090378"
					],
					"value": "419001",
					"children": [{
							"label": "济源市坡头镇",
							"position": [
								"112.538",
								"34.9308"
							],
							"value": "419001"
						},
						{
							"label": "济源市梨林镇",
							"position": [
								"112.753",
								"35.0882"
							],
							"value": "419001"
						},
						{
							"label": "济源市思礼镇",
							"position": [
								"112.388",
								"35.2103"
							],
							"value": "419001"
						},
						{
							"label": "济源市大峪镇",
							"position": [
								"112.338",
								"34.9398"
							],
							"value": "419001"
						},
						{
							"label": "济源市五龙口镇",
							"position": [
								"112.761",
								"35.1956"
							],
							"value": "419001"
						},
						{
							"label": "济源市王屋镇",
							"position": [
								"112.169",
								"35.1244"
							],
							"value": "419001"
						},
						{
							"label": "济源市轵城镇",
							"position": [
								"112.622",
								"35.0625"
							],
							"value": "419001"
						},
						{
							"label": "济源市玉泉街道",
							"position": [
								"112.624",
								"35.1189"
							],
							"value": "419001"
						},
						{
							"label": "济源市济水街道",
							"position": [
								"112.595",
								"35.0944"
							],
							"value": "419001"
						},
						{
							"label": "济源市沁园街道",
							"position": [
								"112.593",
								"35.0822"
							],
							"value": "419001"
						},
						{
							"label": "济源市下冶镇",
							"position": [
								"112.212",
								"35.1131"
							],
							"value": "419001"
						},
						{
							"label": "济源市天坛街道",
							"position": [
								"112.567",
								"35.1229"
							],
							"value": "419001"
						},
						{
							"label": "济源市克井镇",
							"position": [
								"112.635",
								"35.255"
							],
							"value": "419001"
						},
						{
							"label": "济源市邵原镇",
							"position": [
								"112.113",
								"35.2704"
							],
							"value": "419001"
						},
						{
							"label": "济源市北海街道",
							"position": [
								"112.569",
								"35.1116"
							],
							"value": "419001"
						},
						{
							"label": "济源市承留镇",
							"position": [
								"112.509",
								"35.0243"
							],
							"value": "419001"
						}
					]
				}
			]
		},
		{
			"label": "湖北省",
			"position": [
				"114.298572",
				"30.584355"
			],
			"value": "420000",
			"children": [{
					"label": "武汉市",
					"position": [
						"114.298572",
						"30.584355"
					],
					"value": "420100",
					"children": [{
							"label": "江岸区",
							"position": [
								"114.30304",
								"30.594911"
							],
							"value": "420102"
						},
						{
							"label": "江汉区",
							"position": [
								"114.283109",
								"30.578771"
							],
							"value": "420103"
						},
						{
							"label": "硚口区",
							"position": [
								"114.264568",
								"30.57061"
							],
							"value": "420104"
						},
						{
							"label": "汉阳区",
							"position": [
								"114.265807",
								"30.549326"
							],
							"value": "420105"
						},
						{
							"label": "武昌区",
							"position": [
								"114.307344",
								"30.546536"
							],
							"value": "420106"
						},
						{
							"label": "青山区",
							"position": [
								"114.39707",
								"30.634215"
							],
							"value": "420107"
						},
						{
							"label": "洪山区",
							"position": [
								"114.400718",
								"30.504259"
							],
							"value": "420111"
						},
						{
							"label": "东西湖区",
							"position": [
								"114.142483",
								"30.622467"
							],
							"value": "420112"
						},
						{
							"label": "汉南区",
							"position": [
								"114.08124",
								"30.309637"
							],
							"value": "420113"
						},
						{
							"label": "蔡甸区",
							"position": [
								"114.029341",
								"30.582186"
							],
							"value": "420114"
						},
						{
							"label": "江夏区",
							"position": [
								"114.313961",
								"30.349045"
							],
							"value": "420115"
						},
						{
							"label": "黄陂区",
							"position": [
								"114.374025",
								"30.874155"
							],
							"value": "420116"
						},
						{
							"label": "新洲区",
							"position": [
								"114.802108",
								"30.842149"
							],
							"value": "420117"
						}
					]
				},
				{
					"label": "黄石市",
					"position": [
						"115.077048",
						"30.220074"
					],
					"value": "420200",
					"children": [{
							"label": "黄石港区",
							"position": [
								"115.090164",
								"30.212086"
							],
							"value": "420202"
						},
						{
							"label": "西塞山区",
							"position": [
								"115.093354",
								"30.205365"
							],
							"value": "420203"
						},
						{
							"label": "下陆区",
							"position": [
								"114.975755",
								"30.177845"
							],
							"value": "420204"
						},
						{
							"label": "铁山区",
							"position": [
								"114.901366",
								"30.20601"
							],
							"value": "420205"
						},
						{
							"label": "阳新县",
							"position": [
								"115.212883",
								"29.841572"
							],
							"value": "420222"
						},
						{
							"label": "大冶市",
							"position": [
								"114.974842",
								"30.098804"
							],
							"value": "420281"
						}
					]
				},
				{
					"label": "十堰市",
					"position": [
						"110.787916",
						"32.646907"
					],
					"value": "420300",
					"children": [{
							"label": "茅箭区",
							"position": [
								"110.78621",
								"32.644463"
							],
							"value": "420302"
						},
						{
							"label": "张湾区",
							"position": [
								"110.772365",
								"32.652516"
							],
							"value": "420303"
						},
						{
							"label": "郧阳区",
							"position": [
								"110.812099",
								"32.838267"
							],
							"value": "420304"
						},
						{
							"label": "郧西县",
							"position": [
								"110.426472",
								"32.991457"
							],
							"value": "420322"
						},
						{
							"label": "竹山县",
							"position": [
								"110.2296",
								"32.22586"
							],
							"value": "420323"
						},
						{
							"label": "竹溪县",
							"position": [
								"109.717196",
								"32.315342"
							],
							"value": "420324"
						},
						{
							"label": "房县",
							"position": [
								"110.741966",
								"32.055002"
							],
							"value": "420325"
						},
						{
							"label": "丹江口市",
							"position": [
								"111.513793",
								"32.538839"
							],
							"value": "420381"
						}
					]
				},
				{
					"label": "宜昌市",
					"position": [
						"111.290843",
						"30.702636"
					],
					"value": "420500",
					"children": [{
							"label": "西陵区",
							"position": [
								"111.295468",
								"30.702476"
							],
							"value": "420502"
						},
						{
							"label": "伍家岗区",
							"position": [
								"111.307215",
								"30.679053"
							],
							"value": "420503"
						},
						{
							"label": "点军区",
							"position": [
								"111.268163",
								"30.692322"
							],
							"value": "420504"
						},
						{
							"label": "猇亭区",
							"position": [
								"111.427642",
								"30.530744"
							],
							"value": "420505"
						},
						{
							"label": "夷陵区",
							"position": [
								"111.326747",
								"30.770199"
							],
							"value": "420506"
						},
						{
							"label": "远安县",
							"position": [
								"111.64331",
								"31.059626"
							],
							"value": "420525"
						},
						{
							"label": "兴山县",
							"position": [
								"110.754499",
								"31.34795"
							],
							"value": "420526"
						},
						{
							"label": "秭归县",
							"position": [
								"110.976785",
								"30.823908"
							],
							"value": "420527"
						},
						{
							"label": "长阳土家族自治县",
							"position": [
								"111.198475",
								"30.466534"
							],
							"value": "420528"
						},
						{
							"label": "五峰土家族自治县",
							"position": [
								"110.674938",
								"30.199252"
							],
							"value": "420529"
						},
						{
							"label": "宜都市",
							"position": [
								"111.454367",
								"30.387234"
							],
							"value": "420581"
						},
						{
							"label": "当阳市",
							"position": [
								"111.793419",
								"30.824492"
							],
							"value": "420582"
						},
						{
							"label": "枝江市",
							"position": [
								"111.751799",
								"30.425364"
							],
							"value": "420583"
						}
					]
				},
				{
					"label": "襄阳市",
					"position": [
						"112.144146",
						"32.042426"
					],
					"value": "420600",
					"children": [{
							"label": "襄城区",
							"position": [
								"112.150327",
								"32.015088"
							],
							"value": "420602"
						},
						{
							"label": "樊城区",
							"position": [
								"112.13957",
								"32.058589"
							],
							"value": "420606"
						},
						{
							"label": "襄州区",
							"position": [
								"112.197378",
								"32.085517"
							],
							"value": "420607"
						},
						{
							"label": "南漳县",
							"position": [
								"111.844424",
								"31.77692"
							],
							"value": "420624"
						},
						{
							"label": "谷城县",
							"position": [
								"111.640147",
								"32.262676"
							],
							"value": "420625"
						},
						{
							"label": "保康县",
							"position": [
								"111.262235",
								"31.873507"
							],
							"value": "420626"
						},
						{
							"label": "老河口市",
							"position": [
								"111.675732",
								"32.385438"
							],
							"value": "420682"
						},
						{
							"label": "枣阳市",
							"position": [
								"112.765268",
								"32.123083"
							],
							"value": "420683"
						},
						{
							"label": "宜城市",
							"position": [
								"112.261441",
								"31.709203"
							],
							"value": "420684"
						}
					]
				},
				{
					"label": "鄂州市",
					"position": [
						"114.890593",
						"30.396536"
					],
					"value": "420700",
					"children": [{
							"label": "梁子湖区",
							"position": [
								"114.681967",
								"30.098191"
							],
							"value": "420702"
						},
						{
							"label": "华容区",
							"position": [
								"114.74148",
								"30.534468"
							],
							"value": "420703"
						},
						{
							"label": "鄂城区",
							"position": [
								"114.890012",
								"30.39669"
							],
							"value": "420704"
						}
					]
				},
				{
					"label": "荆门市",
					"position": [
						"112.204251",
						"31.03542"
					],
					"value": "420800",
					"children": [{
							"label": "东宝区",
							"position": [
								"112.204804",
								"31.033461"
							],
							"value": "420802"
						},
						{
							"label": "掇刀区",
							"position": [
								"112.198413",
								"30.980798"
							],
							"value": "420804"
						},
						{
							"label": "沙洋县",
							"position": [
								"112.595218",
								"30.70359"
							],
							"value": "420822"
						},
						{
							"label": "钟祥市",
							"position": [
								"112.587267",
								"31.165573"
							],
							"value": "420881"
						},
						{
							"label": "京山市",
							"position": [
								"113.114595",
								"31.022457"
							],
							"value": "420882"
						}
					]
				},
				{
					"label": "孝感市",
					"position": [
						"113.926655",
						"30.926423"
					],
					"value": "420900",
					"children": [{
							"label": "孝南区",
							"position": [
								"113.925849",
								"30.925966"
							],
							"value": "420902"
						},
						{
							"label": "孝昌县",
							"position": [
								"113.988964",
								"31.251618"
							],
							"value": "420921"
						},
						{
							"label": "大悟县",
							"position": [
								"114.126249",
								"31.565483"
							],
							"value": "420922"
						},
						{
							"label": "云梦县",
							"position": [
								"113.750616",
								"31.021691"
							],
							"value": "420923"
						},
						{
							"label": "应城市",
							"position": [
								"113.573842",
								"30.939038"
							],
							"value": "420981"
						},
						{
							"label": "安陆市",
							"position": [
								"113.690401",
								"31.26174"
							],
							"value": "420982"
						},
						{
							"label": "汉川市",
							"position": [
								"113.835301",
								"30.652165"
							],
							"value": "420984"
						}
					]
				},
				{
					"label": "荆州市",
					"position": [
						"112.23813",
						"30.326857"
					],
					"value": "421000",
					"children": [{
							"label": "沙市区",
							"position": [
								"112.257433",
								"30.315895"
							],
							"value": "421002"
						},
						{
							"label": "荆州区",
							"position": [
								"112.195354",
								"30.350674"
							],
							"value": "421003"
						},
						{
							"label": "公安县",
							"position": [
								"112.230179",
								"30.059065"
							],
							"value": "421022"
						},
						{
							"label": "监利市",
							"position": [
								"112.904344",
								"29.820079"
							],
							"value": "421023"
						},
						{
							"label": "江陵县",
							"position": [
								"112.41735",
								"30.033919"
							],
							"value": "421024"
						},
						{
							"label": "石首市",
							"position": [
								"112.40887",
								"29.716437"
							],
							"value": "421081"
						},
						{
							"label": "洪湖市",
							"position": [
								"113.470304",
								"29.81297"
							],
							"value": "421083"
						},
						{
							"label": "松滋市",
							"position": [
								"111.77818",
								"30.176037"
							],
							"value": "421087"
						}
					]
				},
				{
					"label": "黄冈市",
					"position": [
						"114.879365",
						"30.447711"
					],
					"value": "421100",
					"children": [{
							"label": "黄州区",
							"position": [
								"114.878934",
								"30.447435"
							],
							"value": "421102"
						},
						{
							"label": "团风县",
							"position": [
								"114.872029",
								"30.63569"
							],
							"value": "421121"
						},
						{
							"label": "红安县",
							"position": [
								"114.615095",
								"31.284777"
							],
							"value": "421122"
						},
						{
							"label": "罗田县",
							"position": [
								"115.398984",
								"30.781679"
							],
							"value": "421123"
						},
						{
							"label": "英山县",
							"position": [
								"115.67753",
								"30.735794"
							],
							"value": "421124"
						},
						{
							"label": "浠水县",
							"position": [
								"115.26344",
								"30.454837"
							],
							"value": "421125"
						},
						{
							"label": "蕲春县",
							"position": [
								"115.433964",
								"30.234927"
							],
							"value": "421126"
						},
						{
							"label": "黄梅县",
							"position": [
								"115.942548",
								"30.075113"
							],
							"value": "421127"
						},
						{
							"label": "麻城市",
							"position": [
								"115.02541",
								"31.177906"
							],
							"value": "421181"
						},
						{
							"label": "武穴市",
							"position": [
								"115.56242",
								"29.849342"
							],
							"value": "421182"
						}
					]
				},
				{
					"label": "咸宁市",
					"position": [
						"114.328963",
						"29.832798"
					],
					"value": "421200",
					"children": [{
							"label": "咸安区",
							"position": [
								"114.333894",
								"29.824716"
							],
							"value": "421202"
						},
						{
							"label": "嘉鱼县",
							"position": [
								"113.921547",
								"29.973363"
							],
							"value": "421221"
						},
						{
							"label": "通城县",
							"position": [
								"113.814131",
								"29.246076"
							],
							"value": "421222"
						},
						{
							"label": "崇阳县",
							"position": [
								"114.049958",
								"29.54101"
							],
							"value": "421223"
						},
						{
							"label": "通山县",
							"position": [
								"114.493163",
								"29.604455"
							],
							"value": "421224"
						},
						{
							"label": "赤壁市",
							"position": [
								"113.88366",
								"29.716879"
							],
							"value": "421281"
						}
					]
				},
				{
					"label": "随州市",
					"position": [
						"113.37377",
						"31.717497"
					],
					"value": "421300",
					"children": [{
							"label": "曾都区",
							"position": [
								"113.374519",
								"31.717521"
							],
							"value": "421303"
						},
						{
							"label": "随县",
							"position": [
								"113.301384",
								"31.854246"
							],
							"value": "421321"
						},
						{
							"label": "广水市",
							"position": [
								"113.826601",
								"31.617731"
							],
							"value": "421381"
						}
					]
				},
				{
					"label": "恩施土家族苗族自治州",
					"position": [
						"109.48699",
						"30.283114"
					],
					"value": "422800",
					"children": [{
							"label": "恩施市",
							"position": [
								"109.486761",
								"30.282406"
							],
							"value": "422801"
						},
						{
							"label": "利川市",
							"position": [
								"108.943491",
								"30.294247"
							],
							"value": "422802"
						},
						{
							"label": "建始县",
							"position": [
								"109.723822",
								"30.601632"
							],
							"value": "422822"
						},
						{
							"label": "巴东县",
							"position": [
								"110.336665",
								"31.041403"
							],
							"value": "422823"
						},
						{
							"label": "宣恩县",
							"position": [
								"109.482819",
								"29.98867"
							],
							"value": "422825"
						},
						{
							"label": "咸丰县",
							"position": [
								"109.15041",
								"29.678967"
							],
							"value": "422826"
						},
						{
							"label": "来凤县",
							"position": [
								"109.408328",
								"29.506945"
							],
							"value": "422827"
						},
						{
							"label": "鹤峰县",
							"position": [
								"110.033699",
								"29.887298"
							],
							"value": "422828"
						}
					]
				},
				{
					"label": "仙桃市",
					"position": [
						"113.453974",
						"30.364953"
					],
					"value": "429004",
					"children": [{
							"label": "畜禽良种场",
							"position": [
								"113.751",
								"30.1779"
							],
							"value": "429004"
						},
						{
							"label": "工业园区",
							"position": [
								"113.413",
								"30.3233"
							],
							"value": "429004"
						},
						{
							"label": "沙湖镇",
							"position": [
								"113.6",
								"30.1698"
							],
							"value": "429004"
						},
						{
							"label": "豆河镇",
							"position": [
								"113",
								"30.37"
							],
							"value": "429004"
						},
						{
							"label": "通海口镇",
							"position": [
								"113.206",
								"30.2722"
							],
							"value": "429004"
						},
						{
							"label": "胡场镇",
							"position": [
								"113.29",
								"30.4278"
							],
							"value": "429004"
						},
						{
							"label": "长倘口镇",
							"position": [
								"113.598",
								"30.3512"
							],
							"value": "429004"
						},
						{
							"label": "五湖渔场",
							"position": [
								"113.783",
								"30.161"
							],
							"value": "429004"
						},
						{
							"label": "干河街道",
							"position": [
								"113.451",
								"30.3772"
							],
							"value": "429004"
						},
						{
							"label": "杨林尾镇",
							"position": [
								"113.561",
								"30.2014"
							],
							"value": "429004"
						},
						{
							"label": "西流河镇",
							"position": [
								"113.761",
								"30.297"
							],
							"value": "429004"
						},
						{
							"label": "赵西垸林场",
							"position": [
								"113.027",
								"30.285"
							],
							"value": "429004"
						},
						{
							"label": "彭场镇",
							"position": [
								"113.446",
								"30.2518"
							],
							"value": "429004"
						},
						{
							"label": "九合垸原种场",
							"position": [
								"113.006",
								"30.2473"
							],
							"value": "429004"
						},
						{
							"label": "沔城回族镇",
							"position": [
								"113.201",
								"30.1921"
							],
							"value": "429004"
						},
						{
							"label": "龙华山街道",
							"position": [
								"113.46",
								"30.3649"
							],
							"value": "429004"
						},
						{
							"label": "沙湖原种场",
							"position": [
								"113.643",
								"30.1482"
							],
							"value": "429004"
						},
						{
							"label": "陈场镇",
							"position": [
								"113.111",
								"30.2879"
							],
							"value": "429004"
						},
						{
							"label": "郑场镇",
							"position": [
								"112.979",
								"30.4707"
							],
							"value": "429004"
						},
						{
							"label": "排湖风景区",
							"position": [
								"113.223",
								"30.2987"
							],
							"value": "429004"
						},
						{
							"label": "郭河镇",
							"position": [
								"113.304",
								"30.3027"
							],
							"value": "429004"
						},
						{
							"label": "沙嘴街道",
							"position": [
								"113.441",
								"30.3596"
							],
							"value": "429004"
						},
						{
							"label": "毛嘴镇",
							"position": [
								"113.045",
								"30.4188"
							],
							"value": "429004"
						},
						{
							"label": "张沟镇",
							"position": [
								"113.438",
								"30.2968"
							],
							"value": "429004"
						},
						{
							"label": "三伏潭镇",
							"position": [
								"113.207",
								"30.3395"
							],
							"value": "429004"
						}
					]
				},
				{
					"label": "潜江市",
					"position": [
						"112.896866",
						"30.421215"
					],
					"value": "429005",
					"children": [{
							"label": "积玉口镇",
							"position": [
								"112.721",
								"30.4185"
							],
							"value": "429005"
						},
						{
							"label": "广华街道",
							"position": [
								"112.666",
								"30.4633"
							],
							"value": "429005"
						},
						{
							"label": "泰丰街道",
							"position": [
								"112.981",
								"30.4167"
							],
							"value": "429005"
						},
						{
							"label": "周矶管理区",
							"position": [
								"112.826",
								"30.4567"
							],
							"value": "429005"
						},
						{
							"label": "潜江经济开发区",
							"position": [
								"112.883",
								"30.4825"
							],
							"value": "429005"
						},
						{
							"label": "高场街道",
							"position": [
								"112.775",
								"30.4076"
							],
							"value": "429005"
						},
						{
							"label": "周矶街道",
							"position": [
								"112.818",
								"30.4576"
							],
							"value": "429005"
						},
						{
							"label": "总口管理区",
							"position": [
								"112.89",
								"30.2581"
							],
							"value": "429005"
						},
						{
							"label": "运粮湖管理区",
							"position": [
								"112.582",
								"30.252"
							],
							"value": "429005"
						},
						{
							"label": "王场镇",
							"position": [
								"112.819",
								"30.4906"
							],
							"value": "429005"
						},
						{
							"label": "竹根滩镇",
							"position": [
								"112.979",
								"30.4716"
							],
							"value": "429005"
						},
						{
							"label": "园林街道",
							"position": [
								"112.91",
								"30.377"
							],
							"value": "429005"
						},
						{
							"label": "白鹭湖管理区",
							"position": [
								"112.716",
								"30.1788"
							],
							"value": "429005"
						},
						{
							"label": "渔洋镇",
							"position": [
								"112.966",
								"30.2392"
							],
							"value": "429005"
						},
						{
							"label": "熊口镇",
							"position": [
								"112.724",
								"30.3404"
							],
							"value": "429005"
						},
						{
							"label": "后湖管理区",
							"position": [
								"112.768",
								"30.4049"
							],
							"value": "429005"
						},
						{
							"label": "江汉石油管理局",
							"position": [
								"112.793",
								"30.4635"
							],
							"value": "429005"
						},
						{
							"label": "熊口管理区",
							"position": [
								"112.802",
								"30.195"
							],
							"value": "429005"
						},
						{
							"label": "张金镇",
							"position": [
								"112.577",
								"30.2389"
							],
							"value": "429005"
						},
						{
							"label": "杨市街道",
							"position": [
								"112.915",
								"30.3835"
							],
							"value": "429005"
						},
						{
							"label": "高石碑镇",
							"position": [
								"112.626",
								"30.6203"
							],
							"value": "429005"
						},
						{
							"label": "浩口镇",
							"position": [
								"112.65",
								"30.3695"
							],
							"value": "429005"
						},
						{
							"label": "龙湾镇",
							"position": [
								"112.69",
								"30.2848"
							],
							"value": "429005"
						},
						{
							"label": "老新镇",
							"position": [
								"112.81",
								"30.2185"
							],
							"value": "429005"
						},
						{
							"label": "浩口原种场",
							"position": [
								"112.643",
								"30.3784"
							],
							"value": "429005"
						}
					]
				},
				{
					"label": "天门市",
					"position": [
						"113.165862",
						"30.653061"
					],
					"value": "429006",
					"children": [{
							"label": "胡市镇",
							"position": [
								"113.422",
								"30.802"
							],
							"value": "429006"
						},
						{
							"label": "多祥镇",
							"position": [
								"113.361",
								"30.4223"
							],
							"value": "429006"
						},
						{
							"label": "黄潭镇",
							"position": [
								"113.039",
								"30.6922"
							],
							"value": "429006"
						},
						{
							"label": "沉湖管委会",
							"position": [
								"113.399",
								"30.4588"
							],
							"value": "429006"
						},
						{
							"label": "干驿镇",
							"position": [
								"113.451",
								"30.503"
							],
							"value": "429006"
						},
						{
							"label": "横林镇",
							"position": [
								"113.215",
								"30.5643"
							],
							"value": "429006"
						},
						{
							"label": "马湾镇",
							"position": [
								"113.312",
								"30.5993"
							],
							"value": "429006"
						},
						{
							"label": "蒋湖农场",
							"position": [
								"112.802",
								"30.6364"
							],
							"value": "429006"
						},
						{
							"label": "小板镇",
							"position": [
								"113.264",
								"30.6151"
							],
							"value": "429006"
						},
						{
							"label": "岳口镇",
							"position": [
								"113.105",
								"30.5868"
							],
							"value": "429006"
						},
						{
							"label": "多宝镇",
							"position": [
								"112.614",
								"30.7034"
							],
							"value": "429006"
						},
						{
							"label": "蒋场镇",
							"position": [
								"112.927",
								"30.646"
							],
							"value": "429006"
						},
						{
							"label": "石家河镇",
							"position": [
								"113.076",
								"30.8211"
							],
							"value": "429006"
						},
						{
							"label": "彭市镇",
							"position": [
								"113.157",
								"30.4315"
							],
							"value": "429006"
						},
						{
							"label": "佛子山镇",
							"position": [
								"113.068",
								"30.6892"
							],
							"value": "429006"
						},
						{
							"label": "九真镇",
							"position": [
								"113.206",
								"30.8245"
							],
							"value": "429006"
						},
						{
							"label": "竟陵街道",
							"position": [
								"113.183",
								"30.7066"
							],
							"value": "429006"
						},
						{
							"label": "侨乡街道开发区",
							"position": [
								"113.134",
								"30.652"
							],
							"value": "429006"
						},
						{
							"label": "麻洋镇",
							"position": [
								"113.309",
								"30.5249"
							],
							"value": "429006"
						},
						{
							"label": "杨林街道",
							"position": [
								"113.265",
								"30.6856"
							],
							"value": "429006"
						},
						{
							"label": "白茅湖农场",
							"position": [
								"113.063",
								"30.5868"
							],
							"value": "429006"
						},
						{
							"label": "皂市镇",
							"position": [
								"113.223",
								"30.7957"
							],
							"value": "429006"
						},
						{
							"label": "拖市镇",
							"position": [
								"112.856",
								"30.7135"
							],
							"value": "429006"
						},
						{
							"label": "汪场镇",
							"position": [
								"112.979",
								"30.638"
							],
							"value": "429006"
						},
						{
							"label": "张港镇",
							"position": [
								"112.801",
								"30.5529"
							],
							"value": "429006"
						},
						{
							"label": "渔薪镇",
							"position": [
								"112.879",
								"30.6744"
							],
							"value": "429006"
						},
						{
							"label": "卢市镇",
							"position": [
								"113.397",
								"30.6596"
							],
							"value": "429006"
						},
						{
							"label": "净潭乡",
							"position": [
								"113.451",
								"30.6464"
							],
							"value": "429006"
						}
					]
				},
				{
					"label": "神农架林区",
					"position": [
						"110.671525",
						"31.744449"
					],
					"value": "429021",
					"children": [{
							"label": "木鱼镇",
							"position": [
								"110.312",
								"31.3933"
							],
							"value": "429021"
						},
						{
							"label": "下谷坪土家族乡",
							"position": [
								"110.113",
								"31.4153"
							],
							"value": "429021"
						},
						{
							"label": "新华镇",
							"position": [
								"110.842",
								"31.6218"
							],
							"value": "429021"
						},
						{
							"label": "九湖镇",
							"position": [
								"110.062",
								"31.4095"
							],
							"value": "429021"
						},
						{
							"label": "宋洛乡",
							"position": [
								"110.59",
								"31.7303"
							],
							"value": "429021"
						},
						{
							"label": "松柏镇",
							"position": [
								"110.609",
								"31.7041"
							],
							"value": "429021"
						},
						{
							"label": "红坪镇",
							"position": [
								"110.196",
								"31.4718"
							],
							"value": "429021"
						},
						{
							"label": "阳日镇",
							"position": [
								"110.763",
								"31.677"
							],
							"value": "429021"
						}
					]
				}
			]
		},
		{
			"label": "湖南省",
			"position": [
				"112.982279",
				"28.19409"
			],
			"value": "430000",
			"children": [{
					"label": "长沙市",
					"position": [
						"112.982279",
						"28.19409"
					],
					"value": "430100",
					"children": [{
							"label": "芙蓉区",
							"position": [
								"112.988094",
								"28.193106"
							],
							"value": "430102"
						},
						{
							"label": "天心区",
							"position": [
								"112.97307",
								"28.192375"
							],
							"value": "430103"
						},
						{
							"label": "岳麓区",
							"position": [
								"112.911591",
								"28.213044"
							],
							"value": "430104"
						},
						{
							"label": "开福区",
							"position": [
								"112.985525",
								"28.201336"
							],
							"value": "430105"
						},
						{
							"label": "雨花区",
							"position": [
								"113.016337",
								"28.109937"
							],
							"value": "430111"
						},
						{
							"label": "望城区",
							"position": [
								"112.819549",
								"28.347458"
							],
							"value": "430112"
						},
						{
							"label": "长沙县",
							"position": [
								"113.080098",
								"28.237888"
							],
							"value": "430121"
						},
						{
							"label": "浏阳市",
							"position": [
								"113.633301",
								"28.141112"
							],
							"value": "430181"
						},
						{
							"label": "宁乡市",
							"position": [
								"112.553182",
								"28.253928"
							],
							"value": "430182"
						}
					]
				},
				{
					"label": "株洲市",
					"position": [
						"113.151737",
						"27.835806"
					],
					"value": "430200",
					"children": [{
							"label": "荷塘区",
							"position": [
								"113.162548",
								"27.833036"
							],
							"value": "430202"
						},
						{
							"label": "芦淞区",
							"position": [
								"113.155169",
								"27.827246"
							],
							"value": "430203"
						},
						{
							"label": "石峰区",
							"position": [
								"113.11295",
								"27.871945"
							],
							"value": "430204"
						},
						{
							"label": "天元区",
							"position": [
								"113.136252",
								"27.826909"
							],
							"value": "430211"
						},
						{
							"label": "渌口区",
							"position": [
								"113.146175",
								"27.705844"
							],
							"value": "430212"
						},
						{
							"label": "攸县",
							"position": [
								"113.345774",
								"27.000071"
							],
							"value": "430223"
						},
						{
							"label": "茶陵县",
							"position": [
								"113.546509",
								"26.789534"
							],
							"value": "430224"
						},
						{
							"label": "炎陵县",
							"position": [
								"113.776884",
								"26.489459"
							],
							"value": "430225"
						},
						{
							"label": "醴陵市",
							"position": [
								"113.507157",
								"27.657873"
							],
							"value": "430281"
						}
					]
				},
				{
					"label": "湘潭市",
					"position": [
						"112.944052",
						"27.82973"
					],
					"value": "430300",
					"children": [{
							"label": "雨湖区",
							"position": [
								"112.907427",
								"27.86077"
							],
							"value": "430302"
						},
						{
							"label": "岳塘区",
							"position": [
								"112.927707",
								"27.828854"
							],
							"value": "430304"
						},
						{
							"label": "湘潭县",
							"position": [
								"112.952829",
								"27.778601"
							],
							"value": "430321"
						},
						{
							"label": "湘乡市",
							"position": [
								"112.525217",
								"27.734918"
							],
							"value": "430381"
						},
						{
							"label": "韶山市",
							"position": [
								"112.52848",
								"27.922682"
							],
							"value": "430382"
						}
					]
				},
				{
					"label": "衡阳市",
					"position": [
						"112.607693",
						"26.900358"
					],
					"value": "430400",
					"children": [{
							"label": "珠晖区",
							"position": [
								"112.626324",
								"26.891063"
							],
							"value": "430405"
						},
						{
							"label": "雁峰区",
							"position": [
								"112.612241",
								"26.893694"
							],
							"value": "430406"
						},
						{
							"label": "石鼓区",
							"position": [
								"112.607635",
								"26.903908"
							],
							"value": "430407"
						},
						{
							"label": "蒸湘区",
							"position": [
								"112.570608",
								"26.89087"
							],
							"value": "430408"
						},
						{
							"label": "南岳区",
							"position": [
								"112.734147",
								"27.240536"
							],
							"value": "430412"
						},
						{
							"label": "衡阳县",
							"position": [
								"112.379643",
								"26.962388"
							],
							"value": "430421"
						},
						{
							"label": "衡南县",
							"position": [
								"112.677459",
								"26.739973"
							],
							"value": "430422"
						},
						{
							"label": "衡山县",
							"position": [
								"112.86971",
								"27.234808"
							],
							"value": "430423"
						},
						{
							"label": "衡东县",
							"position": [
								"112.950412",
								"27.083531"
							],
							"value": "430424"
						},
						{
							"label": "祁东县",
							"position": [
								"112.111192",
								"26.787109"
							],
							"value": "430426"
						},
						{
							"label": "耒阳市",
							"position": [
								"112.847215",
								"26.414162"
							],
							"value": "430481"
						},
						{
							"label": "常宁市",
							"position": [
								"112.396821",
								"26.406773"
							],
							"value": "430482"
						}
					]
				},
				{
					"label": "邵阳市",
					"position": [
						"111.46923",
						"27.237842"
					],
					"value": "430500",
					"children": [{
							"label": "双清区",
							"position": [
								"111.479756",
								"27.240001"
							],
							"value": "430502"
						},
						{
							"label": "大祥区",
							"position": [
								"111.462968",
								"27.233593"
							],
							"value": "430503"
						},
						{
							"label": "北塔区",
							"position": [
								"111.452315",
								"27.245688"
							],
							"value": "430511"
						},
						{
							"label": "新邵县",
							"position": [
								"111.459762",
								"27.311429"
							],
							"value": "430522"
						},
						{
							"label": "邵阳县",
							"position": [
								"111.2757",
								"26.989713"
							],
							"value": "430523"
						},
						{
							"label": "隆回县",
							"position": [
								"111.038785",
								"27.116002"
							],
							"value": "430524"
						},
						{
							"label": "洞口县",
							"position": [
								"110.579212",
								"27.062286"
							],
							"value": "430525"
						},
						{
							"label": "绥宁县",
							"position": [
								"110.155075",
								"26.580622"
							],
							"value": "430527"
						},
						{
							"label": "新宁县",
							"position": [
								"110.859115",
								"26.438912"
							],
							"value": "430528"
						},
						{
							"label": "城步苗族自治县",
							"position": [
								"110.313226",
								"26.363575"
							],
							"value": "430529"
						},
						{
							"label": "武冈市",
							"position": [
								"110.636804",
								"26.732086"
							],
							"value": "430581"
						},
						{
							"label": "邵东市",
							"position": [
								"111.743168",
								"27.257273"
							],
							"value": "430582"
						}
					]
				},
				{
					"label": "岳阳市",
					"position": [
						"113.132855",
						"29.37029"
					],
					"value": "430600",
					"children": [{
							"label": "岳阳楼区",
							"position": [
								"113.120751",
								"29.366784"
							],
							"value": "430602"
						},
						{
							"label": "云溪区",
							"position": [
								"113.27387",
								"29.473395"
							],
							"value": "430603"
						},
						{
							"label": "君山区",
							"position": [
								"113.004082",
								"29.438062"
							],
							"value": "430611"
						},
						{
							"label": "岳阳县",
							"position": [
								"113.116073",
								"29.144843"
							],
							"value": "430621"
						},
						{
							"label": "华容县",
							"position": [
								"112.559369",
								"29.524107"
							],
							"value": "430623"
						},
						{
							"label": "湘阴县",
							"position": [
								"112.889748",
								"28.677498"
							],
							"value": "430624"
						},
						{
							"label": "平江县",
							"position": [
								"113.593751",
								"28.701523"
							],
							"value": "430626"
						},
						{
							"label": "汨罗市",
							"position": [
								"113.079419",
								"28.803149"
							],
							"value": "430681"
						},
						{
							"label": "临湘市",
							"position": [
								"113.450809",
								"29.471594"
							],
							"value": "430682"
						}
					]
				},
				{
					"label": "常德市",
					"position": [
						"111.691347",
						"29.040225"
					],
					"value": "430700",
					"children": [{
							"label": "武陵区",
							"position": [
								"111.690718",
								"29.040477"
							],
							"value": "430702"
						},
						{
							"label": "鼎城区",
							"position": [
								"111.685327",
								"29.014426"
							],
							"value": "430703"
						},
						{
							"label": "安乡县",
							"position": [
								"112.172289",
								"29.414483"
							],
							"value": "430721"
						},
						{
							"label": "汉寿县",
							"position": [
								"111.968506",
								"28.907319"
							],
							"value": "430722"
						},
						{
							"label": "澧县",
							"position": [
								"111.761682",
								"29.64264"
							],
							"value": "430723"
						},
						{
							"label": "临澧县",
							"position": [
								"111.645602",
								"29.443217"
							],
							"value": "430724"
						},
						{
							"label": "桃源县",
							"position": [
								"111.484503",
								"28.902734"
							],
							"value": "430725"
						},
						{
							"label": "石门县",
							"position": [
								"111.379087",
								"29.584703"
							],
							"value": "430726"
						},
						{
							"label": "津市市",
							"position": [
								"111.879609",
								"29.630867"
							],
							"value": "430781"
						}
					]
				},
				{
					"label": "张家界市",
					"position": [
						"110.479921",
						"29.127401"
					],
					"value": "430800",
					"children": [{
							"label": "永定区",
							"position": [
								"110.484559",
								"29.125961"
							],
							"value": "430802"
						},
						{
							"label": "武陵源区",
							"position": [
								"110.54758",
								"29.347827"
							],
							"value": "430811"
						},
						{
							"label": "慈利县",
							"position": [
								"111.132702",
								"29.423876"
							],
							"value": "430821"
						},
						{
							"label": "桑植县",
							"position": [
								"110.164039",
								"29.399939"
							],
							"value": "430822"
						}
					]
				},
				{
					"label": "益阳市",
					"position": [
						"112.355042",
						"28.570066"
					],
					"value": "430900",
					"children": [{
							"label": "资阳区",
							"position": [
								"112.33084",
								"28.592771"
							],
							"value": "430902"
						},
						{
							"label": "赫山区",
							"position": [
								"112.360946",
								"28.568327"
							],
							"value": "430903"
						},
						{
							"label": "南县",
							"position": [
								"112.410399",
								"29.372181"
							],
							"value": "430921"
						},
						{
							"label": "桃江县",
							"position": [
								"112.139732",
								"28.520993"
							],
							"value": "430922"
						},
						{
							"label": "安化县",
							"position": [
								"111.221824",
								"28.377421"
							],
							"value": "430923"
						},
						{
							"label": "沅江市",
							"position": [
								"112.361088",
								"28.839713"
							],
							"value": "430981"
						}
					]
				},
				{
					"label": "郴州市",
					"position": [
						"113.032067",
						"25.793589"
					],
					"value": "431000",
					"children": [{
							"label": "北湖区",
							"position": [
								"113.032208",
								"25.792628"
							],
							"value": "431002"
						},
						{
							"label": "苏仙区",
							"position": [
								"113.038698",
								"25.793157"
							],
							"value": "431003"
						},
						{
							"label": "桂阳县",
							"position": [
								"112.734466",
								"25.737447"
							],
							"value": "431021"
						},
						{
							"label": "宜章县",
							"position": [
								"112.947884",
								"25.394345"
							],
							"value": "431022"
						},
						{
							"label": "永兴县",
							"position": [
								"113.114819",
								"26.129392"
							],
							"value": "431023"
						},
						{
							"label": "嘉禾县",
							"position": [
								"112.370618",
								"25.587309"
							],
							"value": "431024"
						},
						{
							"label": "临武县",
							"position": [
								"112.564589",
								"25.279119"
							],
							"value": "431025"
						},
						{
							"label": "汝城县",
							"position": [
								"113.685686",
								"25.553759"
							],
							"value": "431026"
						},
						{
							"label": "桂东县",
							"position": [
								"113.945879",
								"26.073917"
							],
							"value": "431027"
						},
						{
							"label": "安仁县",
							"position": [
								"113.27217",
								"26.708625"
							],
							"value": "431028"
						},
						{
							"label": "资兴市",
							"position": [
								"113.23682",
								"25.974152"
							],
							"value": "431081"
						}
					]
				},
				{
					"label": "永州市",
					"position": [
						"111.608019",
						"26.434516"
					],
					"value": "431100",
					"children": [{
							"label": "零陵区",
							"position": [
								"111.626348",
								"26.223347"
							],
							"value": "431102"
						},
						{
							"label": "冷水滩区",
							"position": [
								"111.607156",
								"26.434364"
							],
							"value": "431103"
						},
						{
							"label": "祁阳县",
							"position": [
								"111.85734",
								"26.585929"
							],
							"value": "431121"
						},
						{
							"label": "东安县",
							"position": [
								"111.313035",
								"26.397278"
							],
							"value": "431122"
						},
						{
							"label": "双牌县",
							"position": [
								"111.662146",
								"25.959397"
							],
							"value": "431123"
						},
						{
							"label": "道县",
							"position": [
								"111.591614",
								"25.518444"
							],
							"value": "431124"
						},
						{
							"label": "江永县",
							"position": [
								"111.346803",
								"25.268154"
							],
							"value": "431125"
						},
						{
							"label": "宁远县",
							"position": [
								"111.944529",
								"25.584112"
							],
							"value": "431126"
						},
						{
							"label": "蓝山县",
							"position": [
								"112.194195",
								"25.375255"
							],
							"value": "431127"
						},
						{
							"label": "新田县",
							"position": [
								"112.220341",
								"25.906927"
							],
							"value": "431128"
						},
						{
							"label": "江华瑶族自治县",
							"position": [
								"111.577276",
								"25.182596"
							],
							"value": "431129"
						}
					]
				},
				{
					"label": "怀化市",
					"position": [
						"109.97824",
						"27.550082"
					],
					"value": "431200",
					"children": [{
							"label": "鹤城区",
							"position": [
								"109.982242",
								"27.548474"
							],
							"value": "431202"
						},
						{
							"label": "中方县",
							"position": [
								"109.948061",
								"27.43736"
							],
							"value": "431221"
						},
						{
							"label": "沅陵县",
							"position": [
								"110.399161",
								"28.455554"
							],
							"value": "431222"
						},
						{
							"label": "辰溪县",
							"position": [
								"110.196953",
								"28.005474"
							],
							"value": "431223"
						},
						{
							"label": "溆浦县",
							"position": [
								"110.593373",
								"27.903802"
							],
							"value": "431224"
						},
						{
							"label": "会同县",
							"position": [
								"109.720785",
								"26.870789"
							],
							"value": "431225"
						},
						{
							"label": "麻阳苗族自治县",
							"position": [
								"109.802807",
								"27.865991"
							],
							"value": "431226"
						},
						{
							"label": "新晃侗族自治县",
							"position": [
								"109.174443",
								"27.359897"
							],
							"value": "431227"
						},
						{
							"label": "芷江侗族自治县",
							"position": [
								"109.687777",
								"27.437996"
							],
							"value": "431228"
						},
						{
							"label": "靖州苗族侗族自治县",
							"position": [
								"109.691159",
								"26.573511"
							],
							"value": "431229"
						},
						{
							"label": "通道侗族自治县",
							"position": [
								"109.783359",
								"26.158349"
							],
							"value": "431230"
						},
						{
							"label": "洪江市",
							"position": [
								"109.831765",
								"27.201876"
							],
							"value": "431281"
						}
					]
				},
				{
					"label": "娄底市",
					"position": [
						"112.008497",
						"27.728136"
					],
					"value": "431300",
					"children": [{
							"label": "娄星区",
							"position": [
								"112.008486",
								"27.726643"
							],
							"value": "431302"
						},
						{
							"label": "双峰县",
							"position": [
								"112.198245",
								"27.459126"
							],
							"value": "431321"
						},
						{
							"label": "新化县",
							"position": [
								"111.306747",
								"27.737456"
							],
							"value": "431322"
						},
						{
							"label": "冷水江市",
							"position": [
								"111.434674",
								"27.685759"
							],
							"value": "431381"
						},
						{
							"label": "涟源市",
							"position": [
								"111.670847",
								"27.692301"
							],
							"value": "431382"
						}
					]
				},
				{
					"label": "湘西土家族苗族自治州",
					"position": [
						"109.739735",
						"28.314296"
					],
					"value": "433100",
					"children": [{
							"label": "吉首市",
							"position": [
								"109.738273",
								"28.314827"
							],
							"value": "433101"
						},
						{
							"label": "泸溪县",
							"position": [
								"110.214428",
								"28.214516"
							],
							"value": "433122"
						},
						{
							"label": "凤凰县",
							"position": [
								"109.599191",
								"27.948308"
							],
							"value": "433123"
						},
						{
							"label": "花垣县",
							"position": [
								"109.479063",
								"28.581352"
							],
							"value": "433124"
						},
						{
							"label": "保靖县",
							"position": [
								"109.651445",
								"28.709605"
							],
							"value": "433125"
						},
						{
							"label": "古丈县",
							"position": [
								"109.949592",
								"28.616973"
							],
							"value": "433126"
						},
						{
							"label": "永顺县",
							"position": [
								"109.853292",
								"28.998068"
							],
							"value": "433127"
						},
						{
							"label": "龙山县",
							"position": [
								"109.441189",
								"29.453438"
							],
							"value": "433130"
						}
					]
				}
			]
		},
		{
			"label": "广东省",
			"position": [
				"113.280637",
				"23.125178"
			],
			"value": "440000",
			"children": [{
					"label": "广州市",
					"position": [
						"113.280637",
						"23.125178"
					],
					"value": "440100",
					"children": [{
							"label": "荔湾区",
							"position": [
								"113.243038",
								"23.124943"
							],
							"value": "440103"
						},
						{
							"label": "越秀区",
							"position": [
								"113.280714",
								"23.125624"
							],
							"value": "440104"
						},
						{
							"label": "海珠区",
							"position": [
								"113.262008",
								"23.103131"
							],
							"value": "440105"
						},
						{
							"label": "天河区",
							"position": [
								"113.335367",
								"23.13559"
							],
							"value": "440106"
						},
						{
							"label": "白云区",
							"position": [
								"113.262831",
								"23.162281"
							],
							"value": "440111"
						},
						{
							"label": "黄埔区",
							"position": [
								"113.450761",
								"23.103239"
							],
							"value": "440112"
						},
						{
							"label": "番禺区",
							"position": [
								"113.364619",
								"22.938582"
							],
							"value": "440113"
						},
						{
							"label": "花都区",
							"position": [
								"113.211184",
								"23.39205"
							],
							"value": "440114"
						},
						{
							"label": "南沙区",
							"position": [
								"113.53738",
								"22.794531"
							],
							"value": "440115"
						},
						{
							"label": "从化区",
							"position": [
								"113.587386",
								"23.545283"
							],
							"value": "440117"
						},
						{
							"label": "增城区",
							"position": [
								"113.829579",
								"23.290497"
							],
							"value": "440118"
						}
					]
				},
				{
					"label": "韶关市",
					"position": [
						"113.591544",
						"24.801322"
					],
					"value": "440200",
					"children": [{
							"label": "武江区",
							"position": [
								"113.588289",
								"24.80016"
							],
							"value": "440203"
						},
						{
							"label": "浈江区",
							"position": [
								"113.599224",
								"24.803977"
							],
							"value": "440204"
						},
						{
							"label": "曲江区",
							"position": [
								"113.605582",
								"24.680195"
							],
							"value": "440205"
						},
						{
							"label": "始兴县",
							"position": [
								"114.067205",
								"24.948364"
							],
							"value": "440222"
						},
						{
							"label": "仁化县",
							"position": [
								"113.748627",
								"25.088226"
							],
							"value": "440224"
						},
						{
							"label": "翁源县",
							"position": [
								"114.131289",
								"24.353887"
							],
							"value": "440229"
						},
						{
							"label": "乳源瑶族自治县",
							"position": [
								"113.278417",
								"24.776109"
							],
							"value": "440232"
						},
						{
							"label": "新丰县",
							"position": [
								"114.207034",
								"24.055412"
							],
							"value": "440233"
						},
						{
							"label": "乐昌市",
							"position": [
								"113.352413",
								"25.128445"
							],
							"value": "440281"
						},
						{
							"label": "南雄市",
							"position": [
								"114.311231",
								"25.115328"
							],
							"value": "440282"
						}
					]
				},
				{
					"label": "深圳市",
					"position": [
						"114.085947",
						"22.547"
					],
					"value": "440300",
					"children": [{
							"label": "罗湖区",
							"position": [
								"114.123885",
								"22.555341"
							],
							"value": "440303"
						},
						{
							"label": "福田区",
							"position": [
								"114.05096",
								"22.541009"
							],
							"value": "440304"
						},
						{
							"label": "南山区",
							"position": [
								"113.92943",
								"22.531221"
							],
							"value": "440305"
						},
						{
							"label": "宝安区",
							"position": [
								"113.828671",
								"22.754741"
							],
							"value": "440306"
						},
						{
							"label": "龙岗区",
							"position": [
								"114.251372",
								"22.721511"
							],
							"value": "440307"
						},
						{
							"label": "盐田区",
							"position": [
								"114.235366",
								"22.555069"
							],
							"value": "440308"
						},
						{
							"label": "龙华区",
							"position": [
								"114.044346",
								"22.691963"
							],
							"value": "440309"
						},
						{
							"label": "坪山区",
							"position": [
								"114.338441",
								"22.69423"
							],
							"value": "440310"
						},
						{
							"label": "光明区",
							"position": [
								"113.935895",
								"22.748816"
							],
							"value": "440311"
						}
					]
				},
				{
					"label": "珠海市",
					"position": [
						"113.553986",
						"22.224979"
					],
					"value": "440400",
					"children": [{
							"label": "香洲区",
							"position": [
								"113.55027",
								"22.271249"
							],
							"value": "440402"
						},
						{
							"label": "斗门区",
							"position": [
								"113.297739",
								"22.209117"
							],
							"value": "440403"
						},
						{
							"label": "金湾区",
							"position": [
								"113.345071",
								"22.139122"
							],
							"value": "440404"
						}
					]
				},
				{
					"label": "汕头市",
					"position": [
						"116.708463",
						"23.37102"
					],
					"value": "440500",
					"children": [{
							"label": "龙湖区",
							"position": [
								"116.732015",
								"23.373754"
							],
							"value": "440507"
						},
						{
							"label": "金平区",
							"position": [
								"116.703583",
								"23.367071"
							],
							"value": "440511"
						},
						{
							"label": "濠江区",
							"position": [
								"116.729528",
								"23.279345"
							],
							"value": "440512"
						},
						{
							"label": "潮阳区",
							"position": [
								"116.602602",
								"23.262336"
							],
							"value": "440513"
						},
						{
							"label": "潮南区",
							"position": [
								"116.423607",
								"23.249798"
							],
							"value": "440514"
						},
						{
							"label": "澄海区",
							"position": [
								"116.76336",
								"23.46844"
							],
							"value": "440515"
						},
						{
							"label": "南澳县",
							"position": [
								"117.027105",
								"23.419562"
							],
							"value": "440523"
						}
					]
				},
				{
					"label": "佛山市",
					"position": [
						"113.122717",
						"23.028762"
					],
					"value": "440600",
					"children": [{
							"label": "禅城区",
							"position": [
								"113.112414",
								"23.019643"
							],
							"value": "440604"
						},
						{
							"label": "南海区",
							"position": [
								"113.145577",
								"23.031562"
							],
							"value": "440605"
						},
						{
							"label": "顺德区",
							"position": [
								"113.281826",
								"22.75851"
							],
							"value": "440606"
						},
						{
							"label": "三水区",
							"position": [
								"112.899414",
								"23.16504"
							],
							"value": "440607"
						},
						{
							"label": "高明区",
							"position": [
								"112.882123",
								"22.893855"
							],
							"value": "440608"
						}
					]
				},
				{
					"label": "江门市",
					"position": [
						"113.094942",
						"22.590431"
					],
					"value": "440700",
					"children": [{
							"label": "蓬江区",
							"position": [
								"113.07859",
								"22.59677"
							],
							"value": "440703"
						},
						{
							"label": "江海区",
							"position": [
								"113.120601",
								"22.572211"
							],
							"value": "440704"
						},
						{
							"label": "新会区",
							"position": [
								"113.038584",
								"22.520247"
							],
							"value": "440705"
						},
						{
							"label": "台山市",
							"position": [
								"112.793414",
								"22.250713"
							],
							"value": "440781"
						},
						{
							"label": "开平市",
							"position": [
								"112.692262",
								"22.366286"
							],
							"value": "440783"
						},
						{
							"label": "鹤山市",
							"position": [
								"112.961795",
								"22.768104"
							],
							"value": "440784"
						},
						{
							"label": "恩平市",
							"position": [
								"112.314051",
								"22.182956"
							],
							"value": "440785"
						}
					]
				},
				{
					"label": "湛江市",
					"position": [
						"110.364977",
						"21.274898"
					],
					"value": "440800",
					"children": [{
							"label": "赤坎区",
							"position": [
								"110.361634",
								"21.273365"
							],
							"value": "440802"
						},
						{
							"label": "霞山区",
							"position": [
								"110.406382",
								"21.194229"
							],
							"value": "440803"
						},
						{
							"label": "坡头区",
							"position": [
								"110.455632",
								"21.24441"
							],
							"value": "440804"
						},
						{
							"label": "麻章区",
							"position": [
								"110.329167",
								"21.265997"
							],
							"value": "440811"
						},
						{
							"label": "遂溪县",
							"position": [
								"110.255321",
								"21.376915"
							],
							"value": "440823"
						},
						{
							"label": "徐闻县",
							"position": [
								"110.175718",
								"20.326083"
							],
							"value": "440825"
						},
						{
							"label": "廉江市",
							"position": [
								"110.284961",
								"21.611281"
							],
							"value": "440881"
						},
						{
							"label": "雷州市",
							"position": [
								"110.088275",
								"20.908523"
							],
							"value": "440882"
						},
						{
							"label": "吴川市",
							"position": [
								"110.780508",
								"21.428453"
							],
							"value": "440883"
						}
					]
				},
				{
					"label": "茂名市",
					"position": [
						"110.919229",
						"21.659751"
					],
					"value": "440900",
					"children": [{
							"label": "茂南区",
							"position": [
								"110.920542",
								"21.660425"
							],
							"value": "440902"
						},
						{
							"label": "电白区",
							"position": [
								"111.007264",
								"21.507219"
							],
							"value": "440904"
						},
						{
							"label": "高州市",
							"position": [
								"110.853251",
								"21.915153"
							],
							"value": "440981"
						},
						{
							"label": "化州市",
							"position": [
								"110.63839",
								"21.654953"
							],
							"value": "440982"
						},
						{
							"label": "信宜市",
							"position": [
								"110.941656",
								"22.352681"
							],
							"value": "440983"
						}
					]
				},
				{
					"label": "肇庆市",
					"position": [
						"112.472529",
						"23.051546"
					],
					"value": "441200",
					"children": [{
							"label": "端州区",
							"position": [
								"112.472329",
								"23.052662"
							],
							"value": "441202"
						},
						{
							"label": "鼎湖区",
							"position": [
								"112.565249",
								"23.155822"
							],
							"value": "441203"
						},
						{
							"label": "高要区",
							"position": [
								"112.460846",
								"23.027694"
							],
							"value": "441204"
						},
						{
							"label": "广宁县",
							"position": [
								"112.440419",
								"23.631486"
							],
							"value": "441223"
						},
						{
							"label": "怀集县",
							"position": [
								"112.182466",
								"23.913072"
							],
							"value": "441224"
						},
						{
							"label": "封开县",
							"position": [
								"111.502973",
								"23.434731"
							],
							"value": "441225"
						},
						{
							"label": "德庆县",
							"position": [
								"111.78156",
								"23.141711"
							],
							"value": "441226"
						},
						{
							"label": "四会市",
							"position": [
								"112.695028",
								"23.340324"
							],
							"value": "441284"
						}
					]
				},
				{
					"label": "惠州市",
					"position": [
						"114.412599",
						"23.079404"
					],
					"value": "441300",
					"children": [{
							"label": "惠城区",
							"position": [
								"114.413978",
								"23.079883"
							],
							"value": "441302"
						},
						{
							"label": "惠阳区",
							"position": [
								"114.469444",
								"22.78851"
							],
							"value": "441303"
						},
						{
							"label": "博罗县",
							"position": [
								"114.284254",
								"23.167575"
							],
							"value": "441322"
						},
						{
							"label": "惠东县",
							"position": [
								"114.723092",
								"22.983036"
							],
							"value": "441323"
						},
						{
							"label": "龙门县",
							"position": [
								"114.259986",
								"23.723894"
							],
							"value": "441324"
						}
					]
				},
				{
					"label": "梅州市",
					"position": [
						"116.117582",
						"24.299112"
					],
					"value": "441400",
					"children": [{
							"label": "梅江区",
							"position": [
								"116.12116",
								"24.302593"
							],
							"value": "441402"
						},
						{
							"label": "梅县区",
							"position": [
								"116.083482",
								"24.267825"
							],
							"value": "441403"
						},
						{
							"label": "大埔县",
							"position": [
								"116.69552",
								"24.351587"
							],
							"value": "441422"
						},
						{
							"label": "丰顺县",
							"position": [
								"116.184419",
								"23.752771"
							],
							"value": "441423"
						},
						{
							"label": "五华县",
							"position": [
								"115.775004",
								"23.925424"
							],
							"value": "441424"
						},
						{
							"label": "平远县",
							"position": [
								"115.891729",
								"24.569651"
							],
							"value": "441426"
						},
						{
							"label": "蕉岭县",
							"position": [
								"116.170531",
								"24.653313"
							],
							"value": "441427"
						},
						{
							"label": "兴宁市",
							"position": [
								"115.731648",
								"24.138077"
							],
							"value": "441481"
						}
					]
				},
				{
					"label": "汕尾市",
					"position": [
						"115.364238",
						"22.774485"
					],
					"value": "441500",
					"children": [{
							"label": "城区",
							"position": [
								"115.363667",
								"22.776227"
							],
							"value": "441502"
						},
						{
							"label": "海丰县",
							"position": [
								"115.337324",
								"22.971042"
							],
							"value": "441521"
						},
						{
							"label": "陆河县",
							"position": [
								"115.657565",
								"23.302682"
							],
							"value": "441523"
						},
						{
							"label": "陆丰市",
							"position": [
								"115.644203",
								"22.946104"
							],
							"value": "441581"
						}
					]
				},
				{
					"label": "河源市",
					"position": [
						"114.697802",
						"23.746266"
					],
					"value": "441600",
					"children": [{
							"label": "源城区",
							"position": [
								"114.696828",
								"23.746255"
							],
							"value": "441602"
						},
						{
							"label": "紫金县",
							"position": [
								"115.184383",
								"23.633744"
							],
							"value": "441621"
						},
						{
							"label": "龙川县",
							"position": [
								"115.256415",
								"24.101174"
							],
							"value": "441622"
						},
						{
							"label": "连平县",
							"position": [
								"114.495952",
								"24.364227"
							],
							"value": "441623"
						},
						{
							"label": "和平县",
							"position": [
								"114.941473",
								"24.44318"
							],
							"value": "441624"
						},
						{
							"label": "东源县",
							"position": [
								"114.742711",
								"23.789093"
							],
							"value": "441625"
						}
					]
				},
				{
					"label": "阳江市",
					"position": [
						"111.975107",
						"21.859222"
					],
					"value": "441700",
					"children": [{
							"label": "江城区",
							"position": [
								"111.968909",
								"21.859182"
							],
							"value": "441702"
						},
						{
							"label": "阳东区",
							"position": [
								"112.011267",
								"21.864728"
							],
							"value": "441704"
						},
						{
							"label": "阳西县",
							"position": [
								"111.617556",
								"21.75367"
							],
							"value": "441721"
						},
						{
							"label": "阳春市",
							"position": [
								"111.7905",
								"22.169598"
							],
							"value": "441781"
						}
					]
				},
				{
					"label": "清远市",
					"position": [
						"113.051227",
						"23.685022"
					],
					"value": "441800",
					"children": [{
							"label": "清城区",
							"position": [
								"113.048698",
								"23.688976"
							],
							"value": "441802"
						},
						{
							"label": "清新区",
							"position": [
								"113.015203",
								"23.736949"
							],
							"value": "441803"
						},
						{
							"label": "佛冈县",
							"position": [
								"113.534094",
								"23.866739"
							],
							"value": "441821"
						},
						{
							"label": "阳山县",
							"position": [
								"112.634019",
								"24.470286"
							],
							"value": "441823"
						},
						{
							"label": "连山壮族瑶族自治县",
							"position": [
								"112.086555",
								"24.567271"
							],
							"value": "441825"
						},
						{
							"label": "连南瑶族自治县",
							"position": [
								"112.290808",
								"24.719097"
							],
							"value": "441826"
						},
						{
							"label": "英德市",
							"position": [
								"113.405404",
								"24.18612"
							],
							"value": "441881"
						},
						{
							"label": "连州市",
							"position": [
								"112.379271",
								"24.783966"
							],
							"value": "441882"
						}
					]
				},
				{
					"label": "东莞市",
					"position": [
						"113.746262",
						"23.046237"
					],
					"value": "441900",
					"children": [{
							"label": "莞城街道",
							"position": [
								"113.743",
								"23.0225"
							],
							"value": "441900"
						},
						{
							"label": "常平镇",
							"position": [
								"114.036",
								"23.0074"
							],
							"value": "441900"
						},
						{
							"label": "望牛墩镇",
							"position": [
								"113.676",
								"23.0683"
							],
							"value": "441900"
						},
						{
							"label": "大朗镇",
							"position": [
								"113.939",
								"22.8654"
							],
							"value": "441900"
						},
						{
							"label": "麻涌镇",
							"position": [
								"113.562",
								"22.9718"
							],
							"value": "441900"
						},
						{
							"label": "东莞生态园",
							"position": [
								"113.917",
								"23.0806"
							],
							"value": "441900"
						},
						{
							"label": "桥头镇",
							"position": [
								"114.065",
								"23.0315"
							],
							"value": "441900"
						},
						{
							"label": "樟木头镇",
							"position": [
								"114.018",
								"22.8704"
							],
							"value": "441900"
						},
						{
							"label": "松山湖管委会",
							"position": [
								"113.875",
								"22.869"
							],
							"value": "441900"
						},
						{
							"label": "凤岗镇",
							"position": [
								"114.105",
								"22.7308"
							],
							"value": "441900"
						},
						{
							"label": "石龙镇",
							"position": [
								"113.833",
								"23.1123"
							],
							"value": "441900"
						},
						{
							"label": "高埗镇",
							"position": [
								"113.773",
								"23.112"
							],
							"value": "441900"
						},
						{
							"label": "塘厦镇",
							"position": [
								"114.05",
								"22.7713"
							],
							"value": "441900"
						},
						{
							"label": "寮步镇",
							"position": [
								"113.888",
								"22.9529"
							],
							"value": "441900"
						},
						{
							"label": "厚街镇",
							"position": [
								"113.776",
								"22.9097"
							],
							"value": "441900"
						},
						{
							"label": "谢岗镇",
							"position": [
								"114.128",
								"22.9901"
							],
							"value": "441900"
						},
						{
							"label": "虎门镇",
							"position": [
								"113.797",
								"22.8587"
							],
							"value": "441900"
						},
						{
							"label": "南城街道",
							"position": [
								"113.737",
								"23.0249"
							],
							"value": "441900"
						},
						{
							"label": "虎门港管委会",
							"position": [
								"113.562",
								"22.9718"
							],
							"value": "441900"
						},
						{
							"label": "横沥镇",
							"position": [
								"114.006",
								"23.0504"
							],
							"value": "441900"
						},
						{
							"label": "企石镇",
							"position": [
								"113.99",
								"23.0541"
							],
							"value": "441900"
						},
						{
							"label": "东坑镇",
							"position": [
								"113.918",
								"22.995"
							],
							"value": "441900"
						},
						{
							"label": "石排镇",
							"position": [
								"113.988",
								"23.068"
							],
							"value": "441900"
						},
						{
							"label": "东城街道",
							"position": [
								"113.757",
								"23.0485"
							],
							"value": "441900"
						},
						{
							"label": "洪梅镇",
							"position": [
								"113.607",
								"23.0155"
							],
							"value": "441900"
						},
						{
							"label": "沙田镇",
							"position": [
								"113.582",
								"22.9426"
							],
							"value": "441900"
						},
						{
							"label": "道滘镇",
							"position": [
								"113.692",
								"23.004"
							],
							"value": "441900"
						},
						{
							"label": "大岭山镇",
							"position": [
								"113.843",
								"22.9534"
							],
							"value": "441900"
						},
						{
							"label": "清溪镇",
							"position": [
								"114.11",
								"22.862"
							],
							"value": "441900"
						},
						{
							"label": "茶山镇",
							"position": [
								"113.839",
								"23.0813"
							],
							"value": "441900"
						},
						{
							"label": "中堂镇",
							"position": [
								"113.734",
								"23.1164"
							],
							"value": "441900"
						},
						{
							"label": "万江街道",
							"position": [
								"113.709",
								"23.0014"
							],
							"value": "441900"
						},
						{
							"label": "石碣镇",
							"position": [
								"113.846",
								"23.1024"
							],
							"value": "441900"
						},
						{
							"label": "长安镇",
							"position": [
								"113.714",
								"22.7863"
							],
							"value": "441900"
						},
						{
							"label": "黄江镇",
							"position": [
								"113.977",
								"22.8091"
							],
							"value": "441900"
						}
					]
				},
				{
					"label": "中山市",
					"position": [
						"113.382391",
						"22.521113"
					],
					"value": "442000",
					"children": [{
							"label": "三角镇",
							"position": [
								"113.416",
								"22.7079"
							],
							"value": "442000"
						},
						{
							"label": "横栏镇",
							"position": [
								"113.224",
								"22.6048"
							],
							"value": "442000"
						},
						{
							"label": "五桂山街道",
							"position": [
								"113.399",
								"22.4847"
							],
							"value": "442000"
						},
						{
							"label": "东升镇",
							"position": [
								"113.321",
								"22.5607"
							],
							"value": "442000"
						},
						{
							"label": "神湾镇",
							"position": [
								"113.376",
								"22.2768"
							],
							"value": "442000"
						},
						{
							"label": "火炬开发区街道",
							"position": [
								"113.42",
								"22.5577"
							],
							"value": "442000"
						},
						{
							"label": "小榄镇",
							"position": [
								"113.23",
								"22.7026"
							],
							"value": "442000"
						},
						{
							"label": "南朗镇",
							"position": [
								"113.482",
								"22.519"
							],
							"value": "442000"
						},
						{
							"label": "古镇镇",
							"position": [
								"113.167",
								"22.6751"
							],
							"value": "442000"
						},
						{
							"label": "民众镇",
							"position": [
								"113.499",
								"22.6855"
							],
							"value": "442000"
						},
						{
							"label": "港口镇",
							"position": [
								"113.354",
								"22.6027"
							],
							"value": "442000"
						},
						{
							"label": "三乡镇",
							"position": [
								"113.432",
								"22.3879"
							],
							"value": "442000"
						},
						{
							"label": "石岐区街道",
							"position": [
								"113.405",
								"22.5247"
							],
							"value": "442000"
						},
						{
							"label": "大涌镇",
							"position": [
								"113.297",
								"22.4834"
							],
							"value": "442000"
						},
						{
							"label": "南头镇",
							"position": [
								"113.328",
								"22.6882"
							],
							"value": "442000"
						},
						{
							"label": "黄圃镇",
							"position": [
								"113.329",
								"22.7457"
							],
							"value": "442000"
						},
						{
							"label": "东区街道",
							"position": [
								"113.4",
								"22.5274"
							],
							"value": "442000"
						},
						{
							"label": "阜沙镇",
							"position": [
								"113.34",
								"22.6406"
							],
							"value": "442000"
						},
						{
							"label": "西区街道",
							"position": [
								"113.314",
								"22.5649"
							],
							"value": "442000"
						},
						{
							"label": "坦洲镇",
							"position": [
								"113.38",
								"22.2868"
							],
							"value": "442000"
						},
						{
							"label": "板芙镇",
							"position": [
								"113.358",
								"22.4068"
							],
							"value": "442000"
						},
						{
							"label": "南区街道",
							"position": [
								"113.367",
								"22.4892"
							],
							"value": "442000"
						},
						{
							"label": "沙溪镇",
							"position": [
								"113.344",
								"22.5248"
							],
							"value": "442000"
						},
						{
							"label": "东凤镇",
							"position": [
								"113.308",
								"22.6803"
							],
							"value": "442000"
						}
					]
				},
				{
					"label": "潮州市",
					"position": [
						"116.632301",
						"23.661701"
					],
					"value": "445100",
					"children": [{
							"label": "湘桥区",
							"position": [
								"116.63365",
								"23.664675"
							],
							"value": "445102"
						},
						{
							"label": "潮安区",
							"position": [
								"116.67931",
								"23.461012"
							],
							"value": "445103"
						},
						{
							"label": "饶平县",
							"position": [
								"117.00205",
								"23.668171"
							],
							"value": "445122"
						}
					]
				},
				{
					"label": "揭阳市",
					"position": [
						"116.355733",
						"23.543778"
					],
					"value": "445200",
					"children": [{
							"label": "榕城区",
							"position": [
								"116.357045",
								"23.535524"
							],
							"value": "445202"
						},
						{
							"label": "揭东区",
							"position": [
								"116.412947",
								"23.569887"
							],
							"value": "445203"
						},
						{
							"label": "揭西县",
							"position": [
								"115.838708",
								"23.4273"
							],
							"value": "445222"
						},
						{
							"label": "惠来县",
							"position": [
								"116.295832",
								"23.029834"
							],
							"value": "445224"
						},
						{
							"label": "普宁市",
							"position": [
								"116.165082",
								"23.29788"
							],
							"value": "445281"
						}
					]
				},
				{
					"label": "云浮市",
					"position": [
						"112.044439",
						"22.929801"
					],
					"value": "445300",
					"children": [{
							"label": "云城区",
							"position": [
								"112.04471",
								"22.930827"
							],
							"value": "445302"
						},
						{
							"label": "云安区",
							"position": [
								"112.005609",
								"23.073152"
							],
							"value": "445303"
						},
						{
							"label": "新兴县",
							"position": [
								"112.23083",
								"22.703204"
							],
							"value": "445321"
						},
						{
							"label": "郁南县",
							"position": [
								"111.535921",
								"23.237709"
							],
							"value": "445322"
						},
						{
							"label": "罗定市",
							"position": [
								"111.578201",
								"22.765415"
							],
							"value": "445381"
						}
					]
				}
			]
		},
		{
			"label": "广西壮族自治区",
			"position": [
				"108.320004",
				"22.82402"
			],
			"value": "450000",
			"children": [{
					"label": "南宁市",
					"position": [
						"108.320004",
						"22.82402"
					],
					"value": "450100",
					"children": [{
							"label": "兴宁区",
							"position": [
								"108.320189",
								"22.819511"
							],
							"value": "450102"
						},
						{
							"label": "青秀区",
							"position": [
								"108.346113",
								"22.816614"
							],
							"value": "450103"
						},
						{
							"label": "江南区",
							"position": [
								"108.310478",
								"22.799593"
							],
							"value": "450105"
						},
						{
							"label": "西乡塘区",
							"position": [
								"108.306903",
								"22.832779"
							],
							"value": "450107"
						},
						{
							"label": "良庆区",
							"position": [
								"108.322102",
								"22.75909"
							],
							"value": "450108"
						},
						{
							"label": "邕宁区",
							"position": [
								"108.484251",
								"22.756598"
							],
							"value": "450109"
						},
						{
							"label": "武鸣区",
							"position": [
								"108.280717",
								"23.157163"
							],
							"value": "450110"
						},
						{
							"label": "隆安县",
							"position": [
								"107.688661",
								"23.174763"
							],
							"value": "450123"
						},
						{
							"label": "马山县",
							"position": [
								"108.172903",
								"23.711758"
							],
							"value": "450124"
						},
						{
							"label": "上林县",
							"position": [
								"108.603937",
								"23.431769"
							],
							"value": "450125"
						},
						{
							"label": "宾阳县",
							"position": [
								"108.816735",
								"23.216884"
							],
							"value": "450126"
						},
						{
							"label": "横县",
							"position": [
								"109.270987",
								"22.68743"
							],
							"value": "450127"
						}
					]
				},
				{
					"label": "柳州市",
					"position": [
						"109.411703",
						"24.314617"
					],
					"value": "450200",
					"children": [{
							"label": "城中区",
							"position": [
								"109.411749",
								"24.312324"
							],
							"value": "450202"
						},
						{
							"label": "鱼峰区",
							"position": [
								"109.415364",
								"24.303848"
							],
							"value": "450203"
						},
						{
							"label": "柳南区",
							"position": [
								"109.395936",
								"24.287013"
							],
							"value": "450204"
						},
						{
							"label": "柳北区",
							"position": [
								"109.406577",
								"24.359145"
							],
							"value": "450205"
						},
						{
							"label": "柳江区",
							"position": [
								"109.334503",
								"24.257512"
							],
							"value": "450206"
						},
						{
							"label": "柳城县",
							"position": [
								"109.245812",
								"24.655121"
							],
							"value": "450222"
						},
						{
							"label": "鹿寨县",
							"position": [
								"109.740805",
								"24.483405"
							],
							"value": "450223"
						},
						{
							"label": "融安县",
							"position": [
								"109.403621",
								"25.214703"
							],
							"value": "450224"
						},
						{
							"label": "融水苗族自治县",
							"position": [
								"109.252744",
								"25.068812"
							],
							"value": "450225"
						},
						{
							"label": "三江侗族自治县",
							"position": [
								"109.614846",
								"25.78553"
							],
							"value": "450226"
						}
					]
				},
				{
					"label": "桂林市",
					"position": [
						"110.299121",
						"25.274215"
					],
					"value": "450300",
					"children": [{
							"label": "秀峰区",
							"position": [
								"110.292445",
								"25.278544"
							],
							"value": "450302"
						},
						{
							"label": "叠彩区",
							"position": [
								"110.300783",
								"25.301334"
							],
							"value": "450303"
						},
						{
							"label": "象山区",
							"position": [
								"110.284882",
								"25.261986"
							],
							"value": "450304"
						},
						{
							"label": "七星区",
							"position": [
								"110.317577",
								"25.254339"
							],
							"value": "450305"
						},
						{
							"label": "雁山区",
							"position": [
								"110.305667",
								"25.077646"
							],
							"value": "450311"
						},
						{
							"label": "临桂区",
							"position": [
								"110.205487",
								"25.246257"
							],
							"value": "450312"
						},
						{
							"label": "阳朔县",
							"position": [
								"110.494699",
								"24.77534"
							],
							"value": "450321"
						},
						{
							"label": "灵川县",
							"position": [
								"110.325712",
								"25.408541"
							],
							"value": "450323"
						},
						{
							"label": "全州县",
							"position": [
								"111.072989",
								"25.929897"
							],
							"value": "450324"
						},
						{
							"label": "兴安县",
							"position": [
								"110.670783",
								"25.609554"
							],
							"value": "450325"
						},
						{
							"label": "永福县",
							"position": [
								"109.989208",
								"24.986692"
							],
							"value": "450326"
						},
						{
							"label": "灌阳县",
							"position": [
								"111.160248",
								"25.489098"
							],
							"value": "450327"
						},
						{
							"label": "龙胜各族自治县",
							"position": [
								"110.009423",
								"25.796428"
							],
							"value": "450328"
						},
						{
							"label": "资源县",
							"position": [
								"110.642587",
								"26.0342"
							],
							"value": "450329"
						},
						{
							"label": "平乐县",
							"position": [
								"110.642821",
								"24.632216"
							],
							"value": "450330"
						},
						{
							"label": "恭城瑶族自治县",
							"position": [
								"110.82952",
								"24.833612"
							],
							"value": "450332"
						},
						{
							"label": "荔浦市",
							"position": [
								"110.400149",
								"24.497786"
							],
							"value": "450381"
						}
					]
				},
				{
					"label": "梧州市",
					"position": [
						"111.297604",
						"23.474803"
					],
					"value": "450400",
					"children": [{
							"label": "万秀区",
							"position": [
								"111.315817",
								"23.471318"
							],
							"value": "450403"
						},
						{
							"label": "长洲区",
							"position": [
								"111.275678",
								"23.4777"
							],
							"value": "450405"
						},
						{
							"label": "龙圩区",
							"position": [
								"111.246035",
								"23.40996"
							],
							"value": "450406"
						},
						{
							"label": "苍梧县",
							"position": [
								"111.544008",
								"23.845097"
							],
							"value": "450421"
						},
						{
							"label": "藤县",
							"position": [
								"110.931826",
								"23.373963"
							],
							"value": "450422"
						},
						{
							"label": "蒙山县",
							"position": [
								"110.5226",
								"24.199829"
							],
							"value": "450423"
						},
						{
							"label": "岑溪市",
							"position": [
								"110.998114",
								"22.918406"
							],
							"value": "450481"
						}
					]
				},
				{
					"label": "北海市",
					"position": [
						"109.119254",
						"21.473343"
					],
					"value": "450500",
					"children": [{
							"label": "海城区",
							"position": [
								"109.107529",
								"21.468443"
							],
							"value": "450502"
						},
						{
							"label": "银海区",
							"position": [
								"109.118707",
								"21.444909"
							],
							"value": "450503"
						},
						{
							"label": "铁山港区",
							"position": [
								"109.450573",
								"21.5928"
							],
							"value": "450512"
						},
						{
							"label": "合浦县",
							"position": [
								"109.200695",
								"21.663554"
							],
							"value": "450521"
						}
					]
				},
				{
					"label": "防城港市",
					"position": [
						"108.345478",
						"21.614631"
					],
					"value": "450600",
					"children": [{
							"label": "港口区",
							"position": [
								"108.346281",
								"21.614406"
							],
							"value": "450602"
						},
						{
							"label": "防城区",
							"position": [
								"108.358426",
								"21.764758"
							],
							"value": "450603"
						},
						{
							"label": "上思县",
							"position": [
								"107.982139",
								"22.151423"
							],
							"value": "450621"
						},
						{
							"label": "东兴市",
							"position": [
								"107.97017",
								"21.541172"
							],
							"value": "450681"
						}
					]
				},
				{
					"label": "钦州市",
					"position": [
						"108.624175",
						"21.967127"
					],
					"value": "450700",
					"children": [{
							"label": "钦南区",
							"position": [
								"108.626629",
								"21.966808"
							],
							"value": "450702"
						},
						{
							"label": "钦北区",
							"position": [
								"108.44911",
								"22.132761"
							],
							"value": "450703"
						},
						{
							"label": "灵山县",
							"position": [
								"109.293468",
								"22.418041"
							],
							"value": "450721"
						},
						{
							"label": "浦北县",
							"position": [
								"109.556341",
								"22.268335"
							],
							"value": "450722"
						}
					]
				},
				{
					"label": "贵港市",
					"position": [
						"109.602146",
						"23.0936"
					],
					"value": "450800",
					"children": [{
							"label": "港北区",
							"position": [
								"109.59481",
								"23.107677"
							],
							"value": "450802"
						},
						{
							"label": "港南区",
							"position": [
								"109.604665",
								"23.067516"
							],
							"value": "450803"
						},
						{
							"label": "覃塘区",
							"position": [
								"109.415697",
								"23.132815"
							],
							"value": "450804"
						},
						{
							"label": "平南县",
							"position": [
								"110.397485",
								"23.544546"
							],
							"value": "450821"
						},
						{
							"label": "桂平市",
							"position": [
								"110.074668",
								"23.382473"
							],
							"value": "450881"
						}
					]
				},
				{
					"label": "玉林市",
					"position": [
						"110.154393",
						"22.63136"
					],
					"value": "450900",
					"children": [{
							"label": "玉州区",
							"position": [
								"110.154912",
								"22.632132"
							],
							"value": "450902"
						},
						{
							"label": "福绵区",
							"position": [
								"110.054155",
								"22.58163"
							],
							"value": "450903"
						},
						{
							"label": "容县",
							"position": [
								"110.552467",
								"22.856435"
							],
							"value": "450921"
						},
						{
							"label": "陆川县",
							"position": [
								"110.264842",
								"22.321054"
							],
							"value": "450922"
						},
						{
							"label": "博白县",
							"position": [
								"109.980004",
								"22.271285"
							],
							"value": "450923"
						},
						{
							"label": "兴业县",
							"position": [
								"109.877768",
								"22.74187"
							],
							"value": "450924"
						},
						{
							"label": "北流市",
							"position": [
								"110.348052",
								"22.701648"
							],
							"value": "450981"
						}
					]
				},
				{
					"label": "百色市",
					"position": [
						"106.616285",
						"23.897742"
					],
					"value": "451000",
					"children": [{
							"label": "右江区",
							"position": [
								"106.615727",
								"23.897675"
							],
							"value": "451002"
						},
						{
							"label": "田阳区",
							"position": [
								"106.904315",
								"23.736079"
							],
							"value": "451003"
						},
						{
							"label": "田东县",
							"position": [
								"107.12426",
								"23.600444"
							],
							"value": "451022"
						},
						{
							"label": "德保县",
							"position": [
								"106.618164",
								"23.321464"
							],
							"value": "451024"
						},
						{
							"label": "那坡县",
							"position": [
								"105.833553",
								"23.400785"
							],
							"value": "451026"
						},
						{
							"label": "凌云县",
							"position": [
								"106.56487",
								"24.345643"
							],
							"value": "451027"
						},
						{
							"label": "乐业县",
							"position": [
								"106.559638",
								"24.782204"
							],
							"value": "451028"
						},
						{
							"label": "田林县",
							"position": [
								"106.235047",
								"24.290262"
							],
							"value": "451029"
						},
						{
							"label": "西林县",
							"position": [
								"105.095025",
								"24.492041"
							],
							"value": "451030"
						},
						{
							"label": "隆林各族自治县",
							"position": [
								"105.342363",
								"24.774318"
							],
							"value": "451031"
						},
						{
							"label": "靖西市",
							"position": [
								"106.417549",
								"23.134766"
							],
							"value": "451081"
						},
						{
							"label": "平果市",
							"position": [
								"107.580403",
								"23.320479"
							],
							"value": "451082"
						}
					]
				},
				{
					"label": "贺州市",
					"position": [
						"111.552056",
						"24.414141"
					],
					"value": "451100",
					"children": [{
							"label": "八步区",
							"position": [
								"111.551991",
								"24.412446"
							],
							"value": "451102"
						},
						{
							"label": "平桂区",
							"position": [
								"111.524014",
								"24.417148"
							],
							"value": "451103"
						},
						{
							"label": "昭平县",
							"position": [
								"110.810865",
								"24.172958"
							],
							"value": "451121"
						},
						{
							"label": "钟山县",
							"position": [
								"111.303629",
								"24.528566"
							],
							"value": "451122"
						},
						{
							"label": "富川瑶族自治县",
							"position": [
								"111.277228",
								"24.81896"
							],
							"value": "451123"
						}
					]
				},
				{
					"label": "河池市",
					"position": [
						"108.062105",
						"24.695899"
					],
					"value": "451200",
					"children": [{
							"label": "金城江区",
							"position": [
								"108.062131",
								"24.695625"
							],
							"value": "451202"
						},
						{
							"label": "宜州区",
							"position": [
								"108.653965",
								"24.492193"
							],
							"value": "451203"
						},
						{
							"label": "南丹县",
							"position": [
								"107.546605",
								"24.983192"
							],
							"value": "451221"
						},
						{
							"label": "天峨县",
							"position": [
								"107.174939",
								"24.985964"
							],
							"value": "451222"
						},
						{
							"label": "凤山县",
							"position": [
								"107.044592",
								"24.544561"
							],
							"value": "451223"
						},
						{
							"label": "东兰县",
							"position": [
								"107.373696",
								"24.509367"
							],
							"value": "451224"
						},
						{
							"label": "罗城仫佬族自治县",
							"position": [
								"108.902453",
								"24.779327"
							],
							"value": "451225"
						},
						{
							"label": "环江毛南族自治县",
							"position": [
								"108.258669",
								"24.827628"
							],
							"value": "451226"
						},
						{
							"label": "巴马瑶族自治县",
							"position": [
								"107.253126",
								"24.139538"
							],
							"value": "451227"
						},
						{
							"label": "都安瑶族自治县",
							"position": [
								"108.102761",
								"23.934964"
							],
							"value": "451228"
						},
						{
							"label": "大化瑶族自治县",
							"position": [
								"107.9945",
								"23.739596"
							],
							"value": "451229"
						}
					]
				},
				{
					"label": "来宾市",
					"position": [
						"109.229772",
						"23.733766"
					],
					"value": "451300",
					"children": [{
							"label": "兴宾区",
							"position": [
								"109.230541",
								"23.732926"
							],
							"value": "451302"
						},
						{
							"label": "忻城县",
							"position": [
								"108.667361",
								"24.064779"
							],
							"value": "451321"
						},
						{
							"label": "象州县",
							"position": [
								"109.684555",
								"23.959824"
							],
							"value": "451322"
						},
						{
							"label": "武宣县",
							"position": [
								"109.66287",
								"23.604162"
							],
							"value": "451323"
						},
						{
							"label": "金秀瑶族自治县",
							"position": [
								"110.188556",
								"24.134941"
							],
							"value": "451324"
						},
						{
							"label": "合山市",
							"position": [
								"108.88858",
								"23.81311"
							],
							"value": "451381"
						}
					]
				},
				{
					"label": "崇左市",
					"position": [
						"107.353926",
						"22.404108"
					],
					"value": "451400",
					"children": [{
							"label": "江州区",
							"position": [
								"107.354443",
								"22.40469"
							],
							"value": "451402"
						},
						{
							"label": "扶绥县",
							"position": [
								"107.911533",
								"22.635821"
							],
							"value": "451421"
						},
						{
							"label": "宁明县",
							"position": [
								"107.067616",
								"22.131353"
							],
							"value": "451422"
						},
						{
							"label": "龙州县",
							"position": [
								"106.857502",
								"22.343716"
							],
							"value": "451423"
						},
						{
							"label": "大新县",
							"position": [
								"107.200803",
								"22.833369"
							],
							"value": "451424"
						},
						{
							"label": "天等县",
							"position": [
								"107.142441",
								"23.082484"
							],
							"value": "451425"
						},
						{
							"label": "凭祥市",
							"position": [
								"106.759038",
								"22.108882"
							],
							"value": "451481"
						}
					]
				}
			]
		},
		{
			"label": "海南省",
			"position": [
				"110.33119",
				"20.031971"
			],
			"value": "460000",
			"children": [{
					"label": "海口市",
					"position": [
						"110.33119",
						"20.031971"
					],
					"value": "460100",
					"children": [{
							"label": "秀英区",
							"position": [
								"110.282393",
								"20.008145"
							],
							"value": "460105"
						},
						{
							"label": "龙华区",
							"position": [
								"110.330373",
								"20.031026"
							],
							"value": "460106"
						},
						{
							"label": "琼山区",
							"position": [
								"110.354722",
								"20.001051"
							],
							"value": "460107"
						},
						{
							"label": "美兰区",
							"position": [
								"110.356566",
								"20.03074"
							],
							"value": "460108"
						}
					]
				},
				{
					"label": "三亚市",
					"position": [
						"109.508268",
						"18.247872"
					],
					"value": "460200",
					"children": [{
							"label": "海棠区",
							"position": [
								"109.760778",
								"18.407516"
							],
							"value": "460202"
						},
						{
							"label": "吉阳区",
							"position": [
								"109.512081",
								"18.247436"
							],
							"value": "460203"
						},
						{
							"label": "天涯区",
							"position": [
								"109.506357",
								"18.24734"
							],
							"value": "460204"
						},
						{
							"label": "崖州区",
							"position": [
								"109.174306",
								"18.352192"
							],
							"value": "460205"
						}
					]
				},
				{
					"label": "三沙市",
					"position": [
						"112.34882",
						"16.831039"
					],
					"value": "460300",
					"children": [{
							"label": "西沙区",
							"position": [
								"112.234483",
								"16.774644"
							],
							"value": "460301"
						},
						{
							"label": "南沙区",
							"position": [
								"112.891018",
								"9.543575"
							],
							"value": "460302"
						}
					]
				},
				{
					"label": "儋州市",
					"position": [
						"109.576782",
						"19.517486"
					],
					"value": "460400",
					"children": [{
							"label": "洋浦经济开发区",
							"position": [
								"109.162",
								"19.7962"
							],
							"value": "460400"
						},
						{
							"label": "兰洋镇",
							"position": [
								"109.682",
								"19.4833"
							],
							"value": "460400"
						},
						{
							"label": "和庆镇",
							"position": [
								"109.677",
								"19.5887"
							],
							"value": "460400"
						},
						{
							"label": "光村镇",
							"position": [
								"109.467",
								"19.9035"
							],
							"value": "460400"
						},
						{
							"label": "华南热作学院",
							"position": [
								"109.505",
								"19.573"
							],
							"value": "460400"
						},
						{
							"label": "海头镇",
							"position": [
								"108.948",
								"19.4939"
							],
							"value": "460400"
						},
						{
							"label": "东成镇",
							"position": [
								"109.579",
								"19.7102"
							],
							"value": "460400"
						},
						{
							"label": "国营蓝洋农场",
							"position": [
								"109.618",
								"19.5107"
							],
							"value": "460400"
						},
						{
							"label": "王五镇",
							"position": [
								"109.258",
								"19.6415"
							],
							"value": "460400"
						},
						{
							"label": "新州镇",
							"position": [
								"109.321",
								"19.7523"
							],
							"value": "460400"
						},
						{
							"label": "木棠镇",
							"position": [
								"109.33",
								"19.8594"
							],
							"value": "460400"
						},
						{
							"label": "排浦镇",
							"position": [
								"109.196",
								"19.65"
							],
							"value": "460400"
						},
						{
							"label": "中和镇",
							"position": [
								"109.351",
								"19.7747"
							],
							"value": "460400"
						},
						{
							"label": "雅星镇",
							"position": [
								"109.156",
								"19.4695"
							],
							"value": "460400"
						},
						{
							"label": "南丰镇",
							"position": [
								"109.532",
								"19.4981"
							],
							"value": "460400"
						},
						{
							"label": "国营八一农场",
							"position": [
								"109.23",
								"19.3915"
							],
							"value": "460400"
						},
						{
							"label": "国营西联农场",
							"position": [
								"109.537",
								"19.6556"
							],
							"value": "460400"
						},
						{
							"label": "国营西培农场",
							"position": [
								"109.31",
								"19.4969"
							],
							"value": "460400"
						},
						{
							"label": "那大镇",
							"position": [
								"109.573",
								"19.5907"
							],
							"value": "460400"
						},
						{
							"label": "白马井镇",
							"position": [
								"109.268",
								"19.7046"
							],
							"value": "460400"
						},
						{
							"label": "大成镇",
							"position": [
								"109.345",
								"19.4765"
							],
							"value": "460400"
						},
						{
							"label": "峨蔓镇",
							"position": [
								"109.333",
								"19.8438"
							],
							"value": "460400"
						},
						{
							"label": "三都镇",
							"position": [
								"109.176",
								"19.7946"
							],
							"value": "460400"
						}
					]
				},
				{
					"label": "五指山市",
					"position": [
						"109.516662",
						"18.776921"
					],
					"value": "469001",
					"children": [{
							"label": "南圣镇",
							"position": [
								"109.687",
								"18.8266"
							],
							"value": "469001"
						},
						{
							"label": "毛阳镇",
							"position": [
								"109.45",
								"18.8811"
							],
							"value": "469001"
						},
						{
							"label": "通什镇",
							"position": [
								"109.614",
								"18.8418"
							],
							"value": "469001"
						},
						{
							"label": "水满乡",
							"position": [
								"109.601",
								"18.8995"
							],
							"value": "469001"
						},
						{
							"label": "番阳镇",
							"position": [
								"109.334",
								"18.9132"
							],
							"value": "469001"
						},
						{
							"label": "畅好乡",
							"position": [
								"109.397",
								"18.6549"
							],
							"value": "469001"
						},
						{
							"label": "毛道乡",
							"position": [
								"109.356",
								"18.7134"
							],
							"value": "469001"
						},
						{
							"label": "国营畅好农场",
							"position": [
								"109.523",
								"18.7089"
							],
							"value": "469001"
						}
					]
				},
				{
					"label": "琼海市",
					"position": [
						"110.466785",
						"19.246011"
					],
					"value": "469002",
					"children": [{
							"label": "嘉积镇",
							"position": [
								"110.441",
								"19.3208"
							],
							"value": "469002"
						},
						{
							"label": "会山镇",
							"position": [
								"110.302",
								"19.0792"
							],
							"value": "469002"
						},
						{
							"label": "国营东升农场",
							"position": [
								"110.413",
								"19.284"
							],
							"value": "469002"
						},
						{
							"label": "万泉镇",
							"position": [
								"110.364",
								"19.2516"
							],
							"value": "469002"
						},
						{
							"label": "国营东红农场",
							"position": [
								"110.509",
								"19.364"
							],
							"value": "469002"
						},
						{
							"label": "国营东太农场",
							"position": [
								"110.367",
								"19.1372"
							],
							"value": "469002"
						},
						{
							"label": "彬村山华侨农场",
							"position": [
								"110.623",
								"19.3022"
							],
							"value": "469002"
						},
						{
							"label": "大路镇",
							"position": [
								"110.424",
								"19.354"
							],
							"value": "469002"
						},
						{
							"label": "潭门镇",
							"position": [
								"110.546",
								"19.2013"
							],
							"value": "469002"
						},
						{
							"label": "中原镇",
							"position": [
								"110.419",
								"19.1765"
							],
							"value": "469002"
						},
						{
							"label": "阳江镇",
							"position": [
								"110.334",
								"19.0558"
							],
							"value": "469002"
						},
						{
							"label": "塔洋镇",
							"position": [
								"110.475",
								"19.3404"
							],
							"value": "469002"
						},
						{
							"label": "石壁镇",
							"position": [
								"110.168",
								"19.167"
							],
							"value": "469002"
						},
						{
							"label": "龙江镇",
							"position": [
								"110.36",
								"19.1595"
							],
							"value": "469002"
						},
						{
							"label": "长坡镇",
							"position": [
								"110.594",
								"19.3213"
							],
							"value": "469002"
						},
						{
							"label": "博鳌镇",
							"position": [
								"110.495",
								"19.1766"
							],
							"value": "469002"
						}
					]
				},
				{
					"label": "文昌市",
					"position": [
						"110.753975",
						"19.612986"
					],
					"value": "469005",
					"children": [{
							"label": "国营罗豆农场",
							"position": [
								"110.624",
								"19.9713"
							],
							"value": "469005"
						},
						{
							"label": "文教镇",
							"position": [
								"110.856",
								"19.7083"
							],
							"value": "469005"
						},
						{
							"label": "东阁镇",
							"position": [
								"110.799",
								"19.7566"
							],
							"value": "469005"
						},
						{
							"label": "国营东路农场",
							"position": [
								"110.714",
								"19.8524"
							],
							"value": "469005"
						},
						{
							"label": "会文镇",
							"position": [
								"110.708",
								"19.4957"
							],
							"value": "469005"
						},
						{
							"label": "铺前镇",
							"position": [
								"110.675",
								"20.0377"
							],
							"value": "469005"
						},
						{
							"label": "锦山镇",
							"position": [
								"110.67",
								"20.0418"
							],
							"value": "469005"
						},
						{
							"label": "翁田镇",
							"position": [
								"110.813",
								"19.9295"
							],
							"value": "469005"
						},
						{
							"label": "冯坡镇",
							"position": [
								"110.774",
								"20.0176"
							],
							"value": "469005"
						},
						{
							"label": "龙楼镇",
							"position": [
								"110.938",
								"19.6606"
							],
							"value": "469005"
						},
						{
							"label": "国营南阳农场",
							"position": [
								"110.556",
								"19.4727"
							],
							"value": "469005"
						},
						{
							"label": "东郊镇",
							"position": [
								"110.91",
								"19.6291"
							],
							"value": "469005"
						},
						{
							"label": "昌洒镇",
							"position": [
								"111.26",
								"19.9626"
							],
							"value": "469005"
						},
						{
							"label": "公坡镇",
							"position": [
								"110.836",
								"19.8543"
							],
							"value": "469005"
						},
						{
							"label": "重兴镇",
							"position": [
								"110.654",
								"19.4341"
							],
							"value": "469005"
						},
						{
							"label": "东路镇",
							"position": [
								"110.658",
								"19.8051"
							],
							"value": "469005"
						},
						{
							"label": "文城镇",
							"position": [
								"110.708",
								"19.4982"
							],
							"value": "469005"
						},
						{
							"label": "抱罗镇",
							"position": [
								"110.73",
								"19.889"
							],
							"value": "469005"
						},
						{
							"label": "潭牛镇",
							"position": [
								"110.623",
								"19.6785"
							],
							"value": "469005"
						},
						{
							"label": "蓬莱镇",
							"position": [
								"110.638",
								"19.5164"
							],
							"value": "469005"
						}
					]
				},
				{
					"label": "万宁市",
					"position": [
						"110.388793",
						"18.796216"
					],
					"value": "469006",
					"children": [{
							"label": "国营东兴农场",
							"position": [
								"110.375",
								"18.894"
							],
							"value": "469006"
						},
						{
							"label": "万城镇",
							"position": [
								"110.414",
								"18.8276"
							],
							"value": "469006"
						},
						{
							"label": "后安镇",
							"position": [
								"110.374",
								"18.9087"
							],
							"value": "469006"
						},
						{
							"label": "礼纪镇",
							"position": [
								"110.269",
								"18.7354"
							],
							"value": "469006"
						},
						{
							"label": "山根镇",
							"position": [
								"110.483",
								"18.9946"
							],
							"value": "469006"
						},
						{
							"label": "国营东和农场",
							"position": [
								"110.217",
								"18.7629"
							],
							"value": "469006"
						},
						{
							"label": "大茂镇",
							"position": [
								"110.39",
								"18.8759"
							],
							"value": "469006"
						},
						{
							"label": "龙滚镇",
							"position": [
								"110.495",
								"18.9855"
							],
							"value": "469006"
						},
						{
							"label": "和乐镇",
							"position": [
								"110.416",
								"18.9625"
							],
							"value": "469006"
						},
						{
							"label": "兴隆华侨农场",
							"position": [
								"110.106",
								"18.8195"
							],
							"value": "469006"
						},
						{
							"label": "三更罗镇",
							"position": [
								"110.214",
								"18.9979"
							],
							"value": "469006"
						},
						{
							"label": "长丰镇",
							"position": [
								"110.321",
								"18.7876"
							],
							"value": "469006"
						},
						{
							"label": "地方国营六连林场",
							"position": [
								"110.505",
								"18.9899"
							],
							"value": "469006"
						},
						{
							"label": "南桥镇",
							"position": [
								"110.196",
								"18.7201"
							],
							"value": "469006"
						},
						{
							"label": "北大镇",
							"position": [
								"110.24",
								"18.9316"
							],
							"value": "469006"
						},
						{
							"label": "东澳镇",
							"position": [
								"110.429",
								"18.6408"
							],
							"value": "469006"
						},
						{
							"label": "国营新中农场",
							"position": [
								"110.17",
								"18.6967"
							],
							"value": "469006"
						}
					]
				},
				{
					"label": "东方市",
					"position": [
						"108.653789",
						"19.10198"
					],
					"value": "469007",
					"children": [{
							"label": "江边乡",
							"position": [
								"109.108",
								"18.8945"
							],
							"value": "469007"
						},
						{
							"label": "东方华侨农场",
							"position": [
								"108.696",
								"18.9726"
							],
							"value": "469007"
						},
						{
							"label": "天安乡",
							"position": [
								"108.817",
								"18.8803"
							],
							"value": "469007"
						},
						{
							"label": "东河镇",
							"position": [
								"108.991",
								"19.1321"
							],
							"value": "469007"
						},
						{
							"label": "新龙镇",
							"position": [
								"108.686",
								"18.9263"
							],
							"value": "469007"
						},
						{
							"label": "国营广坝农场",
							"position": [
								"108.732",
								"18.8589"
							],
							"value": "469007"
						},
						{
							"label": "感城镇",
							"position": [
								"108.83",
								"18.8833"
							],
							"value": "469007"
						},
						{
							"label": "三家镇",
							"position": [
								"108.798",
								"19.2498"
							],
							"value": "469007"
						},
						{
							"label": "四更镇",
							"position": [
								"108.606",
								"19.2646"
							],
							"value": "469007"
						},
						{
							"label": "板桥镇",
							"position": [
								"108.87",
								"18.8744"
							],
							"value": "469007"
						},
						{
							"label": "八所镇",
							"position": [
								"108.622",
								"19.0927"
							],
							"value": "469007"
						},
						{
							"label": "大田镇",
							"position": [
								"108.976",
								"19.1314"
							],
							"value": "469007"
						}
					]
				},
				{
					"label": "定安县",
					"position": [
						"110.349235",
						"19.684966"
					],
					"value": "469021",
					"children": [{
							"label": "新竹镇",
							"position": [
								"110.159",
								"19.5843"
							],
							"value": "469021"
						},
						{
							"label": "富文镇",
							"position": [
								"110.232",
								"19.521"
							],
							"value": "469021"
						},
						{
							"label": "国营中瑞农场",
							"position": [
								"110.244",
								"19.3008"
							],
							"value": "469021"
						},
						{
							"label": "黄竹镇",
							"position": [
								"110.528",
								"19.4887"
							],
							"value": "469021"
						},
						{
							"label": "定城镇",
							"position": [
								"110.317",
								"19.7017"
							],
							"value": "469021"
						},
						{
							"label": "岭口镇",
							"position": [
								"110.276",
								"19.3601"
							],
							"value": "469021"
						},
						{
							"label": "雷鸣镇",
							"position": [
								"110.273",
								"19.5137"
							],
							"value": "469021"
						},
						{
							"label": "国营南海农场",
							"position": [
								"110.469",
								"19.4432"
							],
							"value": "469021"
						},
						{
							"label": "翰林镇",
							"position": [
								"110.24",
								"19.2982"
							],
							"value": "469021"
						},
						{
							"label": "国营金鸡岭农场",
							"position": [
								"110.252",
								"19.5171"
							],
							"value": "469021"
						},
						{
							"label": "龙门镇",
							"position": [
								"110.298",
								"19.4997"
							],
							"value": "469021"
						},
						{
							"label": "龙河镇",
							"position": [
								"110.226",
								"19.4221"
							],
							"value": "469021"
						},
						{
							"label": "龙湖镇",
							"position": [
								"110.469",
								"19.5845"
							],
							"value": "469021"
						}
					]
				},
				{
					"label": "屯昌县",
					"position": [
						"110.102773",
						"19.362916"
					],
					"value": "469022",
					"children": [{
							"label": "国营中建农场",
							"position": [
								"109.966",
								"19.2466"
							],
							"value": "469022"
						},
						{
							"label": "屯城镇",
							"position": [
								"110.161",
								"19.4468"
							],
							"value": "469022"
						},
						{
							"label": "南吕镇",
							"position": [
								"110.05",
								"19.2222"
							],
							"value": "469022"
						},
						{
							"label": "新兴镇",
							"position": [
								"110.154",
								"19.5707"
							],
							"value": "469022"
						},
						{
							"label": "国营中坤农场",
							"position": [
								"109.855",
								"19.2944"
							],
							"value": "469022"
						},
						{
							"label": "西昌镇",
							"position": [
								"110.024",
								"19.4428"
							],
							"value": "469022"
						},
						{
							"label": "坡心镇",
							"position": [
								"110.11",
								"19.3302"
							],
							"value": "469022"
						},
						{
							"label": "枫木镇",
							"position": [
								"109.994",
								"19.1901"
							],
							"value": "469022"
						},
						{
							"label": "南坤镇",
							"position": [
								"109.857",
								"19.2939"
							],
							"value": "469022"
						},
						{
							"label": "乌坡镇",
							"position": [
								"110.093",
								"19.1953"
							],
							"value": "469022"
						}
					]
				},
				{
					"label": "澄迈县",
					"position": [
						"110.007147",
						"19.737095"
					],
					"value": "469023",
					"children": [{
							"label": "福山镇",
							"position": [
								"109.919",
								"19.7325"
							],
							"value": "469023"
						},
						{
							"label": "桥头镇",
							"position": [
								"109.931",
								"19.9171"
							],
							"value": "469023"
						},
						{
							"label": "永发镇",
							"position": [
								"110.186",
								"19.6424"
							],
							"value": "469023"
						},
						{
							"label": "金江镇",
							"position": [
								"109.987",
								"19.7817"
							],
							"value": "469023"
						},
						{
							"label": "文儒镇",
							"position": [
								"110.121",
								"19.6454"
							],
							"value": "469023"
						},
						{
							"label": "中兴镇",
							"position": [
								"109.938",
								"19.5697"
							],
							"value": "469023"
						},
						{
							"label": "老城镇",
							"position": [
								"110.159",
								"19.9529"
							],
							"value": "469023"
						},
						{
							"label": "国营红岗农场",
							"position": [
								"110.038",
								"19.5642"
							],
							"value": "469023"
						},
						{
							"label": "瑞溪镇",
							"position": [
								"110.087",
								"19.7731"
							],
							"value": "469023"
						},
						{
							"label": "国营红光农场",
							"position": [
								"109.957",
								"19.8731"
							],
							"value": "469023"
						},
						{
							"label": "加乐镇",
							"position": [
								"110.042",
								"19.6276"
							],
							"value": "469023"
						},
						{
							"label": "国营和岭农场",
							"position": [
								"109.814",
								"19.5367"
							],
							"value": "469023"
						},
						{
							"label": "国营金安农场",
							"position": [
								"110.123",
								"19.7367"
							],
							"value": "469023"
						},
						{
							"label": "大丰镇",
							"position": [
								"109.989",
								"19.904"
							],
							"value": "469023"
						},
						{
							"label": "国营西达农场",
							"position": [
								"109.862",
								"19.4343"
							],
							"value": "469023"
						},
						{
							"label": "仁兴镇",
							"position": [
								"109.916",
								"19.5062"
							],
							"value": "469023"
						},
						{
							"label": "国营昆仑农场",
							"position": [
								"109.802",
								"19.5127"
							],
							"value": "469023"
						}
					]
				},
				{
					"label": "临高县",
					"position": [
						"109.687697",
						"19.908293"
					],
					"value": "469024",
					"children": [{
							"label": "南宝镇",
							"position": [
								"109.638",
								"19.7516"
							],
							"value": "469024"
						},
						{
							"label": "博厚镇",
							"position": [
								"109.716",
								"19.893"
							],
							"value": "469024"
						},
						{
							"label": "调楼镇",
							"position": [
								"109.61",
								"19.9231"
							],
							"value": "469024"
						},
						{
							"label": "和舍镇",
							"position": [
								"109.715",
								"19.6717"
							],
							"value": "469024"
						},
						{
							"label": "东英镇",
							"position": [
								"109.613",
								"19.9349"
							],
							"value": "469024"
						},
						{
							"label": "临城镇",
							"position": [
								"109.673",
								"19.8932"
							],
							"value": "469024"
						},
						{
							"label": "波莲镇",
							"position": [
								"109.615",
								"19.8555"
							],
							"value": "469024"
						},
						{
							"label": "多文镇",
							"position": [
								"109.802",
								"19.7418"
							],
							"value": "469024"
						},
						{
							"label": "国营红华农场",
							"position": [
								"109.764",
								"19.8244"
							],
							"value": "469024"
						},
						{
							"label": "国营加来农场",
							"position": [
								"109.651",
								"19.7591"
							],
							"value": "469024"
						},
						{
							"label": "新盈镇",
							"position": [
								"109.624",
								"19.8719"
							],
							"value": "469024"
						},
						{
							"label": "皇桐镇",
							"position": [
								"109.816",
								"19.8743"
							],
							"value": "469024"
						}
					]
				},
				{
					"label": "白沙黎族自治县",
					"position": [
						"109.452606",
						"19.224584"
					],
					"value": "469025",
					"children": [{
							"label": "七坊镇",
							"position": [
								"109.298",
								"19.3459"
							],
							"value": "469025"
						},
						{
							"label": "荣邦乡",
							"position": [
								"109.064",
								"19.4868"
							],
							"value": "469025"
						},
						{
							"label": "金波乡",
							"position": [
								"109.157",
								"19.2577"
							],
							"value": "469025"
						},
						{
							"label": "南开乡",
							"position": [
								"109.293",
								"19.0596"
							],
							"value": "469025"
						},
						{
							"label": "青松乡",
							"position": [
								"109.302",
								"19.0689"
							],
							"value": "469025"
						},
						{
							"label": "邦溪镇",
							"position": [
								"109.09",
								"19.3912"
							],
							"value": "469025"
						},
						{
							"label": "国营龙江农场",
							"position": [
								"109.178",
								"19.2369"
							],
							"value": "469025"
						},
						{
							"label": "细水乡",
							"position": [
								"109.523",
								"19.2096"
							],
							"value": "469025"
						},
						{
							"label": "元门乡",
							"position": [
								"109.455",
								"19.0981"
							],
							"value": "469025"
						},
						{
							"label": "打安镇",
							"position": [
								"109.36",
								"19.3756"
							],
							"value": "469025"
						},
						{
							"label": "阜龙乡",
							"position": [
								"109.436",
								"19.3316"
							],
							"value": "469025"
						},
						{
							"label": "牙叉镇",
							"position": [
								"109.45",
								"19.3004"
							],
							"value": "469025"
						},
						{
							"label": "国营白沙农场",
							"position": [
								"109.429",
								"19.2881"
							],
							"value": "469025"
						},
						{
							"label": "国营邦溪农场",
							"position": [
								"109.18",
								"19.4104"
							],
							"value": "469025"
						}
					]
				},
				{
					"label": "昌江黎族自治县",
					"position": [
						"109.053351",
						"19.260968"
					],
					"value": "469026",
					"children": [{
							"label": "国营霸王岭林场",
							"position": [
								"109.03",
								"19.1725"
							],
							"value": "469026"
						},
						{
							"label": "乌烈镇",
							"position": [
								"108.81",
								"19.3525"
							],
							"value": "469026"
						},
						{
							"label": "海南矿业联合有限公司",
							"position": [
								"108.989",
								"19.2538"
							],
							"value": "469026"
						},
						{
							"label": "十月田镇",
							"position": [
								"108.989",
								"19.3818"
							],
							"value": "469026"
						},
						{
							"label": "七叉镇",
							"position": [
								"109.069",
								"19.1732"
							],
							"value": "469026"
						},
						{
							"label": "叉河镇",
							"position": [
								"108.989",
								"19.2536"
							],
							"value": "469026"
						},
						{
							"label": "石碌镇",
							"position": [
								"109.05",
								"19.2444"
							],
							"value": "469026"
						},
						{
							"label": "海尾镇",
							"position": [
								"108.952",
								"19.4945"
							],
							"value": "469026"
						},
						{
							"label": "昌化镇",
							"position": [
								"108.732",
								"19.3836"
							],
							"value": "469026"
						},
						{
							"label": "国营红林农场",
							"position": [
								"109.088",
								"19.2367"
							],
							"value": "469026"
						},
						{
							"label": "王下乡",
							"position": [
								"109.094",
								"18.9052"
							],
							"value": "469026"
						}
					]
				},
				{
					"label": "乐东黎族自治县",
					"position": [
						"109.175444",
						"18.74758"
					],
					"value": "469027",
					"children": [{
							"label": "万冲镇",
							"position": [
								"109.339",
								"18.7838"
							],
							"value": "469027"
						},
						{
							"label": "国营山荣农场",
							"position": [
								"109.223",
								"18.7507"
							],
							"value": "469027"
						},
						{
							"label": "利国镇",
							"position": [
								"108.965",
								"18.529"
							],
							"value": "469027"
						},
						{
							"label": "莺歌海镇",
							"position": [
								"108.728",
								"18.4959"
							],
							"value": "469027"
						},
						{
							"label": "国营保国农场",
							"position": [
								"109.245",
								"18.6612"
							],
							"value": "469027"
						},
						{
							"label": "抱由镇",
							"position": [
								"109.138",
								"18.8948"
							],
							"value": "469027"
						},
						{
							"label": "国营乐光农场",
							"position": [
								"109.192",
								"18.5331"
							],
							"value": "469027"
						},
						{
							"label": "九所镇",
							"position": [
								"108.927",
								"18.5276"
							],
							"value": "469027"
						},
						{
							"label": "大安镇",
							"position": [
								"109.225",
								"18.5876"
							],
							"value": "469027"
						},
						{
							"label": "国营莺歌海盐场",
							"position": [
								"108.729",
								"18.5523"
							],
							"value": "469027"
						},
						{
							"label": "佛罗镇",
							"position": [
								"108.792",
								"18.5833"
							],
							"value": "469027"
						},
						{
							"label": "国营尖峰岭林业公司",
							"position": [
								"109.027",
								"18.726"
							],
							"value": "469027"
						},
						{
							"label": "黄流镇",
							"position": [
								"108.808",
								"18.597"
							],
							"value": "469027"
						},
						{
							"label": "志仲镇",
							"position": [
								"109.224",
								"18.5932"
							],
							"value": "469027"
						},
						{
							"label": "千家镇",
							"position": [
								"109.15",
								"18.6353"
							],
							"value": "469027"
						},
						{
							"label": "尖峰镇",
							"position": [
								"108.7",
								"18.7124"
							],
							"value": "469027"
						}
					]
				},
				{
					"label": "陵水黎族自治县",
					"position": [
						"110.037218",
						"18.505006"
					],
					"value": "469028",
					"children": [{
							"label": "黎安镇",
							"position": [
								"110.146",
								"18.4342"
							],
							"value": "469028"
						},
						{
							"label": "国营吊罗山林业公司",
							"position": [
								"109.948",
								"18.6553"
							],
							"value": "469028"
						},
						{
							"label": "新村镇",
							"position": [
								"110.026",
								"18.446"
							],
							"value": "469028"
						},
						{
							"label": "国营南平农场",
							"position": [
								"109.833",
								"18.6336"
							],
							"value": "469028"
						},
						{
							"label": "文罗镇",
							"position": [
								"109.914",
								"18.5734"
							],
							"value": "469028"
						},
						{
							"label": "椰林镇",
							"position": [
								"110.02",
								"18.4825"
							],
							"value": "469028"
						},
						{
							"label": "本号镇",
							"position": [
								"109.856",
								"18.6617"
							],
							"value": "469028"
						},
						{
							"label": "群英乡",
							"position": [
								"109.847",
								"18.5697"
							],
							"value": "469028"
						},
						{
							"label": "提蒙乡",
							"position": [
								"110.013",
								"18.6404"
							],
							"value": "469028"
						},
						{
							"label": "光坡镇",
							"position": [
								"110.04",
								"18.5564"
							],
							"value": "469028"
						},
						{
							"label": "三才镇",
							"position": [
								"109.963",
								"18.4915"
							],
							"value": "469028"
						},
						{
							"label": "隆广镇",
							"position": [
								"109.858",
								"18.4802"
							],
							"value": "469028"
						},
						{
							"label": "英州镇",
							"position": [
								"109.876",
								"18.4739"
							],
							"value": "469028"
						},
						{
							"label": "国营岭门农场",
							"position": [
								"110.046",
								"18.6244"
							],
							"value": "469028"
						}
					]
				},
				{
					"label": "保亭黎族苗族自治县",
					"position": [
						"109.70245",
						"18.636371"
					],
					"value": "469029",
					"children": [{
							"label": "海南保亭热带作物研究所",
							"position": [
								"109.709",
								"18.6282"
							],
							"value": "469029"
						},
						{
							"label": "国营金江农场",
							"position": [
								"109.682",
								"18.547"
							],
							"value": "469029"
						},
						{
							"label": "新政镇",
							"position": [
								"109.578",
								"18.5685"
							],
							"value": "469029"
						},
						{
							"label": "加茂镇",
							"position": [
								"109.719",
								"18.5033"
							],
							"value": "469029"
						},
						{
							"label": "南林乡",
							"position": [
								"109.577",
								"18.3893"
							],
							"value": "469029"
						},
						{
							"label": "国营新星农场",
							"position": [
								"109.729",
								"18.6749"
							],
							"value": "469029"
						},
						{
							"label": "保城镇",
							"position": [
								"109.747",
								"18.6854"
							],
							"value": "469029"
						},
						{
							"label": "国营三道农场",
							"position": [
								"109.649",
								"18.5179"
							],
							"value": "469029"
						},
						{
							"label": "毛感乡",
							"position": [
								"109.503",
								"18.5563"
							],
							"value": "469029"
						},
						{
							"label": "什玲镇",
							"position": [
								"109.74",
								"18.6941"
							],
							"value": "469029"
						},
						{
							"label": "六弓乡",
							"position": [
								"109.803",
								"18.5393"
							],
							"value": "469029"
						},
						{
							"label": "响水镇",
							"position": [
								"109.61",
								"18.5626"
							],
							"value": "469029"
						},
						{
							"label": "三道镇",
							"position": [
								"109.66",
								"18.5251"
							],
							"value": "469029"
						}
					]
				},
				{
					"label": "琼中黎族苗族自治县",
					"position": [
						"109.839996",
						"19.03557"
					],
					"value": "469030",
					"children": [{
							"label": "湾岭镇",
							"position": [
								"109.9",
								"19.1334"
							],
							"value": "469030"
						},
						{
							"label": "吊罗山乡",
							"position": [
								"109.917",
								"18.8198"
							],
							"value": "469030"
						},
						{
							"label": "什运乡",
							"position": [
								"109.583",
								"18.9237"
							],
							"value": "469030"
						},
						{
							"label": "和平镇",
							"position": [
								"109.894",
								"18.899"
							],
							"value": "469030"
						},
						{
							"label": "国营乌石农场",
							"position": [
								"109.937",
								"19.0977"
							],
							"value": "469030"
						},
						{
							"label": "国营加钗农场",
							"position": [
								"109.783",
								"19.0265"
							],
							"value": "469030"
						},
						{
							"label": "国营阳江农场",
							"position": [
								"109.823",
								"19.2127"
							],
							"value": "469030"
						},
						{
							"label": "营根镇",
							"position": [
								"109.733",
								"18.9748"
							],
							"value": "469030"
						},
						{
							"label": "上安乡",
							"position": [
								"109.731",
								"18.9133"
							],
							"value": "469030"
						},
						{
							"label": "国营黎母山林业公司",
							"position": [
								"109.703",
								"19.1542"
							],
							"value": "469030"
						},
						{
							"label": "中平镇",
							"position": [
								"110.107",
								"19.0716"
							],
							"value": "469030"
						},
						{
							"label": "长征镇",
							"position": [
								"109.799",
								"18.8976"
							],
							"value": "469030"
						},
						{
							"label": "国营长征农场",
							"position": [
								"109.899",
								"18.9965"
							],
							"value": "469030"
						},
						{
							"label": "红毛镇",
							"position": [
								"109.734",
								"19.0657"
							],
							"value": "469030"
						},
						{
							"label": "黎母山镇",
							"position": [
								"109.704",
								"19.2577"
							],
							"value": "469030"
						}
					]
				}
			]
		},
		{
			"label": "重庆市",
			"position": [
				"106.504962",
				"29.533155"
			],
			"value": "500000",
			"children": [{
					"label": "重庆城区",
					"position": [
						"106.504962",
						"29.533155"
					],
					"value": "500100",
					"children": [{
							"label": "万州区",
							"position": [
								"108.380246",
								"30.807807"
							],
							"value": "500101"
						},
						{
							"label": "涪陵区",
							"position": [
								"107.394905",
								"29.703652"
							],
							"value": "500102"
						},
						{
							"label": "渝中区",
							"position": [
								"106.56288",
								"29.556742"
							],
							"value": "500103"
						},
						{
							"label": "大渡口区",
							"position": [
								"106.48613",
								"29.481002"
							],
							"value": "500104"
						},
						{
							"label": "江北区",
							"position": [
								"106.532844",
								"29.575352"
							],
							"value": "500105"
						},
						{
							"label": "沙坪坝区",
							"position": [
								"106.4542",
								"29.541224"
							],
							"value": "500106"
						},
						{
							"label": "九龙坡区",
							"position": [
								"106.480989",
								"29.523492"
							],
							"value": "500107"
						},
						{
							"label": "南岸区",
							"position": [
								"106.560813",
								"29.523992"
							],
							"value": "500108"
						},
						{
							"label": "北碚区",
							"position": [
								"106.437868",
								"29.82543"
							],
							"value": "500109"
						},
						{
							"label": "綦江区",
							"position": [
								"106.651417",
								"29.028091"
							],
							"value": "500110"
						},
						{
							"label": "大足区",
							"position": [
								"105.715319",
								"29.700498"
							],
							"value": "500111"
						},
						{
							"label": "渝北区",
							"position": [
								"106.512851",
								"29.601451"
							],
							"value": "500112"
						},
						{
							"label": "巴南区",
							"position": [
								"106.519423",
								"29.381919"
							],
							"value": "500113"
						},
						{
							"label": "黔江区",
							"position": [
								"108.782577",
								"29.527548"
							],
							"value": "500114"
						},
						{
							"label": "长寿区",
							"position": [
								"107.074854",
								"29.833671"
							],
							"value": "500115"
						},
						{
							"label": "江津区",
							"position": [
								"106.253156",
								"29.283387"
							],
							"value": "500116"
						},
						{
							"label": "合川区",
							"position": [
								"106.265554",
								"29.990993"
							],
							"value": "500117"
						},
						{
							"label": "永川区",
							"position": [
								"105.894714",
								"29.348748"
							],
							"value": "500118"
						},
						{
							"label": "南川区",
							"position": [
								"107.098153",
								"29.156646"
							],
							"value": "500119"
						},
						{
							"label": "璧山区",
							"position": [
								"106.231126",
								"29.593581"
							],
							"value": "500120"
						},
						{
							"label": "铜梁区",
							"position": [
								"106.054948",
								"29.839944"
							],
							"value": "500151"
						},
						{
							"label": "潼南区",
							"position": [
								"105.841818",
								"30.189554"
							],
							"value": "500152"
						},
						{
							"label": "荣昌区",
							"position": [
								"105.594061",
								"29.403627"
							],
							"value": "500153"
						},
						{
							"label": "开州区",
							"position": [
								"108.413317",
								"31.167735"
							],
							"value": "500154"
						},
						{
							"label": "梁平区",
							"position": [
								"107.800034",
								"30.672168"
							],
							"value": "500155"
						},
						{
							"label": "武隆区",
							"position": [
								"107.75655",
								"29.32376"
							],
							"value": "500156"
						}
					]
				},
				{
					"label": "重庆郊县",
					"position": [
						"108.170255",
						"29.291965"
					],
					"value": "500200",
					"children": [{
							"label": "城口县",
							"position": [
								"108.6649",
								"31.946293"
							],
							"value": "500229"
						},
						{
							"label": "丰都县",
							"position": [
								"107.73248",
								"29.866424"
							],
							"value": "500230"
						},
						{
							"label": "垫江县",
							"position": [
								"107.348692",
								"30.330012"
							],
							"value": "500231"
						},
						{
							"label": "忠县",
							"position": [
								"108.037518",
								"30.291537"
							],
							"value": "500233"
						},
						{
							"label": "云阳县",
							"position": [
								"108.697698",
								"30.930529"
							],
							"value": "500235"
						},
						{
							"label": "奉节县",
							"position": [
								"109.465774",
								"31.019967"
							],
							"value": "500236"
						},
						{
							"label": "巫山县",
							"position": [
								"109.878928",
								"31.074843"
							],
							"value": "500237"
						},
						{
							"label": "巫溪县",
							"position": [
								"109.628912",
								"31.3966"
							],
							"value": "500238"
						},
						{
							"label": "石柱土家族自治县",
							"position": [
								"108.112448",
								"29.99853"
							],
							"value": "500240"
						},
						{
							"label": "秀山土家族苗族自治县",
							"position": [
								"108.996043",
								"28.444772"
							],
							"value": "500241"
						},
						{
							"label": "酉阳土家族苗族自治县",
							"position": [
								"108.767201",
								"28.839828"
							],
							"value": "500242"
						},
						{
							"label": "彭水苗族土家族自治县",
							"position": [
								"108.166551",
								"29.293856"
							],
							"value": "500243"
						}
					]
				}
			]
		},
		{
			"label": "四川省",
			"position": [
				"104.065735",
				"30.659462"
			],
			"value": "510000",
			"children": [{
					"label": "成都市",
					"position": [
						"104.065735",
						"30.659462"
					],
					"value": "510100",
					"children": [{
							"label": "锦江区",
							"position": [
								"104.080989",
								"30.657689"
							],
							"value": "510104"
						},
						{
							"label": "青羊区",
							"position": [
								"104.055731",
								"30.667648"
							],
							"value": "510105"
						},
						{
							"label": "金牛区",
							"position": [
								"104.043487",
								"30.692058"
							],
							"value": "510106"
						},
						{
							"label": "武侯区",
							"position": [
								"104.05167",
								"30.630862"
							],
							"value": "510107"
						},
						{
							"label": "成华区",
							"position": [
								"104.103077",
								"30.660275"
							],
							"value": "510108"
						},
						{
							"label": "龙泉驿区",
							"position": [
								"104.269181",
								"30.56065"
							],
							"value": "510112"
						},
						{
							"label": "青白江区",
							"position": [
								"104.25494",
								"30.883438"
							],
							"value": "510113"
						},
						{
							"label": "新都区",
							"position": [
								"104.16022",
								"30.824223"
							],
							"value": "510114"
						},
						{
							"label": "温江区",
							"position": [
								"103.836776",
								"30.697996"
							],
							"value": "510115"
						},
						{
							"label": "双流区",
							"position": [
								"103.922706",
								"30.573243"
							],
							"value": "510116"
						},
						{
							"label": "郫都区",
							"position": [
								"103.887842",
								"30.808752"
							],
							"value": "510117"
						},
						{
							"label": "新津区",
							"position": [
								"103.812449",
								"30.414284"
							],
							"value": "510118"
						},
						{
							"label": "金堂县",
							"position": [
								"104.415604",
								"30.858417"
							],
							"value": "510121"
						},
						{
							"label": "大邑县",
							"position": [
								"103.522397",
								"30.586602"
							],
							"value": "510129"
						},
						{
							"label": "蒲江县",
							"position": [
								"103.511541",
								"30.194359"
							],
							"value": "510131"
						},
						{
							"label": "都江堰市",
							"position": [
								"103.627898",
								"30.99114"
							],
							"value": "510181"
						},
						{
							"label": "彭州市",
							"position": [
								"103.941173",
								"30.985161"
							],
							"value": "510182"
						},
						{
							"label": "邛崃市",
							"position": [
								"103.46143",
								"30.413271"
							],
							"value": "510183"
						},
						{
							"label": "崇州市",
							"position": [
								"103.671049",
								"30.631478"
							],
							"value": "510184"
						},
						{
							"label": "简阳市",
							"position": [
								"104.550339",
								"30.390666"
							],
							"value": "510185"
						}
					]
				},
				{
					"label": "自贡市",
					"position": [
						"104.773447",
						"29.352765"
					],
					"value": "510300",
					"children": [{
							"label": "自流井区",
							"position": [
								"104.778188",
								"29.343231"
							],
							"value": "510302"
						},
						{
							"label": "贡井区",
							"position": [
								"104.714372",
								"29.345675"
							],
							"value": "510303"
						},
						{
							"label": "大安区",
							"position": [
								"104.783229",
								"29.367136"
							],
							"value": "510304"
						},
						{
							"label": "沿滩区",
							"position": [
								"104.876417",
								"29.272521"
							],
							"value": "510311"
						},
						{
							"label": "荣县",
							"position": [
								"104.423932",
								"29.454851"
							],
							"value": "510321"
						},
						{
							"label": "富顺县",
							"position": [
								"104.984256",
								"29.181282"
							],
							"value": "510322"
						}
					]
				},
				{
					"label": "攀枝花市",
					"position": [
						"101.716007",
						"26.580446"
					],
					"value": "510400",
					"children": [{
							"label": "东区",
							"position": [
								"101.715134",
								"26.580887"
							],
							"value": "510402"
						},
						{
							"label": "西区",
							"position": [
								"101.637969",
								"26.596776"
							],
							"value": "510403"
						},
						{
							"label": "仁和区",
							"position": [
								"101.737916",
								"26.497185"
							],
							"value": "510411"
						},
						{
							"label": "米易县",
							"position": [
								"102.109877",
								"26.887474"
							],
							"value": "510421"
						},
						{
							"label": "盐边县",
							"position": [
								"101.851848",
								"26.677619"
							],
							"value": "510422"
						}
					]
				},
				{
					"label": "泸州市",
					"position": [
						"105.443348",
						"28.889138"
					],
					"value": "510500",
					"children": [{
							"label": "江阳区",
							"position": [
								"105.445131",
								"28.882889"
							],
							"value": "510502"
						},
						{
							"label": "纳溪区",
							"position": [
								"105.37721",
								"28.77631"
							],
							"value": "510503"
						},
						{
							"label": "龙马潭区",
							"position": [
								"105.435228",
								"28.897572"
							],
							"value": "510504"
						},
						{
							"label": "泸县",
							"position": [
								"105.376335",
								"29.151288"
							],
							"value": "510521"
						},
						{
							"label": "合江县",
							"position": [
								"105.834098",
								"28.810325"
							],
							"value": "510522"
						},
						{
							"label": "叙永县",
							"position": [
								"105.437775",
								"28.167919"
							],
							"value": "510524"
						},
						{
							"label": "古蔺县",
							"position": [
								"105.813359",
								"28.03948"
							],
							"value": "510525"
						}
					]
				},
				{
					"label": "德阳市",
					"position": [
						"104.398651",
						"31.127991"
					],
					"value": "510600",
					"children": [{
							"label": "旌阳区",
							"position": [
								"104.389648",
								"31.130428"
							],
							"value": "510603"
						},
						{
							"label": "罗江区",
							"position": [
								"104.507126",
								"31.303281"
							],
							"value": "510604"
						},
						{
							"label": "中江县",
							"position": [
								"104.677831",
								"31.03681"
							],
							"value": "510623"
						},
						{
							"label": "广汉市",
							"position": [
								"104.281903",
								"30.97715"
							],
							"value": "510681"
						},
						{
							"label": "什邡市",
							"position": [
								"104.173653",
								"31.126881"
							],
							"value": "510682"
						},
						{
							"label": "绵竹市",
							"position": [
								"104.200162",
								"31.343084"
							],
							"value": "510683"
						}
					]
				},
				{
					"label": "绵阳市",
					"position": [
						"104.741722",
						"31.46402"
					],
					"value": "510700",
					"children": [{
							"label": "涪城区",
							"position": [
								"104.740971",
								"31.463557"
							],
							"value": "510703"
						},
						{
							"label": "游仙区",
							"position": [
								"104.770006",
								"31.484772"
							],
							"value": "510704"
						},
						{
							"label": "安州区",
							"position": [
								"104.560341",
								"31.53894"
							],
							"value": "510705"
						},
						{
							"label": "三台县",
							"position": [
								"105.090316",
								"31.090909"
							],
							"value": "510722"
						},
						{
							"label": "盐亭县",
							"position": [
								"105.391991",
								"31.22318"
							],
							"value": "510723"
						},
						{
							"label": "梓潼县",
							"position": [
								"105.16353",
								"31.635225"
							],
							"value": "510725"
						},
						{
							"label": "北川羌族自治县",
							"position": [
								"104.468069",
								"31.615863"
							],
							"value": "510726"
						},
						{
							"label": "平武县",
							"position": [
								"104.530555",
								"32.407588"
							],
							"value": "510727"
						},
						{
							"label": "江油市",
							"position": [
								"104.744431",
								"31.776386"
							],
							"value": "510781"
						}
					]
				},
				{
					"label": "广元市",
					"position": [
						"105.829757",
						"32.433668"
					],
					"value": "510800",
					"children": [{
							"label": "利州区",
							"position": [
								"105.826194",
								"32.432276"
							],
							"value": "510802"
						},
						{
							"label": "昭化区",
							"position": [
								"105.964121",
								"32.322788"
							],
							"value": "510811"
						},
						{
							"label": "朝天区",
							"position": [
								"105.88917",
								"32.642632"
							],
							"value": "510812"
						},
						{
							"label": "旺苍县",
							"position": [
								"106.290426",
								"32.22833"
							],
							"value": "510821"
						},
						{
							"label": "青川县",
							"position": [
								"105.238847",
								"32.585655"
							],
							"value": "510822"
						},
						{
							"label": "剑阁县",
							"position": [
								"105.527035",
								"32.286517"
							],
							"value": "510823"
						},
						{
							"label": "苍溪县",
							"position": [
								"105.939706",
								"31.732251"
							],
							"value": "510824"
						}
					]
				},
				{
					"label": "遂宁市",
					"position": [
						"105.571331",
						"30.513311"
					],
					"value": "510900",
					"children": [{
							"label": "船山区",
							"position": [
								"105.582215",
								"30.502647"
							],
							"value": "510903"
						},
						{
							"label": "安居区",
							"position": [
								"105.459383",
								"30.346121"
							],
							"value": "510904"
						},
						{
							"label": "蓬溪县",
							"position": [
								"105.713699",
								"30.774883"
							],
							"value": "510921"
						},
						{
							"label": "大英县",
							"position": [
								"105.252187",
								"30.581571"
							],
							"value": "510923"
						},
						{
							"label": "射洪市",
							"position": [
								"105.381849",
								"30.868752"
							],
							"value": "510981"
						}
					]
				},
				{
					"label": "内江市",
					"position": [
						"105.066138",
						"29.58708"
					],
					"value": "511000",
					"children": [{
							"label": "市中区",
							"position": [
								"105.065467",
								"29.585265"
							],
							"value": "511002"
						},
						{
							"label": "东兴区",
							"position": [
								"105.067203",
								"29.600107"
							],
							"value": "511011"
						},
						{
							"label": "威远县",
							"position": [
								"104.668327",
								"29.52686"
							],
							"value": "511024"
						},
						{
							"label": "资中县",
							"position": [
								"104.852463",
								"29.775295"
							],
							"value": "511025"
						},
						{
							"label": "隆昌市",
							"position": [
								"105.288074",
								"29.338162"
							],
							"value": "511083"
						}
					]
				},
				{
					"label": "乐山市",
					"position": [
						"103.761263",
						"29.582024"
					],
					"value": "511100",
					"children": [{
							"label": "市中区",
							"position": [
								"103.75539",
								"29.588327"
							],
							"value": "511102"
						},
						{
							"label": "沙湾区",
							"position": [
								"103.549961",
								"29.416536"
							],
							"value": "511111"
						},
						{
							"label": "五通桥区",
							"position": [
								"103.816837",
								"29.406186"
							],
							"value": "511112"
						},
						{
							"label": "金口河区",
							"position": [
								"103.077831",
								"29.24602"
							],
							"value": "511113"
						},
						{
							"label": "犍为县",
							"position": [
								"103.944266",
								"29.209782"
							],
							"value": "511123"
						},
						{
							"label": "井研县",
							"position": [
								"104.06885",
								"29.651645"
							],
							"value": "511124"
						},
						{
							"label": "夹江县",
							"position": [
								"103.578862",
								"29.741019"
							],
							"value": "511126"
						},
						{
							"label": "沐川县",
							"position": [
								"103.90211",
								"28.956338"
							],
							"value": "511129"
						},
						{
							"label": "峨边彝族自治县",
							"position": [
								"103.262148",
								"29.230271"
							],
							"value": "511132"
						},
						{
							"label": "马边彝族自治县",
							"position": [
								"103.546851",
								"28.838933"
							],
							"value": "511133"
						},
						{
							"label": "峨眉山市",
							"position": [
								"103.492488",
								"29.597478"
							],
							"value": "511181"
						}
					]
				},
				{
					"label": "南充市",
					"position": [
						"106.082974",
						"30.795281"
					],
					"value": "511300",
					"children": [{
							"label": "顺庆区",
							"position": [
								"106.084091",
								"30.795572"
							],
							"value": "511302"
						},
						{
							"label": "高坪区",
							"position": [
								"106.108996",
								"30.781809"
							],
							"value": "511303"
						},
						{
							"label": "嘉陵区",
							"position": [
								"106.067027",
								"30.762976"
							],
							"value": "511304"
						},
						{
							"label": "南部县",
							"position": [
								"106.061138",
								"31.349407"
							],
							"value": "511321"
						},
						{
							"label": "营山县",
							"position": [
								"106.564893",
								"31.075907"
							],
							"value": "511322"
						},
						{
							"label": "蓬安县",
							"position": [
								"106.413488",
								"31.027978"
							],
							"value": "511323"
						},
						{
							"label": "仪陇县",
							"position": [
								"106.297083",
								"31.271261"
							],
							"value": "511324"
						},
						{
							"label": "西充县",
							"position": [
								"105.893021",
								"30.994616"
							],
							"value": "511325"
						},
						{
							"label": "阆中市",
							"position": [
								"105.975266",
								"31.580466"
							],
							"value": "511381"
						}
					]
				},
				{
					"label": "眉山市",
					"position": [
						"103.831788",
						"30.048318"
					],
					"value": "511400",
					"children": [{
							"label": "东坡区",
							"position": [
								"103.831553",
								"30.048128"
							],
							"value": "511402"
						},
						{
							"label": "彭山区",
							"position": [
								"103.8701",
								"30.192298"
							],
							"value": "511403"
						},
						{
							"label": "仁寿县",
							"position": [
								"104.147646",
								"29.996721"
							],
							"value": "511421"
						},
						{
							"label": "洪雅县",
							"position": [
								"103.375006",
								"29.904867"
							],
							"value": "511423"
						},
						{
							"label": "丹棱县",
							"position": [
								"103.518333",
								"30.012751"
							],
							"value": "511424"
						},
						{
							"label": "青神县",
							"position": [
								"103.846131",
								"29.831469"
							],
							"value": "511425"
						}
					]
				},
				{
					"label": "宜宾市",
					"position": [
						"104.630825",
						"28.760189"
					],
					"value": "511500",
					"children": [{
							"label": "翠屏区",
							"position": [
								"104.630231",
								"28.760179"
							],
							"value": "511502"
						},
						{
							"label": "南溪区",
							"position": [
								"104.981133",
								"28.839806"
							],
							"value": "511503"
						},
						{
							"label": "叙州区",
							"position": [
								"104.541489",
								"28.695678"
							],
							"value": "511504"
						},
						{
							"label": "江安县",
							"position": [
								"105.068697",
								"28.728102"
							],
							"value": "511523"
						},
						{
							"label": "长宁县",
							"position": [
								"104.921116",
								"28.577271"
							],
							"value": "511524"
						},
						{
							"label": "高县",
							"position": [
								"104.519187",
								"28.435676"
							],
							"value": "511525"
						},
						{
							"label": "珙县",
							"position": [
								"104.712268",
								"28.449041"
							],
							"value": "511526"
						},
						{
							"label": "筠连县",
							"position": [
								"104.507848",
								"28.162017"
							],
							"value": "511527"
						},
						{
							"label": "兴文县",
							"position": [
								"105.236549",
								"28.302988"
							],
							"value": "511528"
						},
						{
							"label": "屏山县",
							"position": [
								"104.162617",
								"28.64237"
							],
							"value": "511529"
						}
					]
				},
				{
					"label": "广安市",
					"position": [
						"106.633369",
						"30.456398"
					],
					"value": "511600",
					"children": [{
							"label": "广安区",
							"position": [
								"106.632907",
								"30.456462"
							],
							"value": "511602"
						},
						{
							"label": "前锋区",
							"position": [
								"106.893277",
								"30.4963"
							],
							"value": "511603"
						},
						{
							"label": "岳池县",
							"position": [
								"106.444451",
								"30.533538"
							],
							"value": "511621"
						},
						{
							"label": "武胜县",
							"position": [
								"106.292473",
								"30.344291"
							],
							"value": "511622"
						},
						{
							"label": "邻水县",
							"position": [
								"106.934968",
								"30.334323"
							],
							"value": "511623"
						},
						{
							"label": "华蓥市",
							"position": [
								"106.777882",
								"30.380574"
							],
							"value": "511681"
						}
					]
				},
				{
					"label": "达州市",
					"position": [
						"107.502262",
						"31.209484"
					],
					"value": "511700",
					"children": [{
							"label": "通川区",
							"position": [
								"107.501062",
								"31.213522"
							],
							"value": "511702"
						},
						{
							"label": "达川区",
							"position": [
								"107.507926",
								"31.199062"
							],
							"value": "511703"
						},
						{
							"label": "宣汉县",
							"position": [
								"107.722254",
								"31.355025"
							],
							"value": "511722"
						},
						{
							"label": "开江县",
							"position": [
								"107.864135",
								"31.085537"
							],
							"value": "511723"
						},
						{
							"label": "大竹县",
							"position": [
								"107.20742",
								"30.736289"
							],
							"value": "511724"
						},
						{
							"label": "渠县",
							"position": [
								"106.970746",
								"30.836348"
							],
							"value": "511725"
						},
						{
							"label": "万源市",
							"position": [
								"108.037548",
								"32.06777"
							],
							"value": "511781"
						}
					]
				},
				{
					"label": "雅安市",
					"position": [
						"103.001033",
						"29.987722"
					],
					"value": "511800",
					"children": [{
							"label": "雨城区",
							"position": [
								"103.003398",
								"29.981831"
							],
							"value": "511802"
						},
						{
							"label": "名山区",
							"position": [
								"103.112214",
								"30.084718"
							],
							"value": "511803"
						},
						{
							"label": "荥经县",
							"position": [
								"102.844674",
								"29.795529"
							],
							"value": "511822"
						},
						{
							"label": "汉源县",
							"position": [
								"102.677145",
								"29.349915"
							],
							"value": "511823"
						},
						{
							"label": "石棉县",
							"position": [
								"102.35962",
								"29.234063"
							],
							"value": "511824"
						},
						{
							"label": "天全县",
							"position": [
								"102.763462",
								"30.059955"
							],
							"value": "511825"
						},
						{
							"label": "芦山县",
							"position": [
								"102.924016",
								"30.152907"
							],
							"value": "511826"
						},
						{
							"label": "宝兴县",
							"position": [
								"102.813377",
								"30.369026"
							],
							"value": "511827"
						}
					]
				},
				{
					"label": "巴中市",
					"position": [
						"106.753669",
						"31.858809"
					],
					"value": "511900",
					"children": [{
							"label": "巴州区",
							"position": [
								"106.753671",
								"31.858366"
							],
							"value": "511902"
						},
						{
							"label": "恩阳区",
							"position": [
								"106.486515",
								"31.816336"
							],
							"value": "511903"
						},
						{
							"label": "通江县",
							"position": [
								"107.247621",
								"31.91212"
							],
							"value": "511921"
						},
						{
							"label": "南江县",
							"position": [
								"106.843418",
								"32.353164"
							],
							"value": "511922"
						},
						{
							"label": "平昌县",
							"position": [
								"107.101937",
								"31.562814"
							],
							"value": "511923"
						}
					]
				},
				{
					"label": "资阳市",
					"position": [
						"104.641917",
						"30.122211"
					],
					"value": "512000",
					"children": [{
							"label": "雁江区",
							"position": [
								"104.642338",
								"30.121686"
							],
							"value": "512002"
						},
						{
							"label": "安岳县",
							"position": [
								"105.336764",
								"30.099206"
							],
							"value": "512021"
						},
						{
							"label": "乐至县",
							"position": [
								"105.031142",
								"30.275619"
							],
							"value": "512022"
						}
					]
				},
				{
					"label": "阿坝藏族羌族自治州",
					"position": [
						"102.221374",
						"31.899792"
					],
					"value": "513200",
					"children": [{
							"label": "马尔康市",
							"position": [
								"102.221187",
								"31.899761"
							],
							"value": "513201"
						},
						{
							"label": "汶川县",
							"position": [
								"103.580675",
								"31.47463"
							],
							"value": "513221"
						},
						{
							"label": "理县",
							"position": [
								"103.165486",
								"31.436764"
							],
							"value": "513222"
						},
						{
							"label": "茂县",
							"position": [
								"103.850684",
								"31.680407"
							],
							"value": "513223"
						},
						{
							"label": "松潘县",
							"position": [
								"103.599177",
								"32.63838"
							],
							"value": "513224"
						},
						{
							"label": "九寨沟县",
							"position": [
								"104.236344",
								"33.262097"
							],
							"value": "513225"
						},
						{
							"label": "金川县",
							"position": [
								"102.064647",
								"31.476356"
							],
							"value": "513226"
						},
						{
							"label": "小金县",
							"position": [
								"102.363193",
								"30.999016"
							],
							"value": "513227"
						},
						{
							"label": "黑水县",
							"position": [
								"102.990805",
								"32.061721"
							],
							"value": "513228"
						},
						{
							"label": "壤塘县",
							"position": [
								"100.979136",
								"32.264887"
							],
							"value": "513230"
						},
						{
							"label": "阿坝县",
							"position": [
								"101.700985",
								"32.904223"
							],
							"value": "513231"
						},
						{
							"label": "若尔盖县",
							"position": [
								"102.963726",
								"33.575934"
							],
							"value": "513232"
						},
						{
							"label": "红原县",
							"position": [
								"102.544906",
								"32.793902"
							],
							"value": "513233"
						}
					]
				},
				{
					"label": "甘孜藏族自治州",
					"position": [
						"101.963815",
						"30.050663"
					],
					"value": "513300",
					"children": [{
							"label": "康定市",
							"position": [
								"101.964057",
								"30.050738"
							],
							"value": "513301"
						},
						{
							"label": "泸定县",
							"position": [
								"102.233225",
								"29.912482"
							],
							"value": "513322"
						},
						{
							"label": "丹巴县",
							"position": [
								"101.886125",
								"30.877083"
							],
							"value": "513323"
						},
						{
							"label": "九龙县",
							"position": [
								"101.506942",
								"29.001975"
							],
							"value": "513324"
						},
						{
							"label": "雅江县",
							"position": [
								"101.015735",
								"30.03225"
							],
							"value": "513325"
						},
						{
							"label": "道孚县",
							"position": [
								"101.123327",
								"30.978767"
							],
							"value": "513326"
						},
						{
							"label": "炉霍县",
							"position": [
								"100.679495",
								"31.392674"
							],
							"value": "513327"
						},
						{
							"label": "甘孜县",
							"position": [
								"99.991753",
								"31.61975"
							],
							"value": "513328"
						},
						{
							"label": "新龙县",
							"position": [
								"100.312094",
								"30.93896"
							],
							"value": "513329"
						},
						{
							"label": "德格县",
							"position": [
								"98.57999",
								"31.806729"
							],
							"value": "513330"
						},
						{
							"label": "白玉县",
							"position": [
								"98.824343",
								"31.208805"
							],
							"value": "513331"
						},
						{
							"label": "石渠县",
							"position": [
								"98.100887",
								"32.975302"
							],
							"value": "513332"
						},
						{
							"label": "色达县",
							"position": [
								"100.331657",
								"32.268777"
							],
							"value": "513333"
						},
						{
							"label": "理塘县",
							"position": [
								"100.269862",
								"29.991807"
							],
							"value": "513334"
						},
						{
							"label": "巴塘县",
							"position": [
								"99.109037",
								"30.005723"
							],
							"value": "513335"
						},
						{
							"label": "乡城县",
							"position": [
								"99.799943",
								"28.930855"
							],
							"value": "513336"
						},
						{
							"label": "稻城县",
							"position": [
								"100.296689",
								"29.037544"
							],
							"value": "513337"
						},
						{
							"label": "得荣县",
							"position": [
								"99.288036",
								"28.71134"
							],
							"value": "513338"
						}
					]
				},
				{
					"label": "凉山彝族自治州",
					"position": [
						"102.258746",
						"27.886762"
					],
					"value": "513400",
					"children": [{
							"label": "西昌市",
							"position": [
								"102.258758",
								"27.885786"
							],
							"value": "513401"
						},
						{
							"label": "木里藏族自治县",
							"position": [
								"101.280184",
								"27.926859"
							],
							"value": "513422"
						},
						{
							"label": "盐源县",
							"position": [
								"101.508909",
								"27.423415"
							],
							"value": "513423"
						},
						{
							"label": "德昌县",
							"position": [
								"102.178845",
								"27.403827"
							],
							"value": "513424"
						},
						{
							"label": "会理县",
							"position": [
								"102.249548",
								"26.658702"
							],
							"value": "513425"
						},
						{
							"label": "会东县",
							"position": [
								"102.578985",
								"26.630713"
							],
							"value": "513426"
						},
						{
							"label": "宁南县",
							"position": [
								"102.757374",
								"27.065205"
							],
							"value": "513427"
						},
						{
							"label": "普格县",
							"position": [
								"102.541082",
								"27.376828"
							],
							"value": "513428"
						},
						{
							"label": "布拖县",
							"position": [
								"102.808801",
								"27.709062"
							],
							"value": "513429"
						},
						{
							"label": "金阳县",
							"position": [
								"103.248704",
								"27.695916"
							],
							"value": "513430"
						},
						{
							"label": "昭觉县",
							"position": [
								"102.843991",
								"28.010554"
							],
							"value": "513431"
						},
						{
							"label": "喜德县",
							"position": [
								"102.412342",
								"28.305486"
							],
							"value": "513432"
						},
						{
							"label": "冕宁县",
							"position": [
								"102.170046",
								"28.550844"
							],
							"value": "513433"
						},
						{
							"label": "越西县",
							"position": [
								"102.508875",
								"28.639632"
							],
							"value": "513434"
						},
						{
							"label": "甘洛县",
							"position": [
								"102.775924",
								"28.977094"
							],
							"value": "513435"
						},
						{
							"label": "美姑县",
							"position": [
								"103.132007",
								"28.327946"
							],
							"value": "513436"
						},
						{
							"label": "雷波县",
							"position": [
								"103.571584",
								"28.262946"
							],
							"value": "513437"
						}
					]
				}
			]
		},
		{
			"label": "贵州省",
			"position": [
				"106.713478",
				"26.578343"
			],
			"value": "520000",
			"children": [{
					"label": "贵阳市",
					"position": [
						"106.713478",
						"26.578343"
					],
					"value": "520100",
					"children": [{
							"label": "南明区",
							"position": [
								"106.715963",
								"26.573743"
							],
							"value": "520102"
						},
						{
							"label": "云岩区",
							"position": [
								"106.713397",
								"26.58301"
							],
							"value": "520103"
						},
						{
							"label": "花溪区",
							"position": [
								"106.670791",
								"26.410464"
							],
							"value": "520111"
						},
						{
							"label": "乌当区",
							"position": [
								"106.762123",
								"26.630928"
							],
							"value": "520112"
						},
						{
							"label": "白云区",
							"position": [
								"106.633037",
								"26.676849"
							],
							"value": "520113"
						},
						{
							"label": "观山湖区",
							"position": [
								"106.626323",
								"26.646358"
							],
							"value": "520115"
						},
						{
							"label": "开阳县",
							"position": [
								"106.969438",
								"27.056793"
							],
							"value": "520121"
						},
						{
							"label": "息烽县",
							"position": [
								"106.737693",
								"27.092665"
							],
							"value": "520122"
						},
						{
							"label": "修文县",
							"position": [
								"106.599218",
								"26.840672"
							],
							"value": "520123"
						},
						{
							"label": "清镇市",
							"position": [
								"106.470278",
								"26.551289"
							],
							"value": "520181"
						}
					]
				},
				{
					"label": "六盘水市",
					"position": [
						"104.846743",
						"26.584643"
					],
					"value": "520200",
					"children": [{
							"label": "钟山区",
							"position": [
								"104.846244",
								"26.584805"
							],
							"value": "520201"
						},
						{
							"label": "六枝特区",
							"position": [
								"105.474235",
								"26.210662"
							],
							"value": "520203"
						},
						{
							"label": "水城区",
							"position": [
								"104.95685",
								"26.540478"
							],
							"value": "520221"
						},
						{
							"label": "盘州市",
							"position": [
								"104.468367",
								"25.706966"
							],
							"value": "520281"
						}
					]
				},
				{
					"label": "遵义市",
					"position": [
						"106.937265",
						"27.706626"
					],
					"value": "520300",
					"children": [{
							"label": "红花岗区",
							"position": [
								"106.943784",
								"27.694395"
							],
							"value": "520302"
						},
						{
							"label": "汇川区",
							"position": [
								"106.937265",
								"27.706626"
							],
							"value": "520303"
						},
						{
							"label": "播州区",
							"position": [
								"106.831668",
								"27.535288"
							],
							"value": "520304"
						},
						{
							"label": "桐梓县",
							"position": [
								"106.826591",
								"28.131559"
							],
							"value": "520322"
						},
						{
							"label": "绥阳县",
							"position": [
								"107.191024",
								"27.951342"
							],
							"value": "520323"
						},
						{
							"label": "正安县",
							"position": [
								"107.441872",
								"28.550337"
							],
							"value": "520324"
						},
						{
							"label": "道真仡佬族苗族自治县",
							"position": [
								"107.605342",
								"28.880088"
							],
							"value": "520325"
						},
						{
							"label": "务川仡佬族苗族自治县",
							"position": [
								"107.887857",
								"28.521567"
							],
							"value": "520326"
						},
						{
							"label": "凤冈县",
							"position": [
								"107.722021",
								"27.960858"
							],
							"value": "520327"
						},
						{
							"label": "湄潭县",
							"position": [
								"107.485723",
								"27.765839"
							],
							"value": "520328"
						},
						{
							"label": "余庆县",
							"position": [
								"107.892566",
								"27.221552"
							],
							"value": "520329"
						},
						{
							"label": "习水县",
							"position": [
								"106.200954",
								"28.327826"
							],
							"value": "520330"
						},
						{
							"label": "赤水市",
							"position": [
								"105.698116",
								"28.587057"
							],
							"value": "520381"
						},
						{
							"label": "仁怀市",
							"position": [
								"106.412476",
								"27.803377"
							],
							"value": "520382"
						}
					]
				},
				{
					"label": "安顺市",
					"position": [
						"105.932188",
						"26.245544"
					],
					"value": "520400",
					"children": [{
							"label": "西秀区",
							"position": [
								"105.946169",
								"26.248323"
							],
							"value": "520402"
						},
						{
							"label": "平坝区",
							"position": [
								"106.259942",
								"26.40608"
							],
							"value": "520403"
						},
						{
							"label": "普定县",
							"position": [
								"105.745609",
								"26.305794"
							],
							"value": "520422"
						},
						{
							"label": "镇宁布依族苗族自治县",
							"position": [
								"105.768656",
								"26.056096"
							],
							"value": "520423"
						},
						{
							"label": "关岭布依族苗族自治县",
							"position": [
								"105.618454",
								"25.944248"
							],
							"value": "520424"
						},
						{
							"label": "紫云苗族布依族自治县",
							"position": [
								"106.084515",
								"25.751567"
							],
							"value": "520425"
						}
					]
				},
				{
					"label": "毕节市",
					"position": [
						"105.28501",
						"27.301693"
					],
					"value": "520500",
					"children": [{
							"label": "七星关区",
							"position": [
								"105.284852",
								"27.302085"
							],
							"value": "520502"
						},
						{
							"label": "大方县",
							"position": [
								"105.609254",
								"27.143521"
							],
							"value": "520521"
						},
						{
							"label": "黔西县",
							"position": [
								"106.038299",
								"27.024923"
							],
							"value": "520522"
						},
						{
							"label": "金沙县",
							"position": [
								"106.222103",
								"27.459693"
							],
							"value": "520523"
						},
						{
							"label": "织金县",
							"position": [
								"105.768997",
								"26.668497"
							],
							"value": "520524"
						},
						{
							"label": "纳雍县",
							"position": [
								"105.375322",
								"26.769875"
							],
							"value": "520525"
						},
						{
							"label": "威宁彝族回族苗族自治县",
							"position": [
								"104.286523",
								"26.859099"
							],
							"value": "520526"
						},
						{
							"label": "赫章县",
							"position": [
								"104.726438",
								"27.119243"
							],
							"value": "520527"
						}
					]
				},
				{
					"label": "铜仁市",
					"position": [
						"109.191555",
						"27.718346"
					],
					"value": "520600",
					"children": [{
							"label": "碧江区",
							"position": [
								"109.192117",
								"27.718745"
							],
							"value": "520602"
						},
						{
							"label": "万山区",
							"position": [
								"109.21199",
								"27.51903"
							],
							"value": "520603"
						},
						{
							"label": "江口县",
							"position": [
								"108.848427",
								"27.691904"
							],
							"value": "520621"
						},
						{
							"label": "玉屏侗族自治县",
							"position": [
								"108.917882",
								"27.238024"
							],
							"value": "520622"
						},
						{
							"label": "石阡县",
							"position": [
								"108.229854",
								"27.519386"
							],
							"value": "520623"
						},
						{
							"label": "思南县",
							"position": [
								"108.255827",
								"27.941331"
							],
							"value": "520624"
						},
						{
							"label": "印江土家族苗族自治县",
							"position": [
								"108.405517",
								"27.997976"
							],
							"value": "520625"
						},
						{
							"label": "德江县",
							"position": [
								"108.117317",
								"28.26094"
							],
							"value": "520626"
						},
						{
							"label": "沿河土家族自治县",
							"position": [
								"108.495746",
								"28.560487"
							],
							"value": "520627"
						},
						{
							"label": "松桃苗族自治县",
							"position": [
								"109.202627",
								"28.165419"
							],
							"value": "520628"
						}
					]
				},
				{
					"label": "黔西南布依族苗族自治州",
					"position": [
						"104.897971",
						"25.08812"
					],
					"value": "522300",
					"children": [{
							"label": "兴义市",
							"position": [
								"104.897982",
								"25.088599"
							],
							"value": "522301"
						},
						{
							"label": "兴仁市",
							"position": [
								"105.192778",
								"25.431378"
							],
							"value": "522302"
						},
						{
							"label": "普安县",
							"position": [
								"104.955347",
								"25.786404"
							],
							"value": "522323"
						},
						{
							"label": "晴隆县",
							"position": [
								"105.218773",
								"25.832881"
							],
							"value": "522324"
						},
						{
							"label": "贞丰县",
							"position": [
								"105.650133",
								"25.385752"
							],
							"value": "522325"
						},
						{
							"label": "望谟县",
							"position": [
								"106.091563",
								"25.166667"
							],
							"value": "522326"
						},
						{
							"label": "册亨县",
							"position": [
								"105.81241",
								"24.983338"
							],
							"value": "522327"
						},
						{
							"label": "安龙县",
							"position": [
								"105.471498",
								"25.108959"
							],
							"value": "522328"
						}
					]
				},
				{
					"label": "黔东南苗族侗族自治州",
					"position": [
						"107.977488",
						"26.583352"
					],
					"value": "522600",
					"children": [{
							"label": "凯里市",
							"position": [
								"107.977541",
								"26.582964"
							],
							"value": "522601"
						},
						{
							"label": "黄平县",
							"position": [
								"107.901337",
								"26.896973"
							],
							"value": "522622"
						},
						{
							"label": "施秉县",
							"position": [
								"108.12678",
								"27.034657"
							],
							"value": "522623"
						},
						{
							"label": "三穗县",
							"position": [
								"108.681121",
								"26.959884"
							],
							"value": "522624"
						},
						{
							"label": "镇远县",
							"position": [
								"108.423656",
								"27.050233"
							],
							"value": "522625"
						},
						{
							"label": "岑巩县",
							"position": [
								"108.816459",
								"27.173244"
							],
							"value": "522626"
						},
						{
							"label": "天柱县",
							"position": [
								"109.212798",
								"26.909684"
							],
							"value": "522627"
						},
						{
							"label": "锦屏县",
							"position": [
								"109.20252",
								"26.680625"
							],
							"value": "522628"
						},
						{
							"label": "剑河县",
							"position": [
								"108.440499",
								"26.727349"
							],
							"value": "522629"
						},
						{
							"label": "台江县",
							"position": [
								"108.314637",
								"26.669138"
							],
							"value": "522630"
						},
						{
							"label": "黎平县",
							"position": [
								"109.136504",
								"26.230636"
							],
							"value": "522631"
						},
						{
							"label": "榕江县",
							"position": [
								"108.521026",
								"25.931085"
							],
							"value": "522632"
						},
						{
							"label": "从江县",
							"position": [
								"108.912648",
								"25.747058"
							],
							"value": "522633"
						},
						{
							"label": "雷山县",
							"position": [
								"108.079613",
								"26.381027"
							],
							"value": "522634"
						},
						{
							"label": "麻江县",
							"position": [
								"107.593172",
								"26.494803"
							],
							"value": "522635"
						},
						{
							"label": "丹寨县",
							"position": [
								"107.794808",
								"26.199497"
							],
							"value": "522636"
						}
					]
				},
				{
					"label": "黔南布依族苗族自治州",
					"position": [
						"107.517156",
						"26.258219"
					],
					"value": "522700",
					"children": [{
							"label": "都匀市",
							"position": [
								"107.517021",
								"26.258205"
							],
							"value": "522701"
						},
						{
							"label": "福泉市",
							"position": [
								"107.513508",
								"26.702508"
							],
							"value": "522702"
						},
						{
							"label": "荔波县",
							"position": [
								"107.8838",
								"25.412239"
							],
							"value": "522722"
						},
						{
							"label": "贵定县",
							"position": [
								"107.233588",
								"26.580807"
							],
							"value": "522723"
						},
						{
							"label": "瓮安县",
							"position": [
								"107.478417",
								"27.066339"
							],
							"value": "522725"
						},
						{
							"label": "独山县",
							"position": [
								"107.542757",
								"25.826283"
							],
							"value": "522726"
						},
						{
							"label": "平塘县",
							"position": [
								"107.32405",
								"25.831803"
							],
							"value": "522727"
						},
						{
							"label": "罗甸县",
							"position": [
								"106.750006",
								"25.429894"
							],
							"value": "522728"
						},
						{
							"label": "长顺县",
							"position": [
								"106.447376",
								"26.022116"
							],
							"value": "522729"
						},
						{
							"label": "龙里县",
							"position": [
								"106.977733",
								"26.448809"
							],
							"value": "522730"
						},
						{
							"label": "惠水县",
							"position": [
								"106.657848",
								"26.128637"
							],
							"value": "522731"
						},
						{
							"label": "三都水族自治县",
							"position": [
								"107.87747",
								"25.985183"
							],
							"value": "522732"
						}
					]
				}
			]
		},
		{
			"label": "云南省",
			"position": [
				"102.712251",
				"25.040609"
			],
			"value": "530000",
			"children": [{
					"label": "昆明市",
					"position": [
						"102.712251",
						"25.040609"
					],
					"value": "530100",
					"children": [{
							"label": "五华区",
							"position": [
								"102.704412",
								"25.042165"
							],
							"value": "530102"
						},
						{
							"label": "盘龙区",
							"position": [
								"102.729044",
								"25.070239"
							],
							"value": "530103"
						},
						{
							"label": "官渡区",
							"position": [
								"102.723437",
								"25.021211"
							],
							"value": "530111"
						},
						{
							"label": "西山区",
							"position": [
								"102.705904",
								"25.02436"
							],
							"value": "530112"
						},
						{
							"label": "东川区",
							"position": [
								"103.182",
								"26.08349"
							],
							"value": "530113"
						},
						{
							"label": "呈贡区",
							"position": [
								"102.801382",
								"24.889275"
							],
							"value": "530114"
						},
						{
							"label": "晋宁区",
							"position": [
								"102.594987",
								"24.666944"
							],
							"value": "530115"
						},
						{
							"label": "富民县",
							"position": [
								"102.497888",
								"25.219667"
							],
							"value": "530124"
						},
						{
							"label": "宜良县",
							"position": [
								"103.145989",
								"24.918215"
							],
							"value": "530125"
						},
						{
							"label": "石林彝族自治县",
							"position": [
								"103.271962",
								"24.754545"
							],
							"value": "530126"
						},
						{
							"label": "嵩明县",
							"position": [
								"103.038777",
								"25.335087"
							],
							"value": "530127"
						},
						{
							"label": "禄劝彝族苗族自治县",
							"position": [
								"102.46905",
								"25.556533"
							],
							"value": "530128"
						},
						{
							"label": "寻甸回族彝族自治县",
							"position": [
								"103.257588",
								"25.559474"
							],
							"value": "530129"
						},
						{
							"label": "安宁市",
							"position": [
								"102.485544",
								"24.921785"
							],
							"value": "530181"
						}
					]
				},
				{
					"label": "曲靖市",
					"position": [
						"103.797851",
						"25.501557"
					],
					"value": "530300",
					"children": [{
							"label": "麒麟区",
							"position": [
								"103.798054",
								"25.501269"
							],
							"value": "530302"
						},
						{
							"label": "沾益区",
							"position": [
								"103.819262",
								"25.600878"
							],
							"value": "530303"
						},
						{
							"label": "马龙区",
							"position": [
								"103.578755",
								"25.429451"
							],
							"value": "530304"
						},
						{
							"label": "陆良县",
							"position": [
								"103.655233",
								"25.022878"
							],
							"value": "530322"
						},
						{
							"label": "师宗县",
							"position": [
								"103.993808",
								"24.825681"
							],
							"value": "530323"
						},
						{
							"label": "罗平县",
							"position": [
								"104.309263",
								"24.885708"
							],
							"value": "530324"
						},
						{
							"label": "富源县",
							"position": [
								"104.25692",
								"25.67064"
							],
							"value": "530325"
						},
						{
							"label": "会泽县",
							"position": [
								"103.300041",
								"26.412861"
							],
							"value": "530326"
						},
						{
							"label": "宣威市",
							"position": [
								"104.09554",
								"26.227777"
							],
							"value": "530381"
						}
					]
				},
				{
					"label": "玉溪市",
					"position": [
						"102.543907",
						"24.350461"
					],
					"value": "530400",
					"children": [{
							"label": "红塔区",
							"position": [
								"102.543468",
								"24.350753"
							],
							"value": "530402"
						},
						{
							"label": "江川区",
							"position": [
								"102.749839",
								"24.291006"
							],
							"value": "530403"
						},
						{
							"label": "通海县",
							"position": [
								"102.760039",
								"24.112205"
							],
							"value": "530423"
						},
						{
							"label": "华宁县",
							"position": [
								"102.928982",
								"24.189807"
							],
							"value": "530424"
						},
						{
							"label": "易门县",
							"position": [
								"102.16211",
								"24.669598"
							],
							"value": "530425"
						},
						{
							"label": "峨山彝族自治县",
							"position": [
								"102.404358",
								"24.173256"
							],
							"value": "530426"
						},
						{
							"label": "新平彝族傣族自治县",
							"position": [
								"101.990903",
								"24.0664"
							],
							"value": "530427"
						},
						{
							"label": "元江哈尼族彝族傣族自治县",
							"position": [
								"101.999658",
								"23.597618"
							],
							"value": "530428"
						},
						{
							"label": "澄江市",
							"position": [
								"102.916652",
								"24.669679"
							],
							"value": "530481"
						}
					]
				},
				{
					"label": "保山市",
					"position": [
						"99.167133",
						"25.111802"
					],
					"value": "530500",
					"children": [{
							"label": "隆阳区",
							"position": [
								"99.165825",
								"25.112144"
							],
							"value": "530502"
						},
						{
							"label": "施甸县",
							"position": [
								"99.183758",
								"24.730847"
							],
							"value": "530521"
						},
						{
							"label": "龙陵县",
							"position": [
								"98.693567",
								"24.591912"
							],
							"value": "530523"
						},
						{
							"label": "昌宁县",
							"position": [
								"99.612344",
								"24.823662"
							],
							"value": "530524"
						},
						{
							"label": "腾冲市",
							"position": [
								"98.497292",
								"25.01757"
							],
							"value": "530581"
						}
					]
				},
				{
					"label": "昭通市",
					"position": [
						"103.717216",
						"27.336999"
					],
					"value": "530600",
					"children": [{
							"label": "昭阳区",
							"position": [
								"103.717267",
								"27.336636"
							],
							"value": "530602"
						},
						{
							"label": "鲁甸县",
							"position": [
								"103.549333",
								"27.191637"
							],
							"value": "530621"
						},
						{
							"label": "巧家县",
							"position": [
								"102.929284",
								"26.9117"
							],
							"value": "530622"
						},
						{
							"label": "盐津县",
							"position": [
								"104.23506",
								"28.106923"
							],
							"value": "530623"
						},
						{
							"label": "大关县",
							"position": [
								"103.891608",
								"27.747114"
							],
							"value": "530624"
						},
						{
							"label": "永善县",
							"position": [
								"103.63732",
								"28.231526"
							],
							"value": "530625"
						},
						{
							"label": "绥江县",
							"position": [
								"103.961095",
								"28.599953"
							],
							"value": "530626"
						},
						{
							"label": "镇雄县",
							"position": [
								"104.873055",
								"27.436267"
							],
							"value": "530627"
						},
						{
							"label": "彝良县",
							"position": [
								"104.048492",
								"27.627425"
							],
							"value": "530628"
						},
						{
							"label": "威信县",
							"position": [
								"105.04869",
								"27.843381"
							],
							"value": "530629"
						},
						{
							"label": "水富市",
							"position": [
								"104.415376",
								"28.629688"
							],
							"value": "530681"
						}
					]
				},
				{
					"label": "丽江市",
					"position": [
						"100.233026",
						"26.872108"
					],
					"value": "530700",
					"children": [{
							"label": "古城区",
							"position": [
								"100.234412",
								"26.872229"
							],
							"value": "530702"
						},
						{
							"label": "玉龙纳西族自治县",
							"position": [
								"100.238312",
								"26.830593"
							],
							"value": "530721"
						},
						{
							"label": "永胜县",
							"position": [
								"100.750901",
								"26.685623"
							],
							"value": "530722"
						},
						{
							"label": "华坪县",
							"position": [
								"101.267796",
								"26.628834"
							],
							"value": "530723"
						},
						{
							"label": "宁蒗彝族自治县",
							"position": [
								"100.852427",
								"27.281109"
							],
							"value": "530724"
						}
					]
				},
				{
					"label": "普洱市",
					"position": [
						"100.972344",
						"22.777321"
					],
					"value": "530800",
					"children": [{
							"label": "思茅区",
							"position": [
								"100.973227",
								"22.776595"
							],
							"value": "530802"
						},
						{
							"label": "宁洱哈尼族彝族自治县",
							"position": [
								"101.04524",
								"23.062507"
							],
							"value": "530821"
						},
						{
							"label": "墨江哈尼族自治县",
							"position": [
								"101.687606",
								"23.428165"
							],
							"value": "530822"
						},
						{
							"label": "景东彝族自治县",
							"position": [
								"100.840011",
								"24.448523"
							],
							"value": "530823"
						},
						{
							"label": "景谷傣族彝族自治县",
							"position": [
								"100.701425",
								"23.500278"
							],
							"value": "530824"
						},
						{
							"label": "镇沅彝族哈尼族拉祜族自治县",
							"position": [
								"101.108512",
								"24.005712"
							],
							"value": "530825"
						},
						{
							"label": "江城哈尼族彝族自治县",
							"position": [
								"101.859144",
								"22.58336"
							],
							"value": "530826"
						},
						{
							"label": "孟连傣族拉祜族佤族自治县",
							"position": [
								"99.585406",
								"22.325924"
							],
							"value": "530827"
						},
						{
							"label": "澜沧拉祜族自治县",
							"position": [
								"99.931201",
								"22.553083"
							],
							"value": "530828"
						},
						{
							"label": "西盟佤族自治县",
							"position": [
								"99.594372",
								"22.644423"
							],
							"value": "530829"
						}
					]
				},
				{
					"label": "临沧市",
					"position": [
						"100.08697",
						"23.886567"
					],
					"value": "530900",
					"children": [{
							"label": "临翔区",
							"position": [
								"100.086486",
								"23.886562"
							],
							"value": "530902"
						},
						{
							"label": "凤庆县",
							"position": [
								"99.91871",
								"24.592738"
							],
							"value": "530921"
						},
						{
							"label": "云县",
							"position": [
								"100.125637",
								"24.439026"
							],
							"value": "530922"
						},
						{
							"label": "永德县",
							"position": [
								"99.253679",
								"24.028159"
							],
							"value": "530923"
						},
						{
							"label": "镇康县",
							"position": [
								"98.82743",
								"23.761415"
							],
							"value": "530924"
						},
						{
							"label": "双江拉祜族佤族布朗族傣族自治县",
							"position": [
								"99.824419",
								"23.477476"
							],
							"value": "530925"
						},
						{
							"label": "耿马傣族佤族自治县",
							"position": [
								"99.402495",
								"23.534579"
							],
							"value": "530926"
						},
						{
							"label": "沧源佤族自治县",
							"position": [
								"99.2474",
								"23.146887"
							],
							"value": "530927"
						}
					]
				},
				{
					"label": "楚雄彝族自治州",
					"position": [
						"101.546046",
						"25.041988"
					],
					"value": "532300",
					"children": [{
							"label": "楚雄市",
							"position": [
								"101.546145",
								"25.040912"
							],
							"value": "532301"
						},
						{
							"label": "双柏县",
							"position": [
								"101.63824",
								"24.685094"
							],
							"value": "532322"
						},
						{
							"label": "牟定县",
							"position": [
								"101.543044",
								"25.312111"
							],
							"value": "532323"
						},
						{
							"label": "南华县",
							"position": [
								"101.274991",
								"25.192408"
							],
							"value": "532324"
						},
						{
							"label": "姚安县",
							"position": [
								"101.238399",
								"25.505403"
							],
							"value": "532325"
						},
						{
							"label": "大姚县",
							"position": [
								"101.323602",
								"25.722348"
							],
							"value": "532326"
						},
						{
							"label": "永仁县",
							"position": [
								"101.671175",
								"26.056316"
							],
							"value": "532327"
						},
						{
							"label": "元谋县",
							"position": [
								"101.870837",
								"25.703313"
							],
							"value": "532328"
						},
						{
							"label": "武定县",
							"position": [
								"102.406785",
								"25.5301"
							],
							"value": "532329"
						},
						{
							"label": "禄丰县",
							"position": [
								"102.075694",
								"25.14327"
							],
							"value": "532331"
						}
					]
				},
				{
					"label": "红河哈尼族彝族自治州",
					"position": [
						"103.384182",
						"23.366775"
					],
					"value": "532500",
					"children": [{
							"label": "个旧市",
							"position": [
								"103.154752",
								"23.360383"
							],
							"value": "532501"
						},
						{
							"label": "开远市",
							"position": [
								"103.258679",
								"23.713832"
							],
							"value": "532502"
						},
						{
							"label": "蒙自市",
							"position": [
								"103.385005",
								"23.366843"
							],
							"value": "532503"
						},
						{
							"label": "弥勒市",
							"position": [
								"103.436988",
								"24.40837"
							],
							"value": "532504"
						},
						{
							"label": "屏边苗族自治县",
							"position": [
								"103.687229",
								"22.987013"
							],
							"value": "532523"
						},
						{
							"label": "建水县",
							"position": [
								"102.820493",
								"23.618387"
							],
							"value": "532524"
						},
						{
							"label": "石屏县",
							"position": [
								"102.484469",
								"23.712569"
							],
							"value": "532525"
						},
						{
							"label": "泸西县",
							"position": [
								"103.759622",
								"24.532368"
							],
							"value": "532527"
						},
						{
							"label": "元阳县",
							"position": [
								"102.837056",
								"23.219773"
							],
							"value": "532528"
						},
						{
							"label": "红河县",
							"position": [
								"102.42121",
								"23.369191"
							],
							"value": "532529"
						},
						{
							"label": "金平苗族瑶族傣族自治县",
							"position": [
								"103.228359",
								"22.779982"
							],
							"value": "532530"
						},
						{
							"label": "绿春县",
							"position": [
								"102.39286",
								"22.99352"
							],
							"value": "532531"
						},
						{
							"label": "河口瑶族自治县",
							"position": [
								"103.961593",
								"22.507563"
							],
							"value": "532532"
						}
					]
				},
				{
					"label": "文山壮族苗族自治州",
					"position": [
						"104.24401",
						"23.36951"
					],
					"value": "532600",
					"children": [{
							"label": "文山市",
							"position": [
								"104.244277",
								"23.369216"
							],
							"value": "532601"
						},
						{
							"label": "砚山县",
							"position": [
								"104.343989",
								"23.612301"
							],
							"value": "532622"
						},
						{
							"label": "西畴县",
							"position": [
								"104.675711",
								"23.437439"
							],
							"value": "532623"
						},
						{
							"label": "麻栗坡县",
							"position": [
								"104.701899",
								"23.124202"
							],
							"value": "532624"
						},
						{
							"label": "马关县",
							"position": [
								"104.398619",
								"23.011723"
							],
							"value": "532625"
						},
						{
							"label": "丘北县",
							"position": [
								"104.194366",
								"24.040982"
							],
							"value": "532626"
						},
						{
							"label": "广南县",
							"position": [
								"105.056684",
								"24.050272"
							],
							"value": "532627"
						},
						{
							"label": "富宁县",
							"position": [
								"105.62856",
								"23.626494"
							],
							"value": "532628"
						}
					]
				},
				{
					"label": "西双版纳傣族自治州",
					"position": [
						"100.797941",
						"22.001724"
					],
					"value": "532800",
					"children": [{
							"label": "景洪市",
							"position": [
								"100.797947",
								"22.002087"
							],
							"value": "532801"
						},
						{
							"label": "勐海县",
							"position": [
								"100.448288",
								"21.955866"
							],
							"value": "532822"
						},
						{
							"label": "勐腊县",
							"position": [
								"101.567051",
								"21.479449"
							],
							"value": "532823"
						}
					]
				},
				{
					"label": "大理白族自治州",
					"position": [
						"100.225668",
						"25.589449"
					],
					"value": "532900",
					"children": [{
							"label": "大理市",
							"position": [
								"100.241369",
								"25.593067"
							],
							"value": "532901"
						},
						{
							"label": "漾濞彝族自治县",
							"position": [
								"99.95797",
								"25.669543"
							],
							"value": "532922"
						},
						{
							"label": "祥云县",
							"position": [
								"100.554025",
								"25.477072"
							],
							"value": "532923"
						},
						{
							"label": "宾川县",
							"position": [
								"100.578957",
								"25.825904"
							],
							"value": "532924"
						},
						{
							"label": "弥渡县",
							"position": [
								"100.490669",
								"25.342594"
							],
							"value": "532925"
						},
						{
							"label": "南涧彝族自治县",
							"position": [
								"100.518683",
								"25.041279"
							],
							"value": "532926"
						},
						{
							"label": "巍山彝族回族自治县",
							"position": [
								"100.30793",
								"25.230909"
							],
							"value": "532927"
						},
						{
							"label": "永平县",
							"position": [
								"99.533536",
								"25.461281"
							],
							"value": "532928"
						},
						{
							"label": "云龙县",
							"position": [
								"99.369402",
								"25.884955"
							],
							"value": "532929"
						},
						{
							"label": "洱源县",
							"position": [
								"99.951708",
								"26.111184"
							],
							"value": "532930"
						},
						{
							"label": "剑川县",
							"position": [
								"99.905887",
								"26.530066"
							],
							"value": "532931"
						},
						{
							"label": "鹤庆县",
							"position": [
								"100.173375",
								"26.55839"
							],
							"value": "532932"
						}
					]
				},
				{
					"label": "德宏傣族景颇族自治州",
					"position": [
						"98.578363",
						"24.436694"
					],
					"value": "533100",
					"children": [{
							"label": "瑞丽市",
							"position": [
								"97.855883",
								"24.010734"
							],
							"value": "533102"
						},
						{
							"label": "芒市",
							"position": [
								"98.577608",
								"24.436699"
							],
							"value": "533103"
						},
						{
							"label": "梁河县",
							"position": [
								"98.298196",
								"24.80742"
							],
							"value": "533122"
						},
						{
							"label": "盈江县",
							"position": [
								"97.93393",
								"24.709541"
							],
							"value": "533123"
						},
						{
							"label": "陇川县",
							"position": [
								"97.794441",
								"24.184065"
							],
							"value": "533124"
						}
					]
				},
				{
					"label": "怒江傈僳族自治州",
					"position": [
						"98.854304",
						"25.850949"
					],
					"value": "533300",
					"children": [{
							"label": "泸水市",
							"position": [
								"98.854063",
								"25.851142"
							],
							"value": "533301"
						},
						{
							"label": "福贡县",
							"position": [
								"98.867413",
								"26.902738"
							],
							"value": "533323"
						},
						{
							"label": "贡山独龙族怒族自治县",
							"position": [
								"98.666141",
								"27.738054"
							],
							"value": "533324"
						},
						{
							"label": "兰坪白族普米族自治县",
							"position": [
								"99.421378",
								"26.453839"
							],
							"value": "533325"
						}
					]
				},
				{
					"label": "迪庆藏族自治州",
					"position": [
						"99.706463",
						"27.826853"
					],
					"value": "533400",
					"children": [{
							"label": "香格里拉市",
							"position": [
								"99.708667",
								"27.825804"
							],
							"value": "533401"
						},
						{
							"label": "德钦县",
							"position": [
								"98.91506",
								"28.483272"
							],
							"value": "533422"
						},
						{
							"label": "维西傈僳族自治县",
							"position": [
								"99.286355",
								"27.180948"
							],
							"value": "533423"
						}
					]
				}
			]
		},
		{
			"label": "西藏自治区",
			"position": [
				"91.132212",
				"29.660361"
			],
			"value": "540000",
			"children": [{
					"label": "拉萨市",
					"position": [
						"91.132212",
						"29.660361"
					],
					"value": "540100",
					"children": [{
							"label": "城关区",
							"position": [
								"91.132911",
								"29.659472"
							],
							"value": "540102"
						},
						{
							"label": "堆龙德庆区",
							"position": [
								"91.002823",
								"29.647347"
							],
							"value": "540103"
						},
						{
							"label": "达孜区",
							"position": [
								"91.350976",
								"29.670314"
							],
							"value": "540104"
						},
						{
							"label": "林周县",
							"position": [
								"91.261842",
								"29.895754"
							],
							"value": "540121"
						},
						{
							"label": "当雄县",
							"position": [
								"91.103551",
								"30.474819"
							],
							"value": "540122"
						},
						{
							"label": "尼木县",
							"position": [
								"90.165545",
								"29.431346"
							],
							"value": "540123"
						},
						{
							"label": "曲水县",
							"position": [
								"90.738051",
								"29.349895"
							],
							"value": "540124"
						},
						{
							"label": "墨竹工卡县",
							"position": [
								"91.731158",
								"29.834657"
							],
							"value": "540127"
						}
					]
				},
				{
					"label": "日喀则市",
					"position": [
						"88.885148",
						"29.267519"
					],
					"value": "540200",
					"children": [{
							"label": "桑珠孜区",
							"position": [
								"88.88667",
								"29.267003"
							],
							"value": "540202"
						},
						{
							"label": "南木林县",
							"position": [
								"89.099434",
								"29.680459"
							],
							"value": "540221"
						},
						{
							"label": "江孜县",
							"position": [
								"89.605044",
								"28.908845"
							],
							"value": "540222"
						},
						{
							"label": "定日县",
							"position": [
								"87.123887",
								"28.656667"
							],
							"value": "540223"
						},
						{
							"label": "萨迦县",
							"position": [
								"88.023007",
								"28.901077"
							],
							"value": "540224"
						},
						{
							"label": "拉孜县",
							"position": [
								"87.63743",
								"29.085136"
							],
							"value": "540225"
						},
						{
							"label": "昂仁县",
							"position": [
								"87.23578",
								"29.294758"
							],
							"value": "540226"
						},
						{
							"label": "谢通门县",
							"position": [
								"88.260517",
								"29.431597"
							],
							"value": "540227"
						},
						{
							"label": "白朗县",
							"position": [
								"89.263618",
								"29.106627"
							],
							"value": "540228"
						},
						{
							"label": "仁布县",
							"position": [
								"89.843207",
								"29.230299"
							],
							"value": "540229"
						},
						{
							"label": "康马县",
							"position": [
								"89.683406",
								"28.554719"
							],
							"value": "540230"
						},
						{
							"label": "定结县",
							"position": [
								"87.767723",
								"28.36409"
							],
							"value": "540231"
						},
						{
							"label": "仲巴县",
							"position": [
								"84.032826",
								"29.768336"
							],
							"value": "540232"
						},
						{
							"label": "亚东县",
							"position": [
								"88.906806",
								"27.482772"
							],
							"value": "540233"
						},
						{
							"label": "吉隆县",
							"position": [
								"85.298349",
								"28.852416"
							],
							"value": "540234"
						},
						{
							"label": "聂拉木县",
							"position": [
								"85.981953",
								"28.15595"
							],
							"value": "540235"
						},
						{
							"label": "萨嘎县",
							"position": [
								"85.234622",
								"29.328194"
							],
							"value": "540236"
						},
						{
							"label": "岗巴县",
							"position": [
								"88.518903",
								"28.274371"
							],
							"value": "540237"
						}
					]
				},
				{
					"label": "昌都市",
					"position": [
						"97.178452",
						"31.136875"
					],
					"value": "540300",
					"children": [{
							"label": "卡若区",
							"position": [
								"97.178255",
								"31.137035"
							],
							"value": "540302"
						},
						{
							"label": "江达县",
							"position": [
								"98.218351",
								"31.499534"
							],
							"value": "540321"
						},
						{
							"label": "贡觉县",
							"position": [
								"98.271191",
								"30.859206"
							],
							"value": "540322"
						},
						{
							"label": "类乌齐县",
							"position": [
								"96.601259",
								"31.213048"
							],
							"value": "540323"
						},
						{
							"label": "丁青县",
							"position": [
								"95.597748",
								"31.410681"
							],
							"value": "540324"
						},
						{
							"label": "察雅县",
							"position": [
								"97.565701",
								"30.653038"
							],
							"value": "540325"
						},
						{
							"label": "八宿县",
							"position": [
								"96.917893",
								"30.053408"
							],
							"value": "540326"
						},
						{
							"label": "左贡县",
							"position": [
								"97.840532",
								"29.671335"
							],
							"value": "540327"
						},
						{
							"label": "芒康县",
							"position": [
								"98.596444",
								"29.686615"
							],
							"value": "540328"
						},
						{
							"label": "洛隆县",
							"position": [
								"95.823418",
								"30.741947"
							],
							"value": "540329"
						},
						{
							"label": "边坝县",
							"position": [
								"94.707504",
								"30.933849"
							],
							"value": "540330"
						}
					]
				},
				{
					"label": "林芝市",
					"position": [
						"94.362348",
						"29.654693"
					],
					"value": "540400",
					"children": [{
							"label": "巴宜区",
							"position": [
								"94.360987",
								"29.653732"
							],
							"value": "540402"
						},
						{
							"label": "工布江达县",
							"position": [
								"93.246515",
								"29.88447"
							],
							"value": "540421"
						},
						{
							"label": "米林县",
							"position": [
								"94.213679",
								"29.213811"
							],
							"value": "540422"
						},
						{
							"label": "墨脱县",
							"position": [
								"95.332245",
								"29.32573"
							],
							"value": "540423"
						},
						{
							"label": "波密县",
							"position": [
								"95.768151",
								"29.858771"
							],
							"value": "540424"
						},
						{
							"label": "察隅县",
							"position": [
								"97.465002",
								"28.660244"
							],
							"value": "540425"
						},
						{
							"label": "朗县",
							"position": [
								"93.073429",
								"29.0446"
							],
							"value": "540426"
						}
					]
				},
				{
					"label": "山南市",
					"position": [
						"91.766529",
						"29.236023"
					],
					"value": "540500",
					"children": [{
							"label": "乃东区",
							"position": [
								"91.76525",
								"29.236106"
							],
							"value": "540502"
						},
						{
							"label": "扎囊县",
							"position": [
								"91.338",
								"29.246476"
							],
							"value": "540521"
						},
						{
							"label": "贡嘎县",
							"position": [
								"90.985271",
								"29.289078"
							],
							"value": "540522"
						},
						{
							"label": "桑日县",
							"position": [
								"92.015732",
								"29.259774"
							],
							"value": "540523"
						},
						{
							"label": "琼结县",
							"position": [
								"91.683753",
								"29.025242"
							],
							"value": "540524"
						},
						{
							"label": "曲松县",
							"position": [
								"92.201066",
								"29.063656"
							],
							"value": "540525"
						},
						{
							"label": "措美县",
							"position": [
								"91.432347",
								"28.437353"
							],
							"value": "540526"
						},
						{
							"label": "洛扎县",
							"position": [
								"90.858243",
								"28.385765"
							],
							"value": "540527"
						},
						{
							"label": "加查县",
							"position": [
								"92.591043",
								"29.140921"
							],
							"value": "540528"
						},
						{
							"label": "隆子县",
							"position": [
								"92.463309",
								"28.408548"
							],
							"value": "540529"
						},
						{
							"label": "错那县",
							"position": [
								"91.960132",
								"27.991707"
							],
							"value": "540530"
						},
						{
							"label": "浪卡子县",
							"position": [
								"90.398747",
								"28.96836"
							],
							"value": "540531"
						}
					]
				},
				{
					"label": "那曲市",
					"position": [
						"92.060214",
						"31.476004"
					],
					"value": "540600",
					"children": [{
							"label": "色尼区",
							"position": [
								"92.061862",
								"31.475756"
							],
							"value": "540602"
						},
						{
							"label": "嘉黎县",
							"position": [
								"93.232907",
								"30.640846"
							],
							"value": "540621"
						},
						{
							"label": "比如县",
							"position": [
								"93.68044",
								"31.479917"
							],
							"value": "540622"
						},
						{
							"label": "聂荣县",
							"position": [
								"92.303659",
								"32.107855"
							],
							"value": "540623"
						},
						{
							"label": "安多县",
							"position": [
								"91.681879",
								"32.260299"
							],
							"value": "540624"
						},
						{
							"label": "申扎县",
							"position": [
								"88.709777",
								"30.929056"
							],
							"value": "540625"
						},
						{
							"label": "索县",
							"position": [
								"93.784964",
								"31.886173"
							],
							"value": "540626"
						},
						{
							"label": "班戈县",
							"position": [
								"90.011822",
								"31.394578"
							],
							"value": "540627"
						},
						{
							"label": "巴青县",
							"position": [
								"94.054049",
								"31.918691"
							],
							"value": "540628"
						},
						{
							"label": "尼玛县",
							"position": [
								"87.236646",
								"31.784979"
							],
							"value": "540629"
						},
						{
							"label": "双湖县",
							"position": [
								"88.838578",
								"33.18698"
							],
							"value": "540630"
						}
					]
				},
				{
					"label": "阿里地区",
					"position": [
						"80.105498",
						"32.503187"
					],
					"value": "542500",
					"children": [{
							"label": "普兰县",
							"position": [
								"81.177588",
								"30.291896"
							],
							"value": "542521"
						},
						{
							"label": "札达县",
							"position": [
								"79.803191",
								"31.478587"
							],
							"value": "542522"
						},
						{
							"label": "噶尔县",
							"position": [
								"80.105005",
								"32.503373"
							],
							"value": "542523"
						},
						{
							"label": "日土县",
							"position": [
								"79.731937",
								"33.382454"
							],
							"value": "542524"
						},
						{
							"label": "革吉县",
							"position": [
								"81.142896",
								"32.389192"
							],
							"value": "542525"
						},
						{
							"label": "改则县",
							"position": [
								"84.062384",
								"32.302076"
							],
							"value": "542526"
						},
						{
							"label": "措勤县",
							"position": [
								"85.159254",
								"31.016774"
							],
							"value": "542527"
						}
					]
				}
			]
		},
		{
			"label": "陕西省",
			"position": [
				"108.948024",
				"34.263161"
			],
			"value": "610000",
			"children": [{
					"label": "西安市",
					"position": [
						"108.948024",
						"34.263161"
					],
					"value": "610100",
					"children": [{
							"label": "新城区",
							"position": [
								"108.959903",
								"34.26927"
							],
							"value": "610102"
						},
						{
							"label": "碑林区",
							"position": [
								"108.946994",
								"34.251061"
							],
							"value": "610103"
						},
						{
							"label": "莲湖区",
							"position": [
								"108.933194",
								"34.2656"
							],
							"value": "610104"
						},
						{
							"label": "灞桥区",
							"position": [
								"109.067261",
								"34.267453"
							],
							"value": "610111"
						},
						{
							"label": "未央区",
							"position": [
								"108.946022",
								"34.30823"
							],
							"value": "610112"
						},
						{
							"label": "雁塔区",
							"position": [
								"108.926593",
								"34.213389"
							],
							"value": "610113"
						},
						{
							"label": "阎良区",
							"position": [
								"109.22802",
								"34.662141"
							],
							"value": "610114"
						},
						{
							"label": "临潼区",
							"position": [
								"109.213986",
								"34.372065"
							],
							"value": "610115"
						},
						{
							"label": "长安区",
							"position": [
								"108.941579",
								"34.157097"
							],
							"value": "610116"
						},
						{
							"label": "高陵区",
							"position": [
								"109.088896",
								"34.535065"
							],
							"value": "610117"
						},
						{
							"label": "鄠邑区",
							"position": [
								"108.607385",
								"34.108668"
							],
							"value": "610118"
						},
						{
							"label": "蓝田县",
							"position": [
								"109.317634",
								"34.156189"
							],
							"value": "610122"
						},
						{
							"label": "周至县",
							"position": [
								"108.216465",
								"34.161532"
							],
							"value": "610124"
						}
					]
				},
				{
					"label": "铜川市",
					"position": [
						"108.979608",
						"34.916582"
					],
					"value": "610200",
					"children": [{
							"label": "王益区",
							"position": [
								"109.075862",
								"35.069098"
							],
							"value": "610202"
						},
						{
							"label": "印台区",
							"position": [
								"109.100814",
								"35.111927"
							],
							"value": "610203"
						},
						{
							"label": "耀州区",
							"position": [
								"108.962538",
								"34.910206"
							],
							"value": "610204"
						},
						{
							"label": "宜君县",
							"position": [
								"109.118278",
								"35.398766"
							],
							"value": "610222"
						}
					]
				},
				{
					"label": "宝鸡市",
					"position": [
						"107.14487",
						"34.369315"
					],
					"value": "610300",
					"children": [{
							"label": "渭滨区",
							"position": [
								"107.144467",
								"34.371008"
							],
							"value": "610302"
						},
						{
							"label": "金台区",
							"position": [
								"107.149943",
								"34.375192"
							],
							"value": "610303"
						},
						{
							"label": "陈仓区",
							"position": [
								"107.383645",
								"34.352747"
							],
							"value": "610304"
						},
						{
							"label": "凤翔县",
							"position": [
								"107.400577",
								"34.521668"
							],
							"value": "610322"
						},
						{
							"label": "岐山县",
							"position": [
								"107.624464",
								"34.44296"
							],
							"value": "610323"
						},
						{
							"label": "扶风县",
							"position": [
								"107.891419",
								"34.375497"
							],
							"value": "610324"
						},
						{
							"label": "眉县",
							"position": [
								"107.752371",
								"34.272137"
							],
							"value": "610326"
						},
						{
							"label": "陇县",
							"position": [
								"106.857066",
								"34.893262"
							],
							"value": "610327"
						},
						{
							"label": "千阳县",
							"position": [
								"107.132987",
								"34.642584"
							],
							"value": "610328"
						},
						{
							"label": "麟游县",
							"position": [
								"107.796608",
								"34.677714"
							],
							"value": "610329"
						},
						{
							"label": "凤县",
							"position": [
								"106.525212",
								"33.912464"
							],
							"value": "610330"
						},
						{
							"label": "太白县",
							"position": [
								"107.316533",
								"34.059215"
							],
							"value": "610331"
						}
					]
				},
				{
					"label": "咸阳市",
					"position": [
						"108.705117",
						"34.333439"
					],
					"value": "610400",
					"children": [{
							"label": "秦都区",
							"position": [
								"108.698636",
								"34.329801"
							],
							"value": "610402"
						},
						{
							"label": "杨陵区",
							"position": [
								"108.086348",
								"34.27135"
							],
							"value": "610403"
						},
						{
							"label": "渭城区",
							"position": [
								"108.730957",
								"34.336847"
							],
							"value": "610404"
						},
						{
							"label": "三原县",
							"position": [
								"108.943481",
								"34.613996"
							],
							"value": "610422"
						},
						{
							"label": "泾阳县",
							"position": [
								"108.83784",
								"34.528493"
							],
							"value": "610423"
						},
						{
							"label": "乾县",
							"position": [
								"108.247406",
								"34.527261"
							],
							"value": "610424"
						},
						{
							"label": "礼泉县",
							"position": [
								"108.428317",
								"34.482583"
							],
							"value": "610425"
						},
						{
							"label": "永寿县",
							"position": [
								"108.143129",
								"34.692619"
							],
							"value": "610426"
						},
						{
							"label": "长武县",
							"position": [
								"107.795835",
								"35.206122"
							],
							"value": "610428"
						},
						{
							"label": "旬邑县",
							"position": [
								"108.337231",
								"35.112234"
							],
							"value": "610429"
						},
						{
							"label": "淳化县",
							"position": [
								"108.581173",
								"34.79797"
							],
							"value": "610430"
						},
						{
							"label": "武功县",
							"position": [
								"108.212857",
								"34.259732"
							],
							"value": "610431"
						},
						{
							"label": "兴平市",
							"position": [
								"108.488493",
								"34.297134"
							],
							"value": "610481"
						},
						{
							"label": "彬州市",
							"position": [
								"108.083674",
								"35.034233"
							],
							"value": "610482"
						}
					]
				},
				{
					"label": "渭南市",
					"position": [
						"109.502882",
						"34.499381"
					],
					"value": "610500",
					"children": [{
							"label": "临渭区",
							"position": [
								"109.503299",
								"34.501271"
							],
							"value": "610502"
						},
						{
							"label": "华州区",
							"position": [
								"109.76141",
								"34.511958"
							],
							"value": "610503"
						},
						{
							"label": "潼关县",
							"position": [
								"110.24726",
								"34.544515"
							],
							"value": "610522"
						},
						{
							"label": "大荔县",
							"position": [
								"109.943123",
								"34.795011"
							],
							"value": "610523"
						},
						{
							"label": "合阳县",
							"position": [
								"110.147979",
								"35.237098"
							],
							"value": "610524"
						},
						{
							"label": "澄城县",
							"position": [
								"109.937609",
								"35.184"
							],
							"value": "610525"
						},
						{
							"label": "蒲城县",
							"position": [
								"109.589653",
								"34.956034"
							],
							"value": "610526"
						},
						{
							"label": "白水县",
							"position": [
								"109.594309",
								"35.177291"
							],
							"value": "610527"
						},
						{
							"label": "富平县",
							"position": [
								"109.187174",
								"34.746679"
							],
							"value": "610528"
						},
						{
							"label": "韩城市",
							"position": [
								"110.452391",
								"35.475238"
							],
							"value": "610581"
						},
						{
							"label": "华阴市",
							"position": [
								"110.08952",
								"34.565359"
							],
							"value": "610582"
						}
					]
				},
				{
					"label": "延安市",
					"position": [
						"109.49081",
						"36.596537"
					],
					"value": "610600",
					"children": [{
							"label": "宝塔区",
							"position": [
								"109.49069",
								"36.596291"
							],
							"value": "610602"
						},
						{
							"label": "安塞区",
							"position": [
								"109.325341",
								"36.86441"
							],
							"value": "610603"
						},
						{
							"label": "延长县",
							"position": [
								"110.012961",
								"36.578306"
							],
							"value": "610621"
						},
						{
							"label": "延川县",
							"position": [
								"110.190314",
								"36.882066"
							],
							"value": "610622"
						},
						{
							"label": "志丹县",
							"position": [
								"108.768898",
								"36.823031"
							],
							"value": "610625"
						},
						{
							"label": "吴起县",
							"position": [
								"108.176976",
								"36.924852"
							],
							"value": "610626"
						},
						{
							"label": "甘泉县",
							"position": [
								"109.34961",
								"36.277729"
							],
							"value": "610627"
						},
						{
							"label": "富县",
							"position": [
								"109.384136",
								"35.996495"
							],
							"value": "610628"
						},
						{
							"label": "洛川县",
							"position": [
								"109.435712",
								"35.762133"
							],
							"value": "610629"
						},
						{
							"label": "宜川县",
							"position": [
								"110.175537",
								"36.050391"
							],
							"value": "610630"
						},
						{
							"label": "黄龙县",
							"position": [
								"109.83502",
								"35.583276"
							],
							"value": "610631"
						},
						{
							"label": "黄陵县",
							"position": [
								"109.262469",
								"35.580165"
							],
							"value": "610632"
						},
						{
							"label": "子长市",
							"position": [
								"109.675968",
								"37.14207"
							],
							"value": "610681"
						}
					]
				},
				{
					"label": "汉中市",
					"position": [
						"107.028621",
						"33.077668"
					],
					"value": "610700",
					"children": [{
							"label": "汉台区",
							"position": [
								"107.028233",
								"33.077674"
							],
							"value": "610702"
						},
						{
							"label": "南郑区",
							"position": [
								"106.942393",
								"33.003341"
							],
							"value": "610703"
						},
						{
							"label": "城固县",
							"position": [
								"107.329887",
								"33.153098"
							],
							"value": "610722"
						},
						{
							"label": "洋县",
							"position": [
								"107.549962",
								"33.223283"
							],
							"value": "610723"
						},
						{
							"label": "西乡县",
							"position": [
								"107.765858",
								"32.987961"
							],
							"value": "610724"
						},
						{
							"label": "勉县",
							"position": [
								"106.680175",
								"33.155618"
							],
							"value": "610725"
						},
						{
							"label": "宁强县",
							"position": [
								"106.25739",
								"32.830806"
							],
							"value": "610726"
						},
						{
							"label": "略阳县",
							"position": [
								"106.153899",
								"33.329638"
							],
							"value": "610727"
						},
						{
							"label": "镇巴县",
							"position": [
								"107.89531",
								"32.535854"
							],
							"value": "610728"
						},
						{
							"label": "留坝县",
							"position": [
								"106.924377",
								"33.61334"
							],
							"value": "610729"
						},
						{
							"label": "佛坪县",
							"position": [
								"107.988582",
								"33.520745"
							],
							"value": "610730"
						}
					]
				},
				{
					"label": "榆林市",
					"position": [
						"109.741193",
						"38.290162"
					],
					"value": "610800",
					"children": [{
							"label": "榆阳区",
							"position": [
								"109.74791",
								"38.299267"
							],
							"value": "610802"
						},
						{
							"label": "横山区",
							"position": [
								"109.292596",
								"37.964048"
							],
							"value": "610803"
						},
						{
							"label": "府谷县",
							"position": [
								"111.069645",
								"39.029243"
							],
							"value": "610822"
						},
						{
							"label": "靖边县",
							"position": [
								"108.80567",
								"37.596084"
							],
							"value": "610824"
						},
						{
							"label": "定边县",
							"position": [
								"107.601284",
								"37.59523"
							],
							"value": "610825"
						},
						{
							"label": "绥德县",
							"position": [
								"110.265377",
								"37.507701"
							],
							"value": "610826"
						},
						{
							"label": "米脂县",
							"position": [
								"110.178683",
								"37.759081"
							],
							"value": "610827"
						},
						{
							"label": "佳县",
							"position": [
								"110.493367",
								"38.021597"
							],
							"value": "610828"
						},
						{
							"label": "吴堡县",
							"position": [
								"110.739315",
								"37.451925"
							],
							"value": "610829"
						},
						{
							"label": "清涧县",
							"position": [
								"110.12146",
								"37.087702"
							],
							"value": "610830"
						},
						{
							"label": "子洲县",
							"position": [
								"110.03457",
								"37.611573"
							],
							"value": "610831"
						},
						{
							"label": "神木市",
							"position": [
								"110.497005",
								"38.835641"
							],
							"value": "610881"
						}
					]
				},
				{
					"label": "安康市",
					"position": [
						"109.029273",
						"32.6903"
					],
					"value": "610900",
					"children": [{
							"label": "汉滨区",
							"position": [
								"109.029098",
								"32.690817"
							],
							"value": "610902"
						},
						{
							"label": "汉阴县",
							"position": [
								"108.510946",
								"32.891121"
							],
							"value": "610921"
						},
						{
							"label": "石泉县",
							"position": [
								"108.250512",
								"33.038512"
							],
							"value": "610922"
						},
						{
							"label": "宁陕县",
							"position": [
								"108.313714",
								"33.312184"
							],
							"value": "610923"
						},
						{
							"label": "紫阳县",
							"position": [
								"108.537788",
								"32.520176"
							],
							"value": "610924"
						},
						{
							"label": "岚皋县",
							"position": [
								"108.900663",
								"32.31069"
							],
							"value": "610925"
						},
						{
							"label": "平利县",
							"position": [
								"109.361865",
								"32.387933"
							],
							"value": "610926"
						},
						{
							"label": "镇坪县",
							"position": [
								"109.526437",
								"31.883395"
							],
							"value": "610927"
						},
						{
							"label": "旬阳县",
							"position": [
								"109.368149",
								"32.833567"
							],
							"value": "610928"
						},
						{
							"label": "白河县",
							"position": [
								"110.114186",
								"32.809484"
							],
							"value": "610929"
						}
					]
				},
				{
					"label": "商洛市",
					"position": [
						"109.939776",
						"33.868319"
					],
					"value": "611000",
					"children": [{
							"label": "商州区",
							"position": [
								"109.937685",
								"33.869208"
							],
							"value": "611002"
						},
						{
							"label": "洛南县",
							"position": [
								"110.145716",
								"34.088502"
							],
							"value": "611021"
						},
						{
							"label": "丹凤县",
							"position": [
								"110.33191",
								"33.694711"
							],
							"value": "611022"
						},
						{
							"label": "商南县",
							"position": [
								"110.885437",
								"33.526367"
							],
							"value": "611023"
						},
						{
							"label": "山阳县",
							"position": [
								"109.880435",
								"33.530411"
							],
							"value": "611024"
						},
						{
							"label": "镇安县",
							"position": [
								"109.151075",
								"33.423981"
							],
							"value": "611025"
						},
						{
							"label": "柞水县",
							"position": [
								"109.111249",
								"33.682773"
							],
							"value": "611026"
						}
					]
				}
			]
		},
		{
			"label": "甘肃省",
			"position": [
				"103.823557",
				"36.058039"
			],
			"value": "620000",
			"children": [{
					"label": "兰州市",
					"position": [
						"103.823557",
						"36.058039"
					],
					"value": "620100",
					"children": [{
							"label": "城关区",
							"position": [
								"103.841032",
								"36.049115"
							],
							"value": "620102"
						},
						{
							"label": "七里河区",
							"position": [
								"103.784326",
								"36.06673"
							],
							"value": "620103"
						},
						{
							"label": "西固区",
							"position": [
								"103.622331",
								"36.100369"
							],
							"value": "620104"
						},
						{
							"label": "安宁区",
							"position": [
								"103.724038",
								"36.10329"
							],
							"value": "620105"
						},
						{
							"label": "红古区",
							"position": [
								"102.861814",
								"36.344177"
							],
							"value": "620111"
						},
						{
							"label": "永登县",
							"position": [
								"103.262203",
								"36.734428"
							],
							"value": "620121"
						},
						{
							"label": "皋兰县",
							"position": [
								"103.94933",
								"36.331254"
							],
							"value": "620122"
						},
						{
							"label": "榆中县",
							"position": [
								"104.114975",
								"35.84443"
							],
							"value": "620123"
						}
					]
				},
				{
					"label": "嘉峪关市",
					"position": [
						"98.277304",
						"39.786529"
					],
					"value": "620200",
					"children": [{
							"label": "峪泉镇",
							"position": [
								"98.3204",
								"39.9583"
							],
							"value": "620200"
						},
						{
							"label": "新城镇",
							"position": [
								"98.3627",
								"39.9581"
							],
							"value": "620200"
						},
						{
							"label": "文殊镇",
							"position": [
								"98.1579",
								"39.6969"
							],
							"value": "620200"
						},
						{
							"label": "钢城街道",
							"position": [
								"98.2926",
								"39.7558"
							],
							"value": "620200"
						},
						{
							"label": "雄关街道",
							"position": [
								"98.2391",
								"39.893"
							],
							"value": "620200"
						}
					]
				},
				{
					"label": "金昌市",
					"position": [
						"102.187888",
						"38.514238"
					],
					"value": "620300",
					"children": [{
							"label": "金川区",
							"position": [
								"102.187683",
								"38.513793"
							],
							"value": "620302"
						},
						{
							"label": "永昌县",
							"position": [
								"101.971957",
								"38.247354"
							],
							"value": "620321"
						}
					]
				},
				{
					"label": "白银市",
					"position": [
						"104.173606",
						"36.54568"
					],
					"value": "620400",
					"children": [{
							"label": "白银区",
							"position": [
								"104.17425",
								"36.545649"
							],
							"value": "620402"
						},
						{
							"label": "平川区",
							"position": [
								"104.819207",
								"36.72921"
							],
							"value": "620403"
						},
						{
							"label": "靖远县",
							"position": [
								"104.686972",
								"36.561424"
							],
							"value": "620421"
						},
						{
							"label": "会宁县",
							"position": [
								"105.054337",
								"35.692486"
							],
							"value": "620422"
						},
						{
							"label": "景泰县",
							"position": [
								"104.066394",
								"37.193519"
							],
							"value": "620423"
						}
					]
				},
				{
					"label": "天水市",
					"position": [
						"105.724998",
						"34.578529"
					],
					"value": "620500",
					"children": [{
							"label": "秦州区",
							"position": [
								"105.724477",
								"34.578645"
							],
							"value": "620502"
						},
						{
							"label": "麦积区",
							"position": [
								"105.897631",
								"34.563504"
							],
							"value": "620503"
						},
						{
							"label": "清水县",
							"position": [
								"106.139878",
								"34.75287"
							],
							"value": "620521"
						},
						{
							"label": "秦安县",
							"position": [
								"105.6733",
								"34.862354"
							],
							"value": "620522"
						},
						{
							"label": "甘谷县",
							"position": [
								"105.332347",
								"34.747327"
							],
							"value": "620523"
						},
						{
							"label": "武山县",
							"position": [
								"104.891696",
								"34.721955"
							],
							"value": "620524"
						},
						{
							"label": "张家川回族自治县",
							"position": [
								"106.212416",
								"34.993237"
							],
							"value": "620525"
						}
					]
				},
				{
					"label": "武威市",
					"position": [
						"102.634697",
						"37.929996"
					],
					"value": "620600",
					"children": [{
							"label": "凉州区",
							"position": [
								"102.634492",
								"37.93025"
							],
							"value": "620602"
						},
						{
							"label": "民勤县",
							"position": [
								"103.090654",
								"38.624621"
							],
							"value": "620621"
						},
						{
							"label": "古浪县",
							"position": [
								"102.898047",
								"37.470571"
							],
							"value": "620622"
						},
						{
							"label": "天祝藏族自治县",
							"position": [
								"103.142034",
								"36.971678"
							],
							"value": "620623"
						}
					]
				},
				{
					"label": "张掖市",
					"position": [
						"100.455472",
						"38.932897"
					],
					"value": "620700",
					"children": [{
							"label": "甘州区",
							"position": [
								"100.454862",
								"38.931774"
							],
							"value": "620702"
						},
						{
							"label": "肃南裕固族自治县",
							"position": [
								"99.617086",
								"38.837269"
							],
							"value": "620721"
						},
						{
							"label": "民乐县",
							"position": [
								"100.816623",
								"38.434454"
							],
							"value": "620722"
						},
						{
							"label": "临泽县",
							"position": [
								"100.166333",
								"39.152151"
							],
							"value": "620723"
						},
						{
							"label": "高台县",
							"position": [
								"99.81665",
								"39.376308"
							],
							"value": "620724"
						},
						{
							"label": "山丹县",
							"position": [
								"101.088442",
								"38.784839"
							],
							"value": "620725"
						}
					]
				},
				{
					"label": "平凉市",
					"position": [
						"106.684691",
						"35.54279"
					],
					"value": "620800",
					"children": [{
							"label": "崆峒区",
							"position": [
								"106.684223",
								"35.54173"
							],
							"value": "620802"
						},
						{
							"label": "泾川县",
							"position": [
								"107.365218",
								"35.335283"
							],
							"value": "620821"
						},
						{
							"label": "灵台县",
							"position": [
								"107.620587",
								"35.064009"
							],
							"value": "620822"
						},
						{
							"label": "崇信县",
							"position": [
								"107.031253",
								"35.304533"
							],
							"value": "620823"
						},
						{
							"label": "庄浪县",
							"position": [
								"106.041979",
								"35.203428"
							],
							"value": "620825"
						},
						{
							"label": "静宁县",
							"position": [
								"105.733489",
								"35.525243"
							],
							"value": "620826"
						},
						{
							"label": "华亭市",
							"position": [
								"106.649308",
								"35.215341"
							],
							"value": "620881"
						}
					]
				},
				{
					"label": "酒泉市",
					"position": [
						"98.510795",
						"39.744023"
					],
					"value": "620900",
					"children": [{
							"label": "肃州区",
							"position": [
								"98.511155",
								"39.743858"
							],
							"value": "620902"
						},
						{
							"label": "金塔县",
							"position": [
								"98.902959",
								"39.983036"
							],
							"value": "620921"
						},
						{
							"label": "瓜州县",
							"position": [
								"95.780591",
								"40.516525"
							],
							"value": "620922"
						},
						{
							"label": "肃北蒙古族自治县",
							"position": [
								"94.87728",
								"39.51224"
							],
							"value": "620923"
						},
						{
							"label": "阿克塞哈萨克族自治县",
							"position": [
								"94.337642",
								"39.631642"
							],
							"value": "620924"
						},
						{
							"label": "玉门市",
							"position": [
								"97.037206",
								"40.28682"
							],
							"value": "620981"
						},
						{
							"label": "敦煌市",
							"position": [
								"94.664279",
								"40.141119"
							],
							"value": "620982"
						}
					]
				},
				{
					"label": "庆阳市",
					"position": [
						"107.638372",
						"35.734218"
					],
					"value": "621000",
					"children": [{
							"label": "西峰区",
							"position": [
								"107.638824",
								"35.733713"
							],
							"value": "621002"
						},
						{
							"label": "庆城县",
							"position": [
								"107.885664",
								"36.013504"
							],
							"value": "621021"
						},
						{
							"label": "环县",
							"position": [
								"107.308754",
								"36.569322"
							],
							"value": "621022"
						},
						{
							"label": "华池县",
							"position": [
								"107.986288",
								"36.457304"
							],
							"value": "621023"
						},
						{
							"label": "合水县",
							"position": [
								"108.019865",
								"35.819005"
							],
							"value": "621024"
						},
						{
							"label": "正宁县",
							"position": [
								"108.361068",
								"35.490642"
							],
							"value": "621025"
						},
						{
							"label": "宁县",
							"position": [
								"107.921182",
								"35.50201"
							],
							"value": "621026"
						},
						{
							"label": "镇原县",
							"position": [
								"107.195706",
								"35.677806"
							],
							"value": "621027"
						}
					]
				},
				{
					"label": "定西市",
					"position": [
						"104.626294",
						"35.579578"
					],
					"value": "621100",
					"children": [{
							"label": "安定区",
							"position": [
								"104.62577",
								"35.579764"
							],
							"value": "621102"
						},
						{
							"label": "通渭县",
							"position": [
								"105.250102",
								"35.208922"
							],
							"value": "621121"
						},
						{
							"label": "陇西县",
							"position": [
								"104.637554",
								"35.003409"
							],
							"value": "621122"
						},
						{
							"label": "渭源县",
							"position": [
								"104.211742",
								"35.133023"
							],
							"value": "621123"
						},
						{
							"label": "临洮县",
							"position": [
								"103.862186",
								"35.376233"
							],
							"value": "621124"
						},
						{
							"label": "漳县",
							"position": [
								"104.466756",
								"34.848642"
							],
							"value": "621125"
						},
						{
							"label": "岷县",
							"position": [
								"104.039882",
								"34.439105"
							],
							"value": "621126"
						}
					]
				},
				{
					"label": "陇南市",
					"position": [
						"104.929379",
						"33.388598"
					],
					"value": "621200",
					"children": [{
							"label": "武都区",
							"position": [
								"104.929866",
								"33.388155"
							],
							"value": "621202"
						},
						{
							"label": "成县",
							"position": [
								"105.734434",
								"33.739863"
							],
							"value": "621221"
						},
						{
							"label": "文县",
							"position": [
								"104.682448",
								"32.942171"
							],
							"value": "621222"
						},
						{
							"label": "宕昌县",
							"position": [
								"104.394475",
								"34.042655"
							],
							"value": "621223"
						},
						{
							"label": "康县",
							"position": [
								"105.609534",
								"33.328266"
							],
							"value": "621224"
						},
						{
							"label": "西和县",
							"position": [
								"105.299737",
								"34.013718"
							],
							"value": "621225"
						},
						{
							"label": "礼县",
							"position": [
								"105.181616",
								"34.189387"
							],
							"value": "621226"
						},
						{
							"label": "徽县",
							"position": [
								"106.085632",
								"33.767785"
							],
							"value": "621227"
						},
						{
							"label": "两当县",
							"position": [
								"106.306959",
								"33.910729"
							],
							"value": "621228"
						}
					]
				},
				{
					"label": "临夏回族自治州",
					"position": [
						"103.212006",
						"35.599446"
					],
					"value": "622900",
					"children": [{
							"label": "临夏市",
							"position": [
								"103.211634",
								"35.59941"
							],
							"value": "622901"
						},
						{
							"label": "临夏县",
							"position": [
								"102.993873",
								"35.49236"
							],
							"value": "622921"
						},
						{
							"label": "康乐县",
							"position": [
								"103.709852",
								"35.371906"
							],
							"value": "622922"
						},
						{
							"label": "永靖县",
							"position": [
								"103.319871",
								"35.938933"
							],
							"value": "622923"
						},
						{
							"label": "广河县",
							"position": [
								"103.576188",
								"35.481688"
							],
							"value": "622924"
						},
						{
							"label": "和政县",
							"position": [
								"103.350357",
								"35.425971"
							],
							"value": "622925"
						},
						{
							"label": "东乡族自治县",
							"position": [
								"103.389568",
								"35.66383"
							],
							"value": "622926"
						},
						{
							"label": "积石山保安族东乡族撒拉族自治县",
							"position": [
								"102.877473",
								"35.712906"
							],
							"value": "622927"
						}
					]
				},
				{
					"label": "甘南藏族自治州",
					"position": [
						"102.911008",
						"34.986354"
					],
					"value": "623000",
					"children": [{
							"label": "合作市",
							"position": [
								"102.91149",
								"34.985973"
							],
							"value": "623001"
						},
						{
							"label": "临潭县",
							"position": [
								"103.353054",
								"34.69164"
							],
							"value": "623021"
						},
						{
							"label": "卓尼县",
							"position": [
								"103.508508",
								"34.588165"
							],
							"value": "623022"
						},
						{
							"label": "舟曲县",
							"position": [
								"104.370271",
								"33.782964"
							],
							"value": "623023"
						},
						{
							"label": "迭部县",
							"position": [
								"103.221009",
								"34.055348"
							],
							"value": "623024"
						},
						{
							"label": "玛曲县",
							"position": [
								"102.075767",
								"33.998068"
							],
							"value": "623025"
						},
						{
							"label": "碌曲县",
							"position": [
								"102.488495",
								"34.589591"
							],
							"value": "623026"
						},
						{
							"label": "夏河县",
							"position": [
								"102.520743",
								"35.200853"
							],
							"value": "623027"
						}
					]
				}
			]
		},
		{
			"label": "青海省",
			"position": [
				"101.778916",
				"36.623178"
			],
			"value": "630000",
			"children": [{
					"label": "西宁市",
					"position": [
						"101.778916",
						"36.623178"
					],
					"value": "630100",
					"children": [{
							"label": "城东区",
							"position": [
								"101.796095",
								"36.616043"
							],
							"value": "630102"
						},
						{
							"label": "城中区",
							"position": [
								"101.784554",
								"36.621181"
							],
							"value": "630103"
						},
						{
							"label": "城西区",
							"position": [
								"101.763649",
								"36.628323"
							],
							"value": "630104"
						},
						{
							"label": "城北区",
							"position": [
								"101.761297",
								"36.648448"
							],
							"value": "630105"
						},
						{
							"label": "湟中区",
							"position": [
								"101.569475",
								"36.500419"
							],
							"value": "630106"
						},
						{
							"label": "大通回族土族自治县",
							"position": [
								"101.684183",
								"36.931343"
							],
							"value": "630121"
						},
						{
							"label": "湟源县",
							"position": [
								"101.263435",
								"36.684818"
							],
							"value": "630123"
						}
					]
				},
				{
					"label": "海东市",
					"position": [
						"102.10327",
						"36.502916"
					],
					"value": "630200",
					"children": [{
							"label": "乐都区",
							"position": [
								"102.402431",
								"36.480291"
							],
							"value": "630202"
						},
						{
							"label": "平安区",
							"position": [
								"102.104295",
								"36.502714"
							],
							"value": "630203"
						},
						{
							"label": "民和回族土族自治县",
							"position": [
								"102.804209",
								"36.329451"
							],
							"value": "630222"
						},
						{
							"label": "互助土族自治县",
							"position": [
								"101.956734",
								"36.83994"
							],
							"value": "630223"
						},
						{
							"label": "化隆回族自治县",
							"position": [
								"102.262329",
								"36.098322"
							],
							"value": "630224"
						},
						{
							"label": "循化撒拉族自治县",
							"position": [
								"102.486534",
								"35.847247"
							],
							"value": "630225"
						}
					]
				},
				{
					"label": "海北藏族自治州",
					"position": [
						"100.901059",
						"36.959435"
					],
					"value": "632200",
					"children": [{
							"label": "门源回族自治县",
							"position": [
								"101.618461",
								"37.376627"
							],
							"value": "632221"
						},
						{
							"label": "祁连县",
							"position": [
								"100.249778",
								"38.175409"
							],
							"value": "632222"
						},
						{
							"label": "海晏县",
							"position": [
								"100.90049",
								"36.959542"
							],
							"value": "632223"
						},
						{
							"label": "刚察县",
							"position": [
								"100.138417",
								"37.326263"
							],
							"value": "632224"
						}
					]
				},
				{
					"label": "黄南藏族自治州",
					"position": [
						"102.019988",
						"35.517744"
					],
					"value": "632300",
					"children": [{
							"label": "同仁市",
							"position": [
								"102.017604",
								"35.516337"
							],
							"value": "632301"
						},
						{
							"label": "尖扎县",
							"position": [
								"102.031953",
								"35.938205"
							],
							"value": "632322"
						},
						{
							"label": "泽库县",
							"position": [
								"101.469343",
								"35.036842"
							],
							"value": "632323"
						},
						{
							"label": "河南蒙古族自治县",
							"position": [
								"101.611877",
								"34.734522"
							],
							"value": "632324"
						}
					]
				},
				{
					"label": "海南藏族自治州",
					"position": [
						"100.619542",
						"36.280353"
					],
					"value": "632500",
					"children": [{
							"label": "共和县",
							"position": [
								"100.619597",
								"36.280286"
							],
							"value": "632521"
						},
						{
							"label": "同德县",
							"position": [
								"100.579465",
								"35.254492"
							],
							"value": "632522"
						},
						{
							"label": "贵德县",
							"position": [
								"101.431856",
								"36.040456"
							],
							"value": "632523"
						},
						{
							"label": "兴海县",
							"position": [
								"99.986963",
								"35.58909"
							],
							"value": "632524"
						},
						{
							"label": "贵南县",
							"position": [
								"100.74792",
								"35.587085"
							],
							"value": "632525"
						}
					]
				},
				{
					"label": "果洛藏族自治州",
					"position": [
						"100.242143",
						"34.4736"
					],
					"value": "632600",
					"children": [{
							"label": "玛沁县",
							"position": [
								"100.243531",
								"34.473386"
							],
							"value": "632621"
						},
						{
							"label": "班玛县",
							"position": [
								"100.737955",
								"32.931589"
							],
							"value": "632622"
						},
						{
							"label": "甘德县",
							"position": [
								"99.902589",
								"33.966987"
							],
							"value": "632623"
						},
						{
							"label": "达日县",
							"position": [
								"99.651715",
								"33.753259"
							],
							"value": "632624"
						},
						{
							"label": "久治县",
							"position": [
								"101.484884",
								"33.430217"
							],
							"value": "632625"
						},
						{
							"label": "玛多县",
							"position": [
								"98.211343",
								"34.91528"
							],
							"value": "632626"
						}
					]
				},
				{
					"label": "玉树藏族自治州",
					"position": [
						"97.008522",
						"33.004049"
					],
					"value": "632700",
					"children": [{
							"label": "玉树市",
							"position": [
								"97.008762",
								"33.00393"
							],
							"value": "632701"
						},
						{
							"label": "杂多县",
							"position": [
								"95.293423",
								"32.891886"
							],
							"value": "632722"
						},
						{
							"label": "称多县",
							"position": [
								"97.110893",
								"33.367884"
							],
							"value": "632723"
						},
						{
							"label": "治多县",
							"position": [
								"95.616843",
								"33.852322"
							],
							"value": "632724"
						},
						{
							"label": "囊谦县",
							"position": [
								"96.479797",
								"32.203206"
							],
							"value": "632725"
						},
						{
							"label": "曲麻莱县",
							"position": [
								"95.800674",
								"34.12654"
							],
							"value": "632726"
						}
					]
				},
				{
					"label": "海西蒙古族藏族自治州",
					"position": [
						"97.370785",
						"37.374663"
					],
					"value": "632800",
					"children": [{
							"label": "格尔木市",
							"position": [
								"94.905777",
								"36.401541"
							],
							"value": "632801"
						},
						{
							"label": "德令哈市",
							"position": [
								"97.370143",
								"37.374555"
							],
							"value": "632802"
						},
						{
							"label": "茫崖市",
							"position": [
								"90.855955",
								"38.247117"
							],
							"value": "632803"
						},
						{
							"label": "乌兰县",
							"position": [
								"98.479852",
								"36.930389"
							],
							"value": "632821"
						},
						{
							"label": "都兰县",
							"position": [
								"98.089161",
								"36.298553"
							],
							"value": "632822"
						},
						{
							"label": "天峻县",
							"position": [
								"99.02078",
								"37.29906"
							],
							"value": "632823"
						},
						{
							"label": "海西蒙古族藏族自治州直辖",
							"position": [
								"95.357233",
								"37.853631"
							],
							"value": "632825"
						}
					]
				}
			]
		},
		{
			"label": "宁夏回族自治区",
			"position": [
				"106.278179",
				"38.46637"
			],
			"value": "640000",
			"children": [{
					"label": "银川市",
					"position": [
						"106.278179",
						"38.46637"
					],
					"value": "640100",
					"children": [{
							"label": "兴庆区",
							"position": [
								"106.278393",
								"38.46747"
							],
							"value": "640104"
						},
						{
							"label": "西夏区",
							"position": [
								"106.132116",
								"38.492424"
							],
							"value": "640105"
						},
						{
							"label": "金凤区",
							"position": [
								"106.228486",
								"38.477353"
							],
							"value": "640106"
						},
						{
							"label": "永宁县",
							"position": [
								"106.253781",
								"38.28043"
							],
							"value": "640121"
						},
						{
							"label": "贺兰县",
							"position": [
								"106.345904",
								"38.554563"
							],
							"value": "640122"
						},
						{
							"label": "灵武市",
							"position": [
								"106.334701",
								"38.094058"
							],
							"value": "640181"
						}
					]
				},
				{
					"label": "石嘴山市",
					"position": [
						"106.376173",
						"39.01333"
					],
					"value": "640200",
					"children": [{
							"label": "大武口区",
							"position": [
								"106.376651",
								"39.014158"
							],
							"value": "640202"
						},
						{
							"label": "惠农区",
							"position": [
								"106.775513",
								"39.230094"
							],
							"value": "640205"
						},
						{
							"label": "平罗县",
							"position": [
								"106.54489",
								"38.90674"
							],
							"value": "640221"
						}
					]
				},
				{
					"label": "吴忠市",
					"position": [
						"106.199409",
						"37.986165"
					],
					"value": "640300",
					"children": [{
							"label": "利通区",
							"position": [
								"106.199419",
								"37.985967"
							],
							"value": "640302"
						},
						{
							"label": "红寺堡区",
							"position": [
								"106.067315",
								"37.421616"
							],
							"value": "640303"
						},
						{
							"label": "盐池县",
							"position": [
								"107.40541",
								"37.784222"
							],
							"value": "640323"
						},
						{
							"label": "同心县",
							"position": [
								"105.914764",
								"36.9829"
							],
							"value": "640324"
						},
						{
							"label": "青铜峡市",
							"position": [
								"106.075395",
								"38.021509"
							],
							"value": "640381"
						}
					]
				},
				{
					"label": "固原市",
					"position": [
						"106.285241",
						"36.004561"
					],
					"value": "640400",
					"children": [{
							"label": "原州区",
							"position": [
								"106.28477",
								"36.005337"
							],
							"value": "640402"
						},
						{
							"label": "西吉县",
							"position": [
								"105.731801",
								"35.965384"
							],
							"value": "640422"
						},
						{
							"label": "隆德县",
							"position": [
								"106.12344",
								"35.618234"
							],
							"value": "640423"
						},
						{
							"label": "泾源县",
							"position": [
								"106.338674",
								"35.49344"
							],
							"value": "640424"
						},
						{
							"label": "彭阳县",
							"position": [
								"106.641512",
								"35.849975"
							],
							"value": "640425"
						}
					]
				},
				{
					"label": "中卫市",
					"position": [
						"105.189568",
						"37.514951"
					],
					"value": "640500",
					"children": [{
							"label": "沙坡头区",
							"position": [
								"105.190536",
								"37.514564"
							],
							"value": "640502"
						},
						{
							"label": "中宁县",
							"position": [
								"105.675784",
								"37.489736"
							],
							"value": "640521"
						},
						{
							"label": "海原县",
							"position": [
								"105.647323",
								"36.562007"
							],
							"value": "640522"
						}
					]
				}
			]
		},
		{
			"label": "新疆维吾尔自治区",
			"position": [
				"87.617733",
				"43.792818"
			],
			"value": "650000",
			"children": [{
					"label": "乌鲁木齐市",
					"position": [
						"87.617733",
						"43.792818"
					],
					"value": "650100",
					"children": [{
							"label": "天山区",
							"position": [
								"87.620116",
								"43.796428"
							],
							"value": "650102"
						},
						{
							"label": "沙依巴克区",
							"position": [
								"87.596639",
								"43.788872"
							],
							"value": "650103"
						},
						{
							"label": "新市区",
							"position": [
								"87.560653",
								"43.870882"
							],
							"value": "650104"
						},
						{
							"label": "水磨沟区",
							"position": [
								"87.613093",
								"43.816747"
							],
							"value": "650105"
						},
						{
							"label": "头屯河区",
							"position": [
								"87.425823",
								"43.876053"
							],
							"value": "650106"
						},
						{
							"label": "达坂城区",
							"position": [
								"88.30994",
								"43.36181"
							],
							"value": "650107"
						},
						{
							"label": "米东区",
							"position": [
								"87.691801",
								"43.960982"
							],
							"value": "650109"
						},
						{
							"label": "乌鲁木齐县",
							"position": [
								"87.505603",
								"43.982546"
							],
							"value": "650121"
						}
					]
				},
				{
					"label": "克拉玛依市",
					"position": [
						"84.873946",
						"45.595886"
					],
					"value": "650200",
					"children": [{
							"label": "独山子区",
							"position": [
								"84.882267",
								"44.327207"
							],
							"value": "650202"
						},
						{
							"label": "克拉玛依区",
							"position": [
								"84.868918",
								"45.600477"
							],
							"value": "650203"
						},
						{
							"label": "白碱滩区",
							"position": [
								"85.129882",
								"45.689021"
							],
							"value": "650204"
						},
						{
							"label": "乌尔禾区",
							"position": [
								"85.697767",
								"46.08776"
							],
							"value": "650205"
						}
					]
				},
				{
					"label": "吐鲁番市",
					"position": [
						"89.184078",
						"42.947613"
					],
					"value": "650400",
					"children": [{
							"label": "高昌区",
							"position": [
								"89.182324",
								"42.947627"
							],
							"value": "650402"
						},
						{
							"label": "鄯善县",
							"position": [
								"90.212692",
								"42.865503"
							],
							"value": "650421"
						},
						{
							"label": "托克逊县",
							"position": [
								"88.655771",
								"42.793536"
							],
							"value": "650422"
						}
					]
				},
				{
					"label": "哈密市",
					"position": [
						"93.51316",
						"42.833248"
					],
					"value": "650500",
					"children": [{
							"label": "伊州区",
							"position": [
								"93.509174",
								"42.833888"
							],
							"value": "650502"
						},
						{
							"label": "巴里坤哈萨克自治县",
							"position": [
								"93.021795",
								"43.599032"
							],
							"value": "650521"
						},
						{
							"label": "伊吾县",
							"position": [
								"94.692773",
								"43.252012"
							],
							"value": "650522"
						}
					]
				},
				{
					"label": "昌吉回族自治州",
					"position": [
						"87.304012",
						"44.014577"
					],
					"value": "652300",
					"children": [{
							"label": "昌吉市",
							"position": [
								"87.304112",
								"44.013183"
							],
							"value": "652301"
						},
						{
							"label": "阜康市",
							"position": [
								"87.98384",
								"44.152153"
							],
							"value": "652302"
						},
						{
							"label": "呼图壁县",
							"position": [
								"86.888613",
								"44.189342"
							],
							"value": "652323"
						},
						{
							"label": "玛纳斯县",
							"position": [
								"86.217687",
								"44.305625"
							],
							"value": "652324"
						},
						{
							"label": "奇台县",
							"position": [
								"89.591437",
								"44.021996"
							],
							"value": "652325"
						},
						{
							"label": "吉木萨尔县",
							"position": [
								"89.181288",
								"43.997162"
							],
							"value": "652327"
						},
						{
							"label": "木垒哈萨克自治县",
							"position": [
								"90.282833",
								"43.832442"
							],
							"value": "652328"
						}
					]
				},
				{
					"label": "博尔塔拉蒙古自治州",
					"position": [
						"82.074778",
						"44.903258"
					],
					"value": "652700",
					"children": [{
							"label": "博乐市",
							"position": [
								"82.072237",
								"44.903087"
							],
							"value": "652701"
						},
						{
							"label": "阿拉山口市",
							"position": [
								"82.569389",
								"45.16777"
							],
							"value": "652702"
						},
						{
							"label": "精河县",
							"position": [
								"82.892938",
								"44.605645"
							],
							"value": "652722"
						},
						{
							"label": "温泉县",
							"position": [
								"81.03099",
								"44.973751"
							],
							"value": "652723"
						}
					]
				},
				{
					"label": "巴音郭楞蒙古自治州",
					"position": [
						"86.150969",
						"41.768552"
					],
					"value": "652800",
					"children": [{
							"label": "库尔勒市",
							"position": [
								"86.145948",
								"41.763122"
							],
							"value": "652801"
						},
						{
							"label": "轮台县",
							"position": [
								"84.248542",
								"41.781266"
							],
							"value": "652822"
						},
						{
							"label": "尉犁县",
							"position": [
								"86.263412",
								"41.337428"
							],
							"value": "652823"
						},
						{
							"label": "若羌县",
							"position": [
								"88.168807",
								"39.023807"
							],
							"value": "652824"
						},
						{
							"label": "且末县",
							"position": [
								"85.532629",
								"38.138562"
							],
							"value": "652825"
						},
						{
							"label": "焉耆回族自治县",
							"position": [
								"86.5698",
								"42.064349"
							],
							"value": "652826"
						},
						{
							"label": "和静县",
							"position": [
								"86.391067",
								"42.31716"
							],
							"value": "652827"
						},
						{
							"label": "和硕县",
							"position": [
								"86.864947",
								"42.268863"
							],
							"value": "652828"
						},
						{
							"label": "博湖县",
							"position": [
								"86.631576",
								"41.980166"
							],
							"value": "652829"
						}
					]
				},
				{
					"label": "阿克苏地区",
					"position": [
						"80.265068",
						"41.170712"
					],
					"value": "652900",
					"children": [{
							"label": "阿克苏市",
							"position": [
								"80.2629",
								"41.171272"
							],
							"value": "652901"
						},
						{
							"label": "库车市",
							"position": [
								"82.96304",
								"41.717141"
							],
							"value": "652902"
						},
						{
							"label": "温宿县",
							"position": [
								"80.243273",
								"41.272995"
							],
							"value": "652922"
						},
						{
							"label": "沙雅县",
							"position": [
								"82.78077",
								"41.226268"
							],
							"value": "652924"
						},
						{
							"label": "新和县",
							"position": [
								"82.610828",
								"41.551176"
							],
							"value": "652925"
						},
						{
							"label": "拜城县",
							"position": [
								"81.869881",
								"41.796101"
							],
							"value": "652926"
						},
						{
							"label": "乌什县",
							"position": [
								"79.230805",
								"41.21587"
							],
							"value": "652927"
						},
						{
							"label": "阿瓦提县",
							"position": [
								"80.378426",
								"40.638422"
							],
							"value": "652928"
						},
						{
							"label": "柯坪县",
							"position": [
								"79.04785",
								"40.50624"
							],
							"value": "652929"
						}
					]
				},
				{
					"label": "克孜勒苏柯尔克孜自治州",
					"position": [
						"76.172825",
						"39.713431"
					],
					"value": "653000",
					"children": [{
							"label": "阿图什市",
							"position": [
								"76.173939",
								"39.712898"
							],
							"value": "653001"
						},
						{
							"label": "阿克陶县",
							"position": [
								"75.945159",
								"39.147079"
							],
							"value": "653022"
						},
						{
							"label": "阿合奇县",
							"position": [
								"78.450164",
								"40.937567"
							],
							"value": "653023"
						},
						{
							"label": "乌恰县",
							"position": [
								"75.25969",
								"39.716633"
							],
							"value": "653024"
						}
					]
				},
				{
					"label": "喀什地区",
					"position": [
						"75.989138",
						"39.467664"
					],
					"value": "653100",
					"children": [{
							"label": "喀什市",
							"position": [
								"75.98838",
								"39.467861"
							],
							"value": "653101"
						},
						{
							"label": "疏附县",
							"position": [
								"75.863075",
								"39.378306"
							],
							"value": "653121"
						},
						{
							"label": "疏勒县",
							"position": [
								"76.053653",
								"39.399461"
							],
							"value": "653122"
						},
						{
							"label": "英吉沙县",
							"position": [
								"76.174292",
								"38.929839"
							],
							"value": "653123"
						},
						{
							"label": "泽普县",
							"position": [
								"77.273593",
								"38.191217"
							],
							"value": "653124"
						},
						{
							"label": "莎车县",
							"position": [
								"77.248884",
								"38.414499"
							],
							"value": "653125"
						},
						{
							"label": "叶城县",
							"position": [
								"77.420353",
								"37.884679"
							],
							"value": "653126"
						},
						{
							"label": "麦盖提县",
							"position": [
								"77.651538",
								"38.903384"
							],
							"value": "653127"
						},
						{
							"label": "岳普湖县",
							"position": [
								"76.7724",
								"39.235248"
							],
							"value": "653128"
						},
						{
							"label": "伽师县",
							"position": [
								"76.741982",
								"39.494325"
							],
							"value": "653129"
						},
						{
							"label": "巴楚县",
							"position": [
								"78.55041",
								"39.783479"
							],
							"value": "653130"
						},
						{
							"label": "塔什库尔干塔吉克自治县",
							"position": [
								"75.228068",
								"37.775437"
							],
							"value": "653131"
						}
					]
				},
				{
					"label": "和田地区",
					"position": [
						"79.92533",
						"37.110687"
					],
					"value": "653200",
					"children": [{
							"label": "和田市",
							"position": [
								"79.927542",
								"37.108944"
							],
							"value": "653201"
						},
						{
							"label": "和田县",
							"position": [
								"79.81907",
								"37.120031"
							],
							"value": "653221"
						},
						{
							"label": "墨玉县",
							"position": [
								"79.736629",
								"37.271511"
							],
							"value": "653222"
						},
						{
							"label": "皮山县",
							"position": [
								"78.282301",
								"37.616332"
							],
							"value": "653223"
						},
						{
							"label": "洛浦县",
							"position": [
								"80.184038",
								"37.074377"
							],
							"value": "653224"
						},
						{
							"label": "策勒县",
							"position": [
								"80.803572",
								"37.001672"
							],
							"value": "653225"
						},
						{
							"label": "于田县",
							"position": [
								"81.667845",
								"36.854628"
							],
							"value": "653226"
						},
						{
							"label": "民丰县",
							"position": [
								"82.692354",
								"37.064909"
							],
							"value": "653227"
						}
					]
				},
				{
					"label": "伊犁哈萨克自治州",
					"position": [
						"81.317946",
						"43.92186"
					],
					"value": "654000",
					"children": [{
							"label": "伊宁市",
							"position": [
								"81.316343",
								"43.922209"
							],
							"value": "654002"
						},
						{
							"label": "奎屯市",
							"position": [
								"84.901602",
								"44.423445"
							],
							"value": "654003"
						},
						{
							"label": "霍尔果斯市",
							"position": [
								"80.420759",
								"44.201669"
							],
							"value": "654004"
						},
						{
							"label": "伊宁县",
							"position": [
								"81.524671",
								"43.977876"
							],
							"value": "654021"
						},
						{
							"label": "察布查尔锡伯自治县",
							"position": [
								"81.150874",
								"43.838883"
							],
							"value": "654022"
						},
						{
							"label": "霍城县",
							"position": [
								"80.872508",
								"44.049912"
							],
							"value": "654023"
						},
						{
							"label": "巩留县",
							"position": [
								"82.227044",
								"43.481618"
							],
							"value": "654024"
						},
						{
							"label": "新源县",
							"position": [
								"83.258493",
								"43.434249"
							],
							"value": "654025"
						},
						{
							"label": "昭苏县",
							"position": [
								"81.126029",
								"43.157765"
							],
							"value": "654026"
						},
						{
							"label": "特克斯县",
							"position": [
								"81.840058",
								"43.214861"
							],
							"value": "654027"
						},
						{
							"label": "尼勒克县",
							"position": [
								"82.504119",
								"43.789737"
							],
							"value": "654028"
						}
					]
				},
				{
					"label": "塔城地区",
					"position": [
						"82.985732",
						"46.746301"
					],
					"value": "654200",
					"children": [{
							"label": "塔城市",
							"position": [
								"82.983988",
								"46.746281"
							],
							"value": "654201"
						},
						{
							"label": "乌苏市",
							"position": [
								"84.677624",
								"44.430115"
							],
							"value": "654202"
						},
						{
							"label": "额敏县",
							"position": [
								"83.622118",
								"46.522555"
							],
							"value": "654221"
						},
						{
							"label": "沙湾县",
							"position": [
								"85.622508",
								"44.329544"
							],
							"value": "654223"
						},
						{
							"label": "托里县",
							"position": [
								"83.60469",
								"45.935863"
							],
							"value": "654224"
						},
						{
							"label": "裕民县",
							"position": [
								"82.982157",
								"46.202781"
							],
							"value": "654225"
						},
						{
							"label": "和布克赛尔蒙古自治县",
							"position": [
								"85.733551",
								"46.793001"
							],
							"value": "654226"
						}
					]
				},
				{
					"label": "阿勒泰地区",
					"position": [
						"88.13963",
						"47.848393"
					],
					"value": "654300",
					"children": [{
							"label": "阿勒泰市",
							"position": [
								"88.138743",
								"47.848911"
							],
							"value": "654301"
						},
						{
							"label": "布尔津县",
							"position": [
								"86.86186",
								"47.70453"
							],
							"value": "654321"
						},
						{
							"label": "富蕴县",
							"position": [
								"89.524993",
								"46.993106"
							],
							"value": "654322"
						},
						{
							"label": "福海县",
							"position": [
								"87.494569",
								"47.113128"
							],
							"value": "654323"
						},
						{
							"label": "哈巴河县",
							"position": [
								"86.418964",
								"48.059284"
							],
							"value": "654324"
						},
						{
							"label": "青河县",
							"position": [
								"90.381561",
								"46.672446"
							],
							"value": "654325"
						},
						{
							"label": "吉木乃县",
							"position": [
								"85.876064",
								"47.434633"
							],
							"value": "654326"
						}
					]
				},
				{
					"label": "石河子市",
					"position": [
						"86.041075",
						"44.305886"
					],
					"value": "659001",
					"children": [{
							"label": "兵团一五二团",
							"position": [
								"86.0704",
								"44.2827"
							],
							"value": "659001"
						},
						{
							"label": "红山街道",
							"position": [
								"86.048",
								"44.2682"
							],
							"value": "659001"
						},
						{
							"label": "向阳街道",
							"position": [
								"86.0397",
								"44.3429"
							],
							"value": "659001"
						},
						{
							"label": "东城街道",
							"position": [
								"86.0687",
								"44.2873"
							],
							"value": "659001"
						},
						{
							"label": "石河子乡",
							"position": [
								"86.1022",
								"44.1352"
							],
							"value": "659001"
						},
						{
							"label": "老街街道",
							"position": [
								"85.9909",
								"44.3496"
							],
							"value": "659001"
						},
						{
							"label": "北泉镇",
							"position": [
								"86.0983",
								"44.4346"
							],
							"value": "659001"
						},
						{
							"label": "新城街道",
							"position": [
								"85.9823",
								"44.2893"
							],
							"value": "659001"
						}
					]
				},
				{
					"label": "阿拉尔市",
					"position": [
						"81.285884",
						"40.541914"
					],
					"value": "659002",
					"children": [{
							"label": "幸福路街道",
							"position": [
								"81.2681",
								"40.577"
							],
							"value": "659002"
						},
						{
							"label": "阿拉尔农场",
							"position": [
								"81.0627",
								"40.5567"
							],
							"value": "659002"
						},
						{
							"label": "兵团第一师幸福农场",
							"position": [
								"80.9904",
								"40.7025"
							],
							"value": "659002"
						},
						{
							"label": "工业园区",
							"position": [
								"81.2448",
								"40.5461"
							],
							"value": "659002"
						},
						{
							"label": "兵团七团",
							"position": [
								"80.6543",
								"40.6569"
							],
							"value": "659002"
						},
						{
							"label": "兵团十一团",
							"position": [
								"81.5619",
								"40.6277"
							],
							"value": "659002"
						},
						{
							"label": "托喀依乡",
							"position": [
								"81.3541",
								"40.5818"
							],
							"value": "659002"
						},
						{
							"label": "青松路街道",
							"position": [
								"81.2545",
								"40.542"
							],
							"value": "659002"
						},
						{
							"label": "兵团八团",
							"position": [
								"80.7996",
								"40.5973"
							],
							"value": "659002"
						},
						{
							"label": "兵团第一师水利水电工程处",
							"position": [
								"81.2858",
								"40.5496"
							],
							"value": "659002"
						},
						{
							"label": "中心监狱",
							"position": [
								"81.2766",
								"40.6692"
							],
							"value": "659002"
						},
						{
							"label": "兵团第一师塔里木灌区水利管理处",
							"position": [
								"81.2876",
								"40.5454"
							],
							"value": "659002"
						},
						{
							"label": "兵团十四团",
							"position": [
								"81.8688",
								"40.9423"
							],
							"value": "659002"
						},
						{
							"label": "兵团十团",
							"position": [
								"81.259",
								"40.6387"
							],
							"value": "659002"
						},
						{
							"label": "金银川路街道",
							"position": [
								"81.2613",
								"40.5355"
							],
							"value": "659002"
						},
						{
							"label": "兵团十三团",
							"position": [
								"81.4734",
								"40.5742"
							],
							"value": "659002"
						},
						{
							"label": "南口街道",
							"position": [
								"81.2988",
								"40.5154"
							],
							"value": "659002"
						},
						{
							"label": "兵团十六团",
							"position": [
								"80.7871",
								"40.4163"
							],
							"value": "659002"
						},
						{
							"label": "兵团十二团",
							"position": [
								"81.1109",
								"40.4977"
							],
							"value": "659002"
						}
					]
				},
				{
					"label": "图木舒克市",
					"position": [
						"79.077978",
						"39.867316"
					],
					"value": "659003",
					"children": [{
							"label": "兵团四十九团",
							"position": [
								"78.756",
								"39.8224"
							],
							"value": "659003"
						},
						{
							"label": "兵团图木舒克市永安坝",
							"position": [
								"79.0133",
								"39.8385"
							],
							"value": "659003"
						},
						{
							"label": "兵团五十一团",
							"position": [
								"79.2902",
								"39.9888"
							],
							"value": "659003"
						},
						{
							"label": "前海街道",
							"position": [
								"79.0778",
								"39.855"
							],
							"value": "659003"
						},
						{
							"label": "兵团图木舒克市喀拉拜勒镇",
							"position": [
								"79.0112",
								"39.8526"
							],
							"value": "659003"
						},
						{
							"label": "永安坝街道",
							"position": [
								"79.0229",
								"39.8507"
							],
							"value": "659003"
						},
						{
							"label": "齐干却勒街道",
							"position": [
								"79.0906",
								"39.8753"
							],
							"value": "659003"
						},
						{
							"label": "兵团五十团",
							"position": [
								"79.2315",
								"39.9549"
							],
							"value": "659003"
						},
						{
							"label": "兵团五十三团",
							"position": [
								"79.3214",
								"40.0318"
							],
							"value": "659003"
						},
						{
							"label": "兵团四十四团",
							"position": [
								"79.1926",
								"39.9168"
							],
							"value": "659003"
						}
					]
				},
				{
					"label": "五家渠市",
					"position": [
						"87.526884",
						"44.167401"
					],
					"value": "659004",
					"children": [{
							"label": "兵团一零二团",
							"position": [
								"87.5925",
								"44.2694"
							],
							"value": "659004"
						},
						{
							"label": "军垦路街道",
							"position": [
								"87.5084",
								"44.1889"
							],
							"value": "659004"
						},
						{
							"label": "人民路街道",
							"position": [
								"87.5728",
								"44.1822"
							],
							"value": "659004"
						},
						{
							"label": "兵团一零一团",
							"position": [
								"87.5562",
								"44.1752"
							],
							"value": "659004"
						},
						{
							"label": "兵团一零三团",
							"position": [
								"87.4075",
								"44.5317"
							],
							"value": "659004"
						},
						{
							"label": "青湖路街道",
							"position": [
								"87.5245",
								"44.1764"
							],
							"value": "659004"
						}
					]
				},
				{
					"label": "北屯市",
					"position": [
						"87.824932",
						"47.353177"
					],
					"value": "659005",
					"children": [{
							"label": "北屯镇",
							"position": [
								"87.7224",
								"47.4017"
							],
							"value": "659005"
						},
						{
							"label": "兵团一八八团",
							"position": [
								"87.5186",
								"47.4099"
							],
							"value": "659005"
						},
						{
							"label": "兵团一八七团",
							"position": [
								"87.761",
								"47.1948"
							],
							"value": "659005"
						},
						{
							"label": "兵团一八三团",
							"position": [
								"88.1187",
								"47.1285"
							],
							"value": "659005"
						}
					]
				},
				{
					"label": "铁门关市",
					"position": [
						"85.501218",
						"41.827251"
					],
					"value": "659006",
					"children": [{
							"label": "农二师三十团",
							"position": [
								"85.5849",
								"41.8825"
							],
							"value": "659006"
						},
						{
							"label": "兵团二十九团",
							"position": [
								"85.5849",
								"41.8825"
							],
							"value": "659006"
						}
					]
				},
				{
					"label": "双河市",
					"position": [
						"82.353656",
						"44.840524"
					],
					"value": "659007",
					"children": [{
							"label": "兵团八十九团",
							"position": [
								"82.2853",
								"45.0582"
							],
							"value": "659007"
						},
						{
							"label": "兵团八十六团",
							"position": [
								"82.1787",
								"44.8089"
							],
							"value": "659007"
						},
						{
							"label": "兵团八十四团",
							"position": [
								"82.215",
								"45.1246"
							],
							"value": "659007"
						},
						{
							"label": "兵团九十团",
							"position": [
								"82.6473",
								"44.7651"
							],
							"value": "659007"
						},
						{
							"label": "兵团八十一团",
							"position": [
								"82.4908",
								"44.7469"
							],
							"value": "659007"
						}
					]
				},
				{
					"label": "可克达拉市",
					"position": [
						"80.63579",
						"43.6832"
					],
					"value": "659008",
					"children": [{
							"label": "兵团六十八团",
							"position": [
								"80.9903",
								"43.8897"
							],
							"value": "659008"
						},
						{
							"label": "都拉塔口岸",
							"position": [
								"80.6882",
								"43.7131"
							],
							"value": "659008"
						},
						{
							"label": "兵团六十七团",
							"position": [
								"80.6068",
								"43.7652"
							],
							"value": "659008"
						},
						{
							"label": "兵团六十六团",
							"position": [
								"81.086",
								"43.9599"
							],
							"value": "659008"
						},
						{
							"label": "兵团六十三团",
							"position": [
								"80.4844",
								"43.931"
							],
							"value": "659008"
						},
						{
							"label": "兵团六十四团",
							"position": [
								"80.6749",
								"44.0986"
							],
							"value": "659008"
						}
					]
				},
				{
					"label": "昆玉市",
					"position": [
						"79.287372",
						"37.207994"
					],
					"value": "659009",
					"children": [{
							"label": "乌鲁克萨依乡",
							"position": [
								"80.8148",
								"36.2925"
							],
							"value": "659009"
						},
						{
							"label": "奴尔乡",
							"position": [
								"81.0072",
								"36.2605"
							],
							"value": "659009"
						},
						{
							"label": "普恰克其乡",
							"position": [
								"79.783",
								"37.5805"
							],
							"value": "659009"
						},
						{
							"label": "乌尔其乡",
							"position": [
								"79.5866",
								"37.332"
							],
							"value": "659009"
						},
						{
							"label": "博斯坦乡",
							"position": [
								"81.3298",
								"36.4124"
							],
							"value": "659009"
						},
						{
							"label": "兵团四十七团",
							"position": [
								"79.6039",
								"37.3666"
							],
							"value": "659009"
						},
						{
							"label": "兵团皮山农场",
							"position": [
								"78.5171",
								"37.563"
							],
							"value": "659009"
						},
						{
							"label": "喀拉喀什镇",
							"position": [
								"79.7678",
								"37.2867"
							],
							"value": "659009"
						},
						{
							"label": "阔依其乡",
							"position": [
								"79.6876",
								"37.3691"
							],
							"value": "659009"
						},
						{
							"label": "兵团一牧场",
							"position": [
								"81.0295",
								"36.3152"
							],
							"value": "659009"
						},
						{
							"label": "兵团二二四团",
							"position": [
								"79.3401",
								"37.416"
							],
							"value": "659009"
						}
					]
				},
				{
					"label": "胡杨河市",
					"position": [
						"84.8275959",
						"44.69288853"
					],
					"value": "659010",
					"children": [{
							"label": "兵团一三零团",
							"position": [
								"84.8765",
								"44.6164"
							],
							"value": "659010"
						},
						{
							"label": "五五新镇街道",
							"position": [
								"84.8012",
								"44.865"
							],
							"value": "659010"
						},
						{
							"label": "兵团一二八团",
							"position": [
								"84.5572",
								"45.0861"
							],
							"value": "659010"
						},
						{
							"label": "兵团一二九团",
							"position": [
								"84.8046",
								"44.8465"
							],
							"value": "659010"
						}
					]
				}
			]
		},
		{
			"label": "台湾省",
			"position": [
				"121.509062",
				"25.044332"
			],
			"value": "710000",
			"children": []
		},
		{
			"label": "香港特别行政区",
			"position": [
				"114.173355",
				"22.320048"
			],
			"value": "810000",
			"children": [{
					"label": "中西区",
					"position": [
						"114.1543731",
						"22.28198083"
					],
					"value": "810001",
					"children": []
				},
				{
					"label": "湾仔区",
					"position": [
						"114.1829153",
						"22.27638889"
					],
					"value": "810002",
					"children": []
				},
				{
					"label": "东区",
					"position": [
						"114.2260031",
						"22.27969306"
					],
					"value": "810003",
					"children": []
				},
				{
					"label": "南区",
					"position": [
						"114.1600117",
						"22.24589667"
					],
					"value": "810004",
					"children": []
				},
				{
					"label": "油尖旺区",
					"position": [
						"114.1733317",
						"22.31170389"
					],
					"value": "810005",
					"children": []
				},
				{
					"label": "深水埗区",
					"position": [
						"114.1632417",
						"22.33385417"
					],
					"value": "810006",
					"children": []
				},
				{
					"label": "九龙城区",
					"position": [
						"114.1928467",
						"22.31251"
					],
					"value": "810007",
					"children": []
				},
				{
					"label": "黄大仙区",
					"position": [
						"114.2038856",
						"22.33632056"
					],
					"value": "810008",
					"children": []
				},
				{
					"label": "观塘区",
					"position": [
						"114.2140542",
						"22.32083778"
					],
					"value": "810009",
					"children": []
				},
				{
					"label": "荃湾区",
					"position": [
						"114.1210792",
						"22.36830667"
					],
					"value": "810010",
					"children": []
				},
				{
					"label": "屯门区",
					"position": [
						"113.9765742",
						"22.39384417"
					],
					"value": "810011",
					"children": []
				},
				{
					"label": "元朗区",
					"position": [
						"114.0324381",
						"22.44142833"
					],
					"value": "810012",
					"children": []
				},
				{
					"label": "北区",
					"position": [
						"114.1473639",
						"22.49610389"
					],
					"value": "810013",
					"children": []
				},
				{
					"label": "大埔区",
					"position": [
						"114.1717431",
						"22.44565306"
					],
					"value": "810014",
					"children": []
				},
				{
					"label": "西贡区",
					"position": [
						"114.264645",
						"22.31421306"
					],
					"value": "810015",
					"children": []
				},
				{
					"label": "沙田区",
					"position": [
						"114.1953653",
						"22.37953167"
					],
					"value": "810016",
					"children": []
				},
				{
					"label": "葵青区",
					"position": [
						"114.1393194",
						"22.36387667"
					],
					"value": "810017",
					"children": []
				},
				{
					"label": "离岛区",
					"position": [
						"113.94612",
						"22.28640778"
					],
					"value": "810018",
					"children": []
				}
			]
		},
		{
			"label": "澳门特别行政区",
			"position": [
				"113.54909",
				"22.198951"
			],
			"value": "820000",
			"children": [{
					"label": "花地玛堂区",
					"position": [
						"113.5528956",
						"22.20787"
					],
					"value": "820001",
					"children": []
				},
				{
					"label": "花王堂区",
					"position": [
						"113.5489608",
						"22.1992075"
					],
					"value": "820002",
					"children": []
				},
				{
					"label": "望德堂区",
					"position": [
						"113.5501828",
						"22.19372083"
					],
					"value": "820003",
					"children": []
				},
				{
					"label": "大堂区",
					"position": [
						"113.5536475",
						"22.18853944"
					],
					"value": "820004",
					"children": []
				},
				{
					"label": "风顺堂区",
					"position": [
						"113.5419278",
						"22.18736806"
					],
					"value": "820005",
					"children": []
				},
				{
					"label": "嘉模堂区",
					"position": [
						"113.5587044",
						"22.15375944"
					],
					"value": "820006",
					"children": []
				},
				{
					"label": "路凼填海区",
					"position": [
						"113.5695992",
						"22.13663"
					],
					"value": "820007",
					"children": []
				},
				{
					"label": "圣方济各堂区",
					"position": [
						"113.5599542",
						"22.12348639"
					],
					"value": "820008",
					"children": []
				}
			]
		}
	]
export default {
	data:data
}